{
  "personality": null,
  "timestamp": "2025-10-10T04:38:43.099812",
  "category": "Other",
  "news_summary": "Today's positive news highlights opportunities for career flexibility in science, Slovakia's commitment to European collaboration and development initiatives, and Angola's promotion of the economic potential of the Lobito Corridor.",
  "news_summary_fr": "Les nouvelles positives d'aujourd'hui mettent en lumière les possibilités de flexibilité de carrière dans le domaine scientifique, l'engagement de la Slovaquie en faveur de la collaboration européenne et des initiatives de développement, et la promotion par l'Angola du potentiel économique du corridor de Lobito.",
  "news_summary_es": "Las noticias positivas de hoy destacan las oportunidades de flexibilidad profesional en la ciencia, el compromiso de Eslovaquia con la colaboración europea y las iniciativas de desarrollo, y la promoción por Angola del potencial económico del Corredor de Lobito.",
  "articles": [
    {
      "title": "How to pause and restart your science career",
      "summary": "Nature, Published online: 09 October 2025; doi:10.1038/d41586-025-02899-8Funding crises, bereavement and a supervisor’s relocation can derail your career path, but you can overcome them.",
      "content": "Julie Gould 00:01\n\nHello and welcome to Working Scientist, a Nature Careers podcast. I’m Julie Gould. This is the fifth episode of our career planning series. Each episode concludes with a sponsored slot from the International Science Council, with support of the China Association for Science and Technology.\n\nThe ISC is exploring how early and mid-career researchers can navigate their careers in a constantly-evolving scientific landscape through conversations with emerging and established scientists.\n\nIn this series so far, we’ve explored what career planning theory is, how career guidance practitioners apply the theory to their practice, some tips on how to get your own career planning started, and how others have planned their careers.\n\nBut sometimes even the best-laid plans don’t work out, and it can feel like your entire career has come to a halt.\n\nAnd that’s what we’re going to hear about today, how some scientists have dealt with projects that don’t work out, political changes, financial crises and leadership changes that have all influenced their career paths.\n\nAnd we’ll also hear from a careers coach on how people can deal with career plans going awry. But don’t forget to stay with us until the end to hear from the International Science Council.\n\nIn your early career, one of the main influences (and hopefully supporters that you’ll have) is your PhD supervisor. This person guides and mentors you through your research journey, helping you refine a research topic, develop methodologies and stay on track towards completing your thesis.\n\nThey’ll hopefully provide feedback on research progress, writing and presentations, while also supporting your professional development.\n\nUltimately, they can act as both an advisor and a collaborator to help you grow into an independent researcher.\n\nThis means, if you find a good one, you’ll follow them, which is what Katja Loos did during her early career in chemistry.\n\nKatja is now a professor of polymer chemistry at the University of Groningen in the Netherlands.\n\nBut she started her chemistry career with a PhD in organic and polymer chemistry with Reimund Stadler at Johannes Gutenberg University Mainz, in Germany, in 1996\n\nKatja Loos 02:00\n\nI started my PhD already in Mainz, and he decided to take a new, very good position at the University of Bayreuth.\n\nSo basically, in the beginning of my PhD, he decided to move. And of course, the group needs to move with him.\n\nAnd then, yeah, we basically just moved.\n\nAnd, yeah, he had cancer, and really such an aggressive form. I still remember it. It was quite shocking. So in a matter of weeks, from a healthy person, he was dead.\n\nJulie Gould 02:35\n\nSo not only was she in a new city and at a new university, but she was also now without a supervisor. This was not what she had planned. Katja and her research peers all had a lot of concerns about their future.\n\nKatja Loos 02:48\n\nThe question is, yeah, will the university help you? Will they even continue to pay you?\n\nBecause in Germany, we are, like, paid, we don’t have scholarships or something. And, yeah, so there are quite some, this.\n\nI mean, if you’re in the beginning, you basically could go somewhere else and start. But somehow, I decided to stay.\n\nWe also got quite some help from people at the university. So the people at the university helped us to keep our, let’s say, positions. And also from professors from inside and outside.\n\nAnd then, of course, also my next supervisor, Axel Müller, who came, who took the position. So, yeah, it was really great how actually the support system helped us.\n\nJulie Gould 03:41\n\nYeah, luckily, you had the support from the people around you. Did you have support from your peers too?\n\nLike, did you sort of help each other, not, maybe not with the financial side of, you know, ”We’re still going to get paid.” But, like, from a sort of emotional support system. Did you find that useful?\n\nKatja Loos 03:58\n\nYes, so, so I think we moved with like, 50 people in total, the group.\n\nAnd of course, I mean, yeah, when you move, you’re already, like, doing a lot, like even, you know, helping carry furniture and stuff.\n\nAnd then this happened, so that was quite, yeah. And then, usually in chemistry, the older PhD students, anyway help the younger PhD students. But you’re right. I mean, it gives it more coherence.\n\nJulie Gould 04:29\n\nWhat advice do you have for people who have to deal with something like this? Where a professor or supervisor is heavily involved in, you know, the direction of your research and potentially big influence on your career passes away? How would you advise people to deal with that?\n\nKatja Loos 04:47\n\nFor instance, at our university now in Groningen, it’s mandatory that all PhD students have a second supervisor.\n\nI still think it’s a good thing that, let’s say most universities I think now have this.\n\nBut if your university doesn’t have it, maybe you keep an eye open for let’s say that it’s not an official second supervisor, but someone who still could help you if, yeah, hopefully never, but something happens.\n\nJulie Gould 05:19\n\nKatja’s career goal at the time, as was the norm in Germany for those studying chemistry, was to find a position in industry.\n\nBut in 2001, after completing her PhD at the University of Bayreuth in Germany, the financial crisis got in her way.\n\nKatja Loos 05:33\n\nI mean, there were no jobs at all. So all the people who wrote applications, they didn’t even get an answer.\n\nAnd so it was clear that, I mean, if I now write 100 applications, I will not get a job in industry.\n\nSo it was clear that I, either, you know, just wait, travel the world, or do nothing. Or maybe do a postdoc. So I decided for the postdoc.\n\nJulie Gould 06:07\n\nWhy did you decide that?\n\nKatja Loos 06:10\n\nI didn’t want to sit at home and just travelling the world? It sounds nice, but I also know myself, this is not.\n\nI would probably also get bored, let alone I wouldn’t have the financial needs to travel the world. Or you take a completely different stop. I maybe you could have gone to, I don’t know, finance or anything. But also this, I didn’t want to.\n\nI mean, after all, I mean, you spent 10 years more or less for this study, then you don’t do anything with it. It also sounded strange to me\n\nJulie Gould 06:47\n\nTowards the end of the postdoc, did you think again? Is it time for me to have another look at industry? Or like, how did the sort of, how did your career plan go from there?\n\nKatja Loos 06:58\n\nSo I thought still about industry. But because I liked research, I mean, it’s different when you’re a postdoc, you have more free freedom.\n\nAnd especially because I had my own money, sort of, I could do whatever I want. I mean, you do still what the group sort of does.\n\nBut it was really nice, and then I was undecided. Maybe I should go to university or go to industry.\n\nSo I actually also applied at industry. But this offer from Groningen came quite fast.\n\nJulie Gould 07:34\n\nSo instead of pursuing a career in industry, Katja has now spent her career in academia, following the tenure track system, and ultimately becoming a full professor at Groningen University in 2012.\n\nIt’s not what she envisioned when she started out, and she never imagined she’d do this. But she loved chemistry, and still does, and has flourished whilst doing it. Most notably, she was appointed the Knight of the order of the Dutch Lion in 2023 for her work in green alternative chemistry.\n\nFor Katya, the major challenges in career path choices might be behind her, but for Mariana Viglino, who studies fossil dolphins and is a researcher at CONICET in Patagonia, Argentina, she’s right in the thick of it.\n\nHer career goal is to build and develop her own research group as a permanent academic somewhere.\n\nThings started well. She did a PhD, a postdoc, and then got a permanent position at CONICET.\n\nDuring this early stage of her career, Mariana said she didn’t have any time or energy to plan ahead and think about her future career. Her focus was the work right in front of her. Our conversation starts with me asking her what sort of careers advice she might have been given as a young researcher.\n\nMariana Viglino 08:41\n\nI wouldn’t say advice. I was advised as what was expected if I wanted to have a career as a researcher in CONICET. Sort of like, ”If you want to continue this path, you must do this, this and that.”\n\nGoing back to my university, the only, it’s sort of like, we were given the scenario that the only possibility that we have as a job was to be a researcher in CONICET.\n\nSo that was like, you’re supposed to have that goal, and that was the only path. I don’t think any other career options were presented to us.\n\nThat was like, that was the path that you have to do, otherwise you’re sort of like a frustrated biologist.\n\nBut when I was in my PhD, I was told, like ”You’re expected to do this, this and that, and if you want to continue, basically you have to publish articles like crazy.”\n\nThat is the sort of insurance that will allow you to continue moving forward.\n\nJulie Gould 09:35\n\nOkay? And how did you feel when you were given that advice?\n\nMariana Viglino 09:39\n\nI think at that point I did, I didn’t question myself what was the path that I wanted to take. I think I was automatically following what was expected. I didn’t question whether that was what I wanted.\n\nAnd when I got to this position as a researcher, I think that was a breaking point for me where I said, ”Okay, I got to this.” What felt like an unattainable goal, I did it. I got here. So now what am I going to do?\n\nI sort of like, just follow the steps of a recipe that I was told I was going to give me sort of a successful position.\n\nAnd when I got to that, I was like, ”Okay, what do I want to do now? What sort of profession I want to do? What sort of research group I want to create from now, now on? What sort of role model I want for my students when I have them?”\n\nWhen I have them that sort of questions, I don’t think I ever had the mental space for them until I got to that point in my career.\n\nJulie Gould 10:37\n\nSo what about now, then?\n\nSo now you’re in the permanent research position. And you know, to use your words, you have, you have some more time and space, mental space, to think.\n\nHave you done any career planning since you started this position? And you know, how’s it going?\n\nMariana Viglino 10:55\n\nMy personality is, I’m a bit of a person that needs to have everything organized and plan ahead. I think during my PhD and postdoc, I learned that there is just a bit of things that I can plan ahead.\n\nThe rest is just life happening. I cannot control everything.\n\nSo at this point, I wanted to, when I got to this position as a researcher, I started questioning myself, what kind of researcher I want to be.\n\nAnd I said, ”Okay, I want to be a researcher who’s more inclusive with students, who’s more in touch with their mental health and what they would want to do, and sort of show them that there are other options if they want to.”\n\nAnd I think I started thinking of those things I want. I want to continue doing, networking with colleagues abroad. That’s something that I want to continue doing, which I did before.\n\nBecause those are really wonderful experiences, not only going abroad and working with someone, but also the experience of visiting other countries, the way people work elsewhere, and maybe taking ideas from them.\n\nI had all those ideas, and then chaos began in the country. So now all that has to be put on pause, on hold, because everything that I wanted to do is just unattainable for me at the moment, and sort of a surviving mode.\n\nJulie Gould 12:34\n\nThe dire situation for scientific research in Argentina is linked to politics, where the government, led by Javier Milei, has made massive cuts to government spending to reduce the deficit and bring down inflation.\n\nAnd one area that has taken a major hit is scientific research. Milei has vowed to demolish CONICET, the government-funded research institute that Mariana works at.\n\nAnd according to a news piece from Nature, the main funder for research projects in the country, the National Agency for the Promotion of Research, Technological Development and Innovation, hasn’t put out a call for new projects for almost two years.\n\nThis is why Mariana and many other scientists in Argentina are in survival mode. CONICET has only been paying Mariana her basic salary, which means she’s not been able to develop her research or the research group that she was so excited about.\n\nSo I asked Mariana how she’s adapted or reassessed her career plan since all this started.\n\nMariana Viglino 13:24\n\nThe sort of survival mode that I’m saying that I’ve been in means just barely getting my required articles published, and that’s it.\n\nSo I had to rearrange my priorities in terms of, instead of looking for, for example, for students, and try to build a new research group of my own and collaborate with others, I i need to first, first and foremost, keep myself, or try to give myself, which is actually crazy what I’m saying, try to keep myself publishing, no matter what, doing my best with that.\n\nAnd then maybe later on I can focus on the other ideas. But for now, that was sort of the rearrangement of priorities that I had to do.\n\nJulie Gould 14:10\n\nHaving to press pause on your career development like this because of something that is out of your control isn’t easy to handle. I asked Mariana how she did it.\n\nMariana Viglino 14:19\n\nWell for me, going back to therapy was really important.\n\nI think whatever tools are good for you, watching your mental health and making sure that you’re okay, I think that’s first and foremost, the most important thing to do, because if you go crazy, there’s, I mean, there’s no job who’s going to take care of that.\n\nYou need to take care of yourself, first, see what you need to be okay, and then then comes work and any kind of project that you might have with work and whatever unexpected thing might come your way. But for me, I think that was the most important, and having my family and my friends and my partner with me sort of like a. Supportiveness around that chaos that was also very important.\n\nJulie Gould 15:05\n\nWhat Mariana was doing can be explained by something called Maslow’s Hierarchy of Needs, which can explore people’s different motivations for working. It’s a psychological illustration of how you cope with different things in life.\n\nCareers coach and organizational psychology professor Julia Yates from city St George’s University in London, UK, told me.\n\nJulia Yates 15:24\n\nIt talks about people’s different motivations and needs in terms of a hierarchy.\n\nRight at the top of the hierarchy is what Maslow calls self actualization. And that’s really, as scientists and academics, that’s really what we think about a lot in terms of jobs.\n\nSelf-actualization is is trying to find a job that gives you purpose and allows you to be the best version of yourself that can be, and allows your strengths to meet the kind of needs of the world. And you know, it’s all a sort of beautiful, fulfilling, purpose-filled job.\n\nBut that’s right at the top of Maslow’s Hierarchy of Needs, and further down his hierarchy of leads are things like: Have you got enough money to feed yourself? Are you safe? Are you, do you have sort of healthy relationships around you?\n\nAnd it’s actually impossible, according to Maslow’s Hierarchy of Needs, it’s impossible to be thinking about self actualization when you’re not confident, you’ve got a roof over your head.\n\nSo actually, there are sometimes times in our lives when we have to stop thinking about self-actualization and our higher purpose and whether or not we’re being deeply fulfilled by work, and we just need to bring some money in.\n\nAnd if we can bring the money in, then we’ve got food on the table, our family’s safe. We’ve got somewhere to live.\n\nAnd once that’s all sorted and safe, then we can go back up to self-actualization at the top and start thinking again about our purpose and whether or not we’re kind of, you know, using our strengths in the world in the way that we want to.\n\nSo I think there’s also something, you know, if people are in certain situations, it’s absolutely fine to just think: ”For now. I’m not going to think about whether this is the perfect job. I’m just going to think that this is a job and that is what I need right now.”\n\nJulie Gould 17:08\n\nSo Mariana, when I spoke with her earlier this year, was not able to position herself into that top level of Maslow’s hierarchy.\n\nInstead, she had to think about her other needs, job security and basic survival.\n\nLast month, I caught up with Mariana as she was finishing her first week at a three-month work placement in Germany. I wanted to know how her mindset has changed since she arrived in Germany to start her placement.\n\nMariana Viglino 17:32\n\nEven though I’ve been here only a few days, it has changed dramatically. I think having a different working environment and not having like all the time to think about if I’m going to make it to the end of the month I need to cover my expenses. What are we going to do? My colleagues are getting out of their jobs. We don’t know what to do. The future is completely uncertain.\n\nI think for just for a little while, to be outside of that and just focus on doing science has really brought my creativity, and I think it kind of put me into a lighter mood, into a better mood.\n\nI feel like I put on some, I lost some weight back home for a bit. I do feel guilty about it, though. I don’t like to feel like this, but it really makes a difference when you have a healthier working environment.\n\nBut to be completely honest, it has changed me quite a bit. And I think I really miss having a more, yeah, more positive working environment.\n\nJulie Gould 18:35\n\nAmazing. Well, I’m so pleased to hear that you’re, you’re feeling much more positive because it was, you know, it was, it wasn’t a good space that you were in earlier this year. I’m really, really happy.\n\nOkay, is there anything else that you’d like to tell me for this particular podcast? Maybe some advice for anybody who, you know, has these career plans and then, through no fault of their own, plans get put on hold or plans get derailed, like how to handle it, how to manage it.\n\nMariana Viglino 19:04\n\nI know it sounds cliche, but try to follow your dreams as much as you can, at least if you have the opportunity to do it.\n\nBut I would say, basically, yeah, trust your gut.\n\nI mean, if you think academia is the world that you want to be in, I know it’s hard, I’m not going to idolize it, it has its own difficulties. But I would advise if you like it, just go for it and see where that path leads you.\n\nJulie Gould 19:29\n\nWhatever career path Mariana follows her experience so far will stand her in good stead and prepare her well for whatever comes next.\n\nBut sometimes the challenges we face aren’t as big as a political shift. Sometimes maybe just a project didn’t work out. This is something that Poland-based Tomasz Glowacki faced.\n\nHe’s the chief AI Officer at OmniShelf and chief AI advisor at Seraphim Defence Systems. He started his scientific career in academia, but moved to industry shortly after completing his PhD in computer science in 2013.\n\nWhilst there, he learned how to create career plans under the guidance of a manager who started him off with a very rigid plan. But ultimately that wasn’t helpful for him.\n\nTomasz Glowacki 20:09\n\nMy first plans were very rigid, and this was the project I should complete. This was the exact skills I should learn, and it was really detailed.\n\nAnd it wasn’t good. It wasn’t good because the environment change dynamically. And there was a situation that part of my plan was participating in the project that never happened. So then you cannot do your plan.\n\nAnd industry is very dynamic. I used to work for big companies, but as well for startups. And startup environment is very quick. It’s not easy to plan year ahead what you will be doing.\n\nSo what changed during my career was that this planning went from the very detailed list of what should you do to the list of different activities.\n\nAnd you don’t, don’t need to do all of them. So then there is a start, there is destination point, and there is also list of projects, list of certification. There is a list of people to talk. There is a list of books, papers to read. There is a list of skills to acquire.\n\nBut this is the journey. So you don’t need to do all of this. This is, this is, I would say this is like a lighthouse. It shows you what direction you go, but you don’t need to do everything, and one after another one, to be successful.\n\nSo this how my plan has changed over time. It’s not anymore about doing everything step by step. It’s rather showing the road. But you do not have to accomplish everything.\n\nJulie Gould 22:07\n\nI like this message from Tomasz that ultimately the planning doesn’t have to be (and often it’s important that it isn’t too detailed and specific). There are things within your life, your working career, that you cannot control, like the project Thomasz was working on before it got canceled.\n\nOr the political environment in your country changing like with Mariana, or your supervisor suddenly passing away as Katya experienced. And over time, Tomasz learned...\n\nTomasz Glowacki 22:30\n\n....planning is more important than plan, so the activity itself, when you discuss about where you are, you are getting the feedback, you are learning about the organization is most important.\n\nBut also what is important, you are learning over the way. So the more you learn about during the way, you can change your attitude, you can change your plans. You can say, I have tested and I would like to do something different. And this is important.\n\nI believe that we should not stick to the plan. It’s not about the plan, it’s about the planning. It’s about the learning.\n\nJulie Gould 23:10\n\nToday, careers can be pushed off path for many different reasons, whether they’re political or health-related, and sometimes things will get tough. That’s life.\n\nIt’s not always smooth sailing, and we really should never expect it to be either. And these tough times will appear on your CV, whether you had to change jobs suddenly, or you had to take leave to take care of a family or friend, or whether you got sick or just needed the break, whatever the situation.\n\nJulia Yates 23:35\n\nThose are all things you can recover from. Everything that you do, every opportunity that you take, you will learn something from and gain something from even if it’s the most awful experience, you will get through it and you will learn from it. And that will make you sort of clearer about what you want in the future.\n\nSo actually, you know, sometimes the advice is not to worry about it too much, just do whatever you have to do, and when you’re ready to rethink about it, have a chat with somebody and try and work out how to get yourself back on track.\n\nBut you will be able to. It will work out.\n\nJulie Gould 24:08\n\nIt’s often hard to do, though, you know, so it’s easier, easier said than done, to not worry.\n\nJulia Yates 24:14\n\n100%. Exactly right. When you’re in the middle of it, it’s very difficult to see the bigger picture. But sometimes that’s why you need somebody like me or a podcast like this, or going to see a careers advisor to kind of give you that different perspective, and to say, actually it will work out.\n\nThis will be a blip in your career, and eventually you’ll find your way again.\n\nJulie Gould 24:38\n\nWhen it comes to an interview and people are like, ”Hey, you did this thing on your CV. That’s really weird. What was that about?”\n\nHow important is it that you come prepared enough to the interview to explain it and explain what you’ve learned and how you’ve done and why this is and can you tell me a little bit more about that?\n\nJulia Yates 24:54\n\nI think that’s such a good point, because employers do look at your CV, or they look at your kind of employer. With the history, and they do notice that you’ve had a few years out, or perhaps you did a slightly unexpected job that doesn’t really fit.\n\nOr perhaps you did a job and were only there for three months. And they wondered to themselves, ”I wonder what happened there.”\n\nAnd they might well ask, and even if they don’t ask, you might want to think about whether you volunteer the information, because they’re probably questioning it in their mind, even if they don’t feel they can ask explicitly.\n\nAnd I think, I think, employers are human.\n\nAnd almost every employer who will be interviewing you will have got something a little bit unexpected in their own employment history.\n\nSo it won’t be a great shock to them to hear that, you know, you took a job that didn’t work out.\n\nBut I think the key thing is just to talk to them about what you learned from it. Perhaps why you made the mistake, if it was a mistake on your part in the first instance, perhaps you didn’t research it enough, perhaps you weren’t very self-aware. Perhaps you were seduced by the massive paycheck that they were offering to you.\n\nAnd then talk about, yeah, I think owning it’s really important. So saying, you know, ”I did something wrong, here” is something that employers are quite open to, and I think that tends to go down a little bit better than saying, you know, ”They misled me, or they were wrong, or, you know, something external”.\n\nI think if you can own it yourself, that’s always impressive, and if you can explain what you did wrong and what you’ve learned from it, I think, I think any employer worth their salt would understand that, and it would make some sense to them.\n\nJulie Gould 26:29\n\nIn our sixth and final episode of this series on career planning, I’m sharing a conversation I had with Professor Dame Ottoline Leyser.\n\nWe spoke in December 2024 when she was still the CEO of UKRI, We talk about her career, her time at UKRI, and her strong beliefs on how academia needs to learn to diversify their career paths.\n\nBut before you go, here’s our sponsored slot from the International Science Council on career development for early and mid-career researchers in an ever-evolving scientific landscape.\n\nThanks for listening. I’m Julie Gould.\n\nIzzie Clarke: 27:18\n\nHello and welcome to this podcast presented in partnership with the International Science Council, with the support of the China Association for Science and Technology. I’m science journalist Izzie Clarke.\n\nThe future of science relies on the well-being of early- to mid-career researchers, that they feel supported in their workplace so that collaboratively their fields can continue to evolve. But with funding and publication demands, to name a few, how is that possible and what else is needed to mentally support researchers?\n\nTo help answer these all-important questions, I’m joined by Yensi Flores Bueso, co-chair of the Global Young Academy, and a Marie Curie Career Fellow at the Institute for Protein Design and the Cancer Research centre at University College Cork.\n\nYensi Flores Bueso: 28:10\n\nHi, Izzie.\n\nIzzie Clarke: 28:11\n\nAnd Lori Foster, the President of the International Association of Applied Psychology and Professor of Organizational Psychology at North Carolina State University.\n\nLori Foster: 28:21\n\nHi, Izzie. Great to be here.\n\nIzzie Clarke: 28:24\n\nWell, I think today’s conversation is an important one. We’re talking about mental health and well-being. So, let’s start with the question for both of you. Why do we need to rethink resilience in the research ecosystem, especially when it comes to early- and mid-career researchers?\n\nLori Foster: 28:39\n\nSure. I think we’re talking about how to prevent things like burnout, how to foster resilience and thriving. And I suppose I have two answers. So, one is it’s simply the humane thing to do. We have to take care of ourselves and we have to take care of each other. And then answer number two, if we need a business case, is it’s the right thing to do from the standpoint of the advancement of our sciences. If we are in an ecosystem and we are burning out some of our resources, then we are not going to be able to sustain growth and productivity in that ecosystem.\n\nYensi Flores Bueso: 29:13\n\nI agree with Lori. Science would benefit from scientific systems that can help encourage the different abilities and the different characteristics and the strengths that every researcher has. And being burnt out, or this hyper competition, I don’t think that it benefits some of the characteristics of certain researchers because, at the end of the day, science, it’s done by teams. You need this combination of different abilities and strengths to build a strong team in science.\n\nIzzie Clarke: 29:45\n\nLori, what would you say are some of the pressures that early- and mid-career researchers face?\n\nLori Foster: 29:52\n\nYeah, thanks Izzie. And I’m going to be really interested in Yensi’s perspective on this, as well, given that she is at an earlier career stage than I am. But it can be workload, particularly in the context of the other life pressures that may be going on. That could be anything from paying off student loans to raising a family, to building your social network with your friend groups and all of those things... maintaining your physical activity and exercise, getting enough sleep. So, all of those things can be factors, in addition to the climate or the culture of the work environment, right? And we’re going to see some variability there. But for many, early- and mid-career researchers, that’s a real factor that can be a barrier.\n\nIzzie Clarke: 30:39\n\nAnd Yensi, if you’re happy to talk about this, have you experienced any pressures to secure funding or publishing or anything like that that might have impacted your well-being in this stage of your career?\n\nYensi Flores Bueso: 30:51\n\nYeah, especially coming from the Global South, where there’s less resources available, you have to compete harder for getting the few opportunities that are there. People who have less opportunities are at disadvantage. Right now, the current systems, what they evaluate are opportunities rather than ability. So, this has definitely impacted my life.\n\nEven in the Global North, researchers live in certain precarity. The contracts are usually just temporary and the salaries are very low in early stages, and there’s a lot of insecurity of what is going to happen next.\n\nYou have to compete for the funding or the positions that will let you advance your career. Then you’re always being hyperproductive and that results in burnouts or, in my personal case, I can say that definitely it takes most of my time. It can affect your health, your sleep, for example, and if a woman, for example, has a family, it will be super difficult.\n\nIzzie Clarke: 31:59\n\nThat’s also a lot to take on in addition to academic work and research, which in itself is a tasking job on top of all of those other things to contend with. So, in those moments of stress, was there anything or anyone that helped you regain a sense of balance or peace during those more difficult times?\n\nYensi Flores Bueso: 32:22\n\nYes. Well, I would say one, mentors. I have been lucky to be supported by my mentors who, in between grants, for example, gave me a contract for a couple of months to help me not be without a job for two or three months, which is especially dangerous for me because my visa depends on my job.\n\nThen my peers, for example, I am lucky that I joined the Global Young Academy (GYA) because I can interact with different people from around the world and hear their perspectives, as well as they hear me. And another thing, I got involved in something called the Coalition for Advancing Research Assessments. These gave me a lot of hope and purpose. It aims to change the way that we evaluate researchers to kind of make space and room for all kind of contributions, not only publications.\n\nIzzie Clarke: 33:13\n\nAnd I guess that goes back to what you were saying earlier about having the diversity of different strengths and skills in your team, as well, and sharing that with your peers.\n\nSo, Lori, from a psychological science perspective, what are some of the common and potentially overlooked signs of burnout or mental strain in research environments?\n\nLori Foster: 33:33\n\nYeah, well, I really appreciated a lot of what Yensi was saying there about joining organizations, joining associations. Because, to your question, Izzie, I think one of those signs might be withdrawal. If you see somebody who’s beginning to isolate a little bit more, withdrawal, perfectionism, cynicism, emotional numbness, drops in curiosity, things like that could be symptomatic and problematic.\n\nAnd some of us are lucky enough to join a lab that is not only productive but supportive, and some of us aren’t. And so then what? What do you do when you’re not in an environment that feels psychologically safe or has a culture that’s productive and supportive, both?\n\nAnd what I found, especially looking back similar to what Yensi is saying is that joining organizations, associations, professional associations, did mean a world of good because it fulfilled both needs. It was a way to develop a network, contribute professionally and I was making friends and finding people with common interests. And I found that it also accommodates a variety of different career stages if you join the right organization or pick the right ones. So, I really want to emphasize that important point as well.\n\nIzzie Clarke: 34:49\n\nIf a listener sees that a colleague is struggling or they themselves actually feel like things are getting a bit much, what should they do?\n\nLori Foster: 34:58\n\nCertainly if somebody is at risk or harming themselves or others, it’s important to seek help immediately. If it is something other than that where you start to feel that cynicism creeping in, you start to feel that exhaustion, the lack of personal accomplishment like I don’t feel like I’m very good at my job, I don’t feel like I’m accomplishing anything worthwhile...\n\nIf you see those early signs of burnout creeping in, might be stepping in and one, just normalizing it when we’re talking about it with other people like, hey, it looks like you might be struggling? Do you want to talk a little bit about what might be going on? That level of social support for ourselves, building in some of the strategies that we’ve been discussing, can go a long way.\n\nYensi, I’m curious as to what you think from your personal experience.\n\nYensi Flores Bueso: 35:44\n\nYeah, peer support is always very important. As a member of the lab, simple things like, let’s go for a coffee and chat. Just to interact and just trying to distract from what it is because that person has been so hyperfocused on the work, it might just help the brain to kind of restart or something like that. I find also that for me, exercising and being in contact with nature has helped me a lot.\n\nLori Foster: 35:59\n\nYeah, the exercise, the nature, the sleep, the nutrition... we cannot overestimate how important those are. We know about the psychological benefits of gratitude, really taking a pause, taking a step back and saying, what am I grateful for? Who am I grateful for? And even journaling that, even if you never show it to anyone, we know that this can have positive impacts for ourselves, individually. And of course, if you share that, then it has positive impacts to the person that you’re grateful for.\n\nIzzie Clarke: 36:44\n\nYeah. With that in mind, what can research institutions do differently to support healthier and more sustainable career paths, especially for early- and mid-career researchers? Yensi, do you want to start on this?\n\nYensi Flores Bueso: 36:56\n\nYes. Well, I think that if institutions start recognizing that there is no one size fits all, it will be helpful towards careers that universities not only consider different evaluation for the positions, but also recognize that nowadays science is done by different profiles. There’s not one rigid path in academia. There’s other roles that can be incorporated.\n\nFor example, it’s becoming more important to have data managers, project managers and science communicators, or who integrates the research that is done by the university to policymakers. And all these roles are important and are very important for the scientific system. And they, right now, not always exist.\n\nIzzie Clarke: 37:43\n\nYeah. And Lori, what do you think about that?\n\nLori Foster: 37:46\n\nYeah, the first thing I would encourage institutions to do is to make sure that their reward structure is aligned with the long view. If organizations are hoping for long-term productivity, collaboration, innovation, creativity, then that’s what they need to reward. So many times, they’re rewarding competition, short-term wins, quick publications and as many as you can get.\n\nTwo, there’s something called the Job Demands–Resources model. And Yensi, you’ve had me thinking about it during this conversation today. So, we could think broadly about what are the demands of the roles and what are the resources? And those demands can be both demands with respect to acquiring grants, demands with respect to publications or even interpersonal demands that you’re having in your lab and your environment.\n\nAnd then what are the resources, you use that word Yensi earlier, to meet those demands? And those could be internal resources, they could be external resources, but really looking to make sure that our early- and mid-career researchers have the resources externally and internally that are needed to meet those demands.\n\nAnd then the third and final thing that I’ll say in answer to this one is maybe less at the institutional level and more at the level of the lab, is to create that psychologically safe environment. That’s the environment that Yensi was describing, where each team member can play to their strengths, where they’re not afraid of getting or punished for thinking outside of the box.\n\nIzzie Clarke: 39:13\n\nAnd so what advice would you both give to early- and mid-career researchers who are struggling, especially in perhaps competitive or underfunded research environments? Yensi, what do you think?\n\nYensi Flores Bueso: 39:28\n\nI would just say if they cannot find the support within their own lab or small circle, then to look a bit further to the university, and then if not the university, to other communities to get these support. There are more opportunities. The skills that we acquire in research are also very transferable.\n\nIzzie Clarke: 39:49\n\nAnd Lori?\n\nLori Foster: 39:51\n\nFor starters, I would say just know that you’re not alone. If you’re struggling, you are not alone. Many, if not all, people go through at different stages of their career. It’s not a weakness. And then I’ll also add two very practical things. One is focus on what’s within your control, your habits, your values, your boundaries. And then I would also say track small wins because, in this environment, it’s often the big grant that feels like the win or the publication, but it takes a long time. And so break that down, celebrate and track those small wins.\n\nIzzie Clarke: 40:26\n\nYeah, it’s simple but effective. Thank you both so much for joining me today. If you’re an early- or mid-career researcher and you want to be part of a community, then join the International Science Council forum for emerging scientists.\n\nVisit the website council.science/forum. I’m Izzie Clarke and next time we’ll be discussing the benefits of science evolving beyond academic laboratories and institutions. Until then.",
      "url": "https://www.nature.com/articles/d41586-025-02899-8",
      "source": "Nature",
      "published": "2025-10-10",
      "sentiment_score": 0.85,
      "reasoning": "The article highlights real-world challenges faced by early- and mid-career researchers globally, including political, financial, and personal setbacks, and presents inspiring stories of resilience, adaptation, and support systems that help scientists navigate and restart their careers. It emphasizes mental health, community support, and evolving career planning approaches, offering meaningful, broadly relevant insights that uplift and encourage researchers and the wider public interested in science careers.",
      "category": "Other",
      "personality_title": "Scientists share how to pause and restart careers amid challenges",
      "personality_presentation": "**Context**\nMany scientists face unexpected challenges like funding cuts, losing mentors, or political changes that can stop their career progress. Early- and mid-career researchers especially feel these impacts as they work to build their futures in science.\n\n**What happened**\nThe article shares personal stories from scientists around the world who faced career setbacks. Katja Loos moved universities when her supervisor passed away but kept going with support from others. Mariana Viglino in Argentina struggled as government funding for research disappeared, forcing her to focus on basic survival rather than growth. Tomasz Glowacki learned to make flexible career plans after projects he expected were canceled. Experts explain how mental health and support networks help researchers during tough times.\n\n**Impact**\nThese stories show that scientific careers are rarely smooth. Challenges like political shifts or personal losses can pause progress, but with support, adaptability, and mental health care, researchers can find ways to continue. The article highlights the importance of community, flexible planning, and understanding that sometimes basic needs must come first before bigger career goals.\n\n**What's next step**\nResearchers are encouraged to seek support from mentors, peers, and professional groups. Career plans should be flexible and open to change. Institutions can help by creating safe, supportive environments and recognizing diverse career paths. The International Science Council promotes these ideas to better support early- and mid-career scientists worldwide.\n\n**One-sentence takeaway**\nScientists worldwide show that with support and flexible planning, career pauses caused by unexpected challenges can be overcome to restart and grow.\n",
      "personality_title_fr": "Des scientifiques expliquent comment mettre leur carrière en pause puis la relancer face aux défis",
      "personality_presentation_fr": "**Contexte**\nBeaucoup de scientifiques rencontrent des obstacles inattendus comme des coupures de financement, la perte de mentors ou des changements politiques qui peuvent freiner leur carrière. Les chercheurs en début ou milieu de carrière ressentent particulièrement ces impacts alors qu’ils construisent leur avenir en science.\n\n**Ce qui s’est passé**\nL’article partage des témoignages personnels de scientifiques qui ont connu des revers professionnels. Katja Loos a changé d’université après la mort de son directeur de thèse, mais a poursuivi avec l’aide d’autres personnes. Mariana Viglino, en Argentine, a dû se concentrer sur la survie alors que les financements publics pour la recherche disparaissaient. Tomasz Glowacki a appris à faire des plans de carrière flexibles après l’annulation de projets. Des experts expliquent comment la santé mentale et le soutien sont essentiels dans ces moments difficiles.\n\n**Impact**\nCes histoires montrent que les carrières scientifiques ne sont jamais linéaires. Des défis comme des bouleversements politiques ou des pertes personnelles peuvent suspendre l’avancée, mais avec du soutien, de l’adaptabilité et une bonne santé mentale, les chercheurs peuvent continuer. L’article souligne l’importance de la communauté, d’une planification flexible et de comprendre que parfois, les besoins fondamentaux passent avant les grands objectifs professionnels.\n\n**Prochaines étapes**\nLes chercheurs sont encouragés à chercher du soutien auprès de mentors, collègues et groupes professionnels. Les plans de carrière doivent rester ouverts et adaptables. Les institutions peuvent aider en créant des environnements sûrs et en valorisant des parcours diversifiés. Le Conseil International de la Science promeut ces idées pour mieux accompagner les chercheurs en début et milieu de carrière dans le monde.\n\n**Résumé en une phrase**\nDes scientifiques du monde entier montrent qu’avec du soutien et une planification flexible, il est possible de surmonter les pauses de carrière causées par des défis inattendus pour repartir de l’avant.\n",
      "personality_title_es": "Científicos explican cómo pausar y reiniciar sus carreras frente a desafíos",
      "personality_presentation_es": "**Contexto**\nMuchos científicos enfrentan desafíos inesperados como recortes de fondos, pérdida de mentores o cambios políticos que pueden detener su progreso profesional. Los investigadores en etapas tempranas y medias de su carrera sienten especialmente estos impactos mientras construyen su futuro en la ciencia.\n\n**Qué pasó**\nEl artículo comparte historias personales de científicos que enfrentaron retrocesos en su carrera. Katja Loos cambió de universidad tras la muerte de su supervisor, pero continuó con apoyo de otros. Mariana Viglino en Argentina tuvo que enfocarse en la supervivencia debido a la desaparición de fondos públicos para investigación. Tomasz Glowacki aprendió a hacer planes de carrera flexibles después de que proyectos esperados fueran cancelados. Expertos explican cómo la salud mental y las redes de apoyo ayudan a los investigadores en tiempos difíciles.\n\n**Impacto**\nEstas historias muestran que las carreras científicas rara vez son lineales. Desafíos como cambios políticos o pérdidas personales pueden pausar el avance, pero con apoyo, adaptabilidad y cuidado de la salud mental, los investigadores pueden seguir adelante. El artículo destaca la importancia de la comunidad, la planificación flexible y entender que a veces las necesidades básicas deben atenderse antes que las metas profesionales mayores.\n\n**Próximos pasos**\nSe anima a los investigadores a buscar apoyo en mentores, colegas y grupos profesionales. Los planes de carrera deben ser flexibles y abiertos al cambio. Las instituciones pueden ayudar creando ambientes seguros y apoyando trayectorias diversas. El Consejo Internacional de la Ciencia promueve estas ideas para apoyar mejor a los científicos en etapas tempranas y medias de su carrera a nivel mundial.\n\n**Conclusión en una frase**\nLos científicos de todo el mundo demuestran que con apoyo y planificación flexible, se pueden superar las pausas en la carrera causadas por desafíos inesperados para reiniciar y crecer.\n",
      "image_url": "public/images/news_image_How-to-pause-and-restart-your-science-career.png",
      "image_prompt": "A detailed, warm-toned painting of a winding river flowing through varied landscapes symbolizing a scientist’s career journey: starting with a sturdy bridge representing mentorship and support, passing through a stormy section with broken lab equipment and scattered papers symbolizing unexpected setbacks, then opening into a calm, sunlit valley where diverse scientific tools and collaborative hands gently nurture young plants symbolizing resilience, adaptation, and renewed growth."
    },
    {
      "title": "Chovanec: Slovakia wants to be part of Team Europe and the EU Global Gateway strategy",
      "summary": "State Secretary of the Ministry of Foreign Affairs of the Slovak Republic, Rastislav Chovanec, described Slovakia's participation in this EU investment initiative at the Global Gateway forum in Brussels.",
      "content": "State Secretary of the Ministry of Foreign Affairs of the Slovak Republic, Rastislav Chovanec, described Slovakia’s participation in this EU investment initiative at the Global Gateway forum in Brussels.\n\nBrussels – Slovakia wants to be part of Team Europe and the EU’s Global Gateway investment strategy, as it opens the way for Slovak companies to third countries. On Thursday, after the conclusion of the two-day Global Gateway forum in Brussels, State Secretary of the Ministry of Foreign Affairs of the Slovak Republic Rastislav Chovanec stated this for TASR. The event was attended as a guest by the well-known Slovak scientist Pavol Čekan at the invitation of the President of the European Commission (EC) Ursula von der Leyen.\n\nTeam Europe, meaning the countries and institutions of the EU, has mobilized more than 306 billion euros over the past four years to support EU partnerships around the world. Rastislav Chovanec specified that this initiative has great potential for European, and thus Slovak companies to establish themselves in third countries, especially in less developed states that the initiative targets. He pointed out that Slovakia, as a smaller country, does not have dominant companies and has not yet had specific investments through Team Europe, but this is changing.\n\nSlovakia wants to use Global Gateway for investments in Ukraine, plans to invest in Kenya\n\n“Thanks to the Ukraine tool, the first 100 million euros were approved in Brussels in cooperation between the Eximbank and the Slovak Agency for International Development Cooperation. Through this initiative, we will address four energy projects in Ukraine,” he explained.\n\nHe believes that this will serve as a guide for how Slovak companies can get involved in the Global Gateway initiative. He added that preparations are underway to submit another project in Kenya worth tens of millions of euros, but it is still too early to specify the nature of this project. Slovakia can leverage its experience in Kenya, as this country has been a priority from the perspective of Slovak development diplomacy. “Also because we have good contacts with government representatives there, and because we have an embassy there, we managed to convince Kenyan partners to be interested in the Slovak project. Hopefully, it will be realized,” Chovanec said.\n\nHe claims that the advantage of EU development aid is that it allows companies to more easily access the markets of developing countries that lack sufficient funding. The EU, through export banks like Eximbank, finances various projects. The investing company is not afraid of losing deposits, as the EU guarantees it, while the recipient country is glad to realize an investment that has secured financial coverage.\n\nSlovakia wants to remain part of Team Europe; it is a way to access the markets of third countries. Chovanec welcomed that discussions are also underway about investment support of tens of millions of euros for smaller companies, which is good for Slovakia, which does not have many large companies capable of implementing projects abroad worth hundreds of millions of euros. “We will ask the European Commission to support projects in the units and tens of millions of euros, which would allow us to establish ourselves in these countries,” Chovanec said.\n\nProposal of the Slovak Republic for the EU to support clinical studies as strategic projects in healthcare\n\nThe head of the EC Ursula von der Leyen invited ten CEOs from EU countries, including the head of MultiplexDX, Slovak scientist Pavol Čekan, to the Global Gateway 2025 forum. He announced on Thursday via social media that he proposed the EU support clinical studies as strategic projects, where European pharmaceutical and diagnostic companies, hospitals, regulatory authorities, doctors, and scientists would come together.\n\n“This way, we can bring innovative medical technologies and medicines to where it is most difficult and save lives,” stated Pavol Čekan. (October 9)",
      "url": "https://europeannewsroom.com/chovanec-slovakia-wants-to-be-part-of-team-europe-and-the-eu-global-gateway-strategy/",
      "source": "European Newsroom",
      "published": "2025-10-09",
      "sentiment_score": 0.8,
      "reasoning": "The article describes Slovakia's active participation in the EU's Global Gateway investment initiative, which aims to support development projects in less developed countries like Ukraine and Kenya. This represents a meaningful international cooperation effort with potential broad economic and developmental benefits. Additionally, the proposal to support clinical studies as strategic projects could improve healthcare innovation access. The story has clear substance, positive real-world impact, and significance beyond a niche audience.",
      "category": "Other",
      "personality_title": "Slovakia joins EU’s Global Gateway to boost investments abroad",
      "personality_presentation": "**Context** – The European Union launched the Global Gateway initiative to help European countries invest in projects in less developed countries. This program aims to improve development through partnerships and financial support.\n\n**What happened** – Slovakia announced its plan to join the Global Gateway strategy as part of Team Europe. Rastislav Chovanec, State Secretary of Slovakia’s Ministry of Foreign Affairs, spoke about this at a forum in Brussels. Slovakia has started investing 100 million euros in energy projects in Ukraine and is preparing to invest tens of millions more in Kenya. Slovak scientist Pavol Čekan also proposed EU support for clinical studies to improve healthcare innovation.\n\n**Impact** – This participation allows Slovak companies, even though they are smaller, to enter new markets in developing countries with financial backing from the EU. The investments in Ukraine and Kenya could help build better infrastructure and energy systems. Supporting clinical studies could bring new medicines and medical technologies to places that need them most.\n\n**What’s next step** – Slovakia will continue developing projects under Global Gateway and request EU support for smaller-scale investments, helping Slovak businesses grow internationally. The proposal to back clinical studies might lead to new EU healthcare programs involving scientists and companies.\n\n**One-sentence takeaway** – Slovakia is actively joining the EU’s Global Gateway to invest in developing countries and promote healthcare innovation with EU support.",
      "personality_title_fr": "La Slovaquie rejoint Global Gateway de l’UE pour renforcer ses investissements à l’étranger",
      "personality_presentation_fr": "**Contexte** – L’Union européenne a lancé l’initiative Global Gateway pour aider les pays européens à investir dans des projets dans les pays moins développés. Ce programme vise à améliorer le développement grâce à des partenariats et un soutien financier.\n\n**Ce qui s’est passé** – La Slovaquie a annoncé son intention de rejoindre la stratégie Global Gateway en tant que membre de l’Équipe Europe. Rastislav Chovanec, secrétaire d’État au ministère des Affaires étrangères slovaque, en a parlé lors d’un forum à Bruxelles. La Slovaquie a commencé à investir 100 millions d’euros dans des projets énergétiques en Ukraine et prépare d’autres investissements de plusieurs dizaines de millions au Kenya. Le scientifique slovaque Pavol Čekan a aussi proposé un soutien de l’UE pour les études cliniques afin de favoriser l’innovation en santé.\n\n**Impact** – Cette participation permet aux entreprises slovaques, même de taille plus modeste, d’accéder à de nouveaux marchés dans les pays en développement avec le soutien financier de l’UE. Les investissements en Ukraine et au Kenya pourraient aider à construire de meilleures infrastructures et systèmes énergétiques. Le soutien aux études cliniques pourrait apporter de nouveaux médicaments et technologies médicales là où ils sont le plus nécessaires.\n\n**Prochaine étape** – La Slovaquie continuera à développer des projets dans le cadre de Global Gateway et demandera un soutien de l’UE pour des investissements à plus petite échelle, aidant ainsi les entreprises slovaques à se développer à l’international. La proposition de soutenir les études cliniques pourrait mener à de nouveaux programmes de santé européens impliquant scientifiques et entreprises.\n\n**Résumé en une phrase** – La Slovaquie s’engage activement dans Global Gateway de l’UE pour investir dans les pays en développement et promouvoir l’innovation en santé avec le soutien de l’UE.",
      "personality_title_es": "Eslovaquia se une a Global Gateway de la UE para impulsar inversiones en el extranjero",
      "personality_presentation_es": "**Contexto** – La Unión Europea lanzó la iniciativa Global Gateway para ayudar a los países europeos a invertir en proyectos en países menos desarrollados. Este programa busca mejorar el desarrollo a través de asociaciones y apoyo financiero.\n\n**Qué pasó** – Eslovaquia anunció su plan para unirse a la estrategia Global Gateway como parte del Equipo Europa. Rastislav Chovanec, Secretario de Estado del Ministerio de Asuntos Exteriores de Eslovaquia, habló sobre esto en un foro en Bruselas. Eslovaquia ha comenzado a invertir 100 millones de euros en proyectos energéticos en Ucrania y está preparando inversiones de decenas de millones más en Kenia. El científico eslovaco Pavol Čekan también propuso el apoyo de la UE a estudios clínicos para mejorar la innovación en salud.\n\n**Impacto** – Esta participación permite que las empresas eslovacas, aunque más pequeñas, accedan a nuevos mercados en países en desarrollo con el respaldo financiero de la UE. Las inversiones en Ucrania y Kenia podrían ayudar a construir mejores infraestructuras y sistemas energéticos. El apoyo a estudios clínicos podría traer nuevos medicamentos y tecnologías médicas a los lugares que más los necesitan.\n\n**Próximo paso** – Eslovaquia continuará desarrollando proyectos bajo Global Gateway y solicitará apoyo de la UE para inversiones a menor escala, ayudando a que las empresas eslovacas crezcan internacionalmente. La propuesta para respaldar estudios clínicos podría llevar a nuevos programas de salud de la UE que involucren a científicos y empresas.\n\n**Resumen en una frase** – Eslovaquia se une activamente a Global Gateway de la UE para invertir en países en desarrollo y fomentar la innovación en salud con apoyo europeo.",
      "image_url": "public/images/news_image_Chovanec-Slovakia-wants-to-be-part-of-Team-Europe-.png",
      "image_prompt": "A detailed painting of interconnected bridges made of glowing puzzle pieces spanning between stylized maps of Slovakia, Ukraine, and Kenya under a soft, warm light, with abstract silhouettes of gears and handshake-shaped clouds symbolizing collaboration and investment, all rendered in natural, muted earth tones."
    },
    {
      "title": "Angolan PR highlights the potential of the Lobito Corridor",
      "summary": "In her meeting with the Angolan leader, Ursula von der Leyen emphasized that the railway project of the Lobito Corridor is \"one of the most ambitious\" of the Global Gateway and \"a pathway to growth and employment.\"",
      "content": "BRUSSELS – The President of Angola, João Lourenço, highlighted today, at the second Global Gateway Forum in Brussels, that the Lobito Corridor has “development potential” in Southern Africa.\n\nReferring in his speech at the second edition of the Global Gateway Forum to the “great project of the Lobito Corridor,” João Lourenço emphasized “the economic and social development potential it can generate not only in Angola but also in the Southern Africa region.”\n\nThe strategic logistical and economic project connects the port of Lobito, in the Atlantic Ocean, to the mining regions of southern Democratic Republic of Congo and Zambia, through the Benguela Railway line (Angola).\n\nThe Lobito Corridor, the Angolan head of state considered, has “a fundamental geopolitical and economic importance, as it is a logistical platform that will shorten international maritime routes, promote international trade and commercial exchanges between Asia, Africa, Europe, and America, as well as boost intra-African trade, strengthen the African Continental Free Trade Area, and make a significant contribution to integrating Africa into global value chains.”\n\nLourenço met at the forum with the President of the European Commission, Ursula von der Leyen, who announced on social media that the project is “one of the most ambitious” of the Global Gateway and “a pathway to growth and jobs.”\n\nVon der Leyen also expressed “pride in being a partner of Angola on this journey” and mentioned that the strategy will be discussed at the upcoming summit between the European Union (EU) and the African Union, scheduled for November 24 and 25 in Luanda.\n\nThe EU-AU Summit is scheduled for November 24-25, 2025, in Luanda, Angola.\n\nThe second edition of the Global Gateway Forum, taking place today and on Friday, brings together high-level representatives from governments, financial institutions, the private sector, and civil society to explore innovative strategies to increase investments.\n\nIn addition to the Angolan President, the Prime Minister of Cape Verde, José Ulisses Correia e Silva, is also participating in the event.\n\nBuilding on the 2023 meeting that highlighted the European Union’s external investment initiatives, this year’s event will focus on advancing global connectivity in the face of geopolitical and geoeconomic challenges. (10/09/2025)",
      "url": "https://europeannewsroom.com/angolan-pr-highlights-the-potential-of-the-lobito-corridor-2/",
      "source": "European Newsroom",
      "published": "2025-10-09",
      "sentiment_score": 0.8,
      "reasoning": "The article reports on the Lobito Corridor railway project, a major infrastructure initiative with broad economic and social development potential for Angola and the Southern Africa region. It highlights the project's role in boosting international and intra-African trade, strengthening economic integration, and creating growth and employment opportunities. The involvement of the EU and African Union underscores its significance and scope. The article provides sufficient context about the project's impact and geopolitical importance, making it an inspiring story of regional development and cooperation.",
      "category": "Other",
      "personality_title": "Angola’s Lobito Corridor railway seen as key to Southern Africa’s growth",
      "personality_presentation": "**Context** – Angola is developing the Lobito Corridor, a railway that links the Atlantic port of Lobito to mining areas in neighboring countries. This project aims to improve trade and transport across Southern Africa.\n\n**What happened** – At the Global Gateway Forum in Brussels on October 9, 2025, Angola’s President João Lourenço spoke about the Lobito Corridor’s potential. He highlighted its economic and social benefits for Angola and the wider region. European Commission President Ursula von der Leyen called the project “one of the most ambitious” under the Global Gateway initiative and said it will create jobs and growth. They also announced plans to discuss the project at the EU-African Union summit in Luanda later in November.\n\n**Impact** – The Lobito Corridor will shorten shipping routes, boost trade between Africa, Europe, Asia, and the Americas, and increase trade within Africa itself. It supports the African Continental Free Trade Area by connecting key markets and resources. This railway could help Southern Africa become more connected to global economies and improve the lives of many people by creating new jobs.\n\n**What’s next step** – Leaders from the EU and African Union will meet in Luanda on November 24-25, 2025, to discuss the Lobito Corridor and other projects. This meeting will help secure more support and funding to move the railway forward.\n\n**One-sentence takeaway** – Angola’s Lobito Corridor railway project is set to strengthen Southern Africa’s economy by improving trade routes and creating new job opportunities.",
      "personality_title_fr": "Le corridor de Lobito en Angola, clé de la croissance en Afrique australe",
      "personality_presentation_fr": "**Contexte** – L’Angola développe le corridor de Lobito, une ligne de chemin de fer reliant le port atlantique de Lobito aux zones minières des pays voisins. Ce projet vise à améliorer le commerce et le transport en Afrique australe.\n\n**Ce qui s’est passé** – Lors du Forum Global Gateway à Bruxelles le 9 octobre 2025, le président angolais João Lourenço a souligné le potentiel du corridor de Lobito. Il a mis en avant ses bénéfices économiques et sociaux pour l’Angola et la région. Ursula von der Leyen, présidente de la Commission européenne, a qualifié le projet d’« un des plus ambitieux » de l’initiative Global Gateway et a annoncé qu’il créerait des emplois et de la croissance. Ils ont également prévu d’en discuter lors du sommet Union européenne-Union africaine à Luanda en novembre.\n\n**Impact** – Le corridor de Lobito raccourcira les routes maritimes, stimulera le commerce entre l’Afrique, l’Europe, l’Asie et les Amériques, et renforcera les échanges à l’intérieur de l’Afrique. Il soutient la Zone de libre-échange continentale africaine en connectant des marchés et ressources clés. Cette ligne de chemin de fer pourrait mieux intégrer l’Afrique australe à l’économie mondiale et améliorer la vie de nombreuses personnes grâce à la création d’emplois.\n\n**Prochaine étape** – Les dirigeants de l’UE et de l’Union africaine se réuniront à Luanda les 24 et 25 novembre 2025 pour discuter du corridor de Lobito et d’autres projets. Cette rencontre aidera à obtenir plus de soutien et de financement pour avancer dans le projet.\n\n**Résumé en une phrase** – Le corridor de Lobito en Angola va renforcer l’économie de l’Afrique australe en améliorant les routes commerciales et en créant de nouvelles opportunités d’emploi.",
      "personality_title_es": "El corredor de Lobito en Angola, clave para el crecimiento de África Austral",
      "personality_presentation_es": "**Contexto** – Angola está desarrollando el corredor de Lobito, un ferrocarril que conecta el puerto atlántico de Lobito con las zonas mineras de países vecinos. Este proyecto busca mejorar el comercio y el transporte en África Austral.\n\n**Qué pasó** – En el Foro Global Gateway en Bruselas, el 9 de octubre de 2025, el presidente angoleño João Lourenço habló sobre el potencial del corredor de Lobito. Destacó sus beneficios económicos y sociales para Angola y la región. Ursula von der Leyen, presidenta de la Comisión Europea, calificó el proyecto como “uno de los más ambiciosos” de la iniciativa Global Gateway y dijo que generará empleo y crecimiento. También anunciaron que discutirán el proyecto en la cumbre Unión Europea-Unión Africana en Luanda en noviembre.\n\n**Impacto** – El corredor de Lobito acortará las rutas marítimas, aumentará el comercio entre África, Europa, Asia y América, y fortalecerá el comercio dentro de África. Apoya el Área de Libre Comercio Continental Africana al conectar mercados y recursos clave. Este ferrocarril puede ayudar a integrar mejor África Austral en la economía mundial y mejorar la vida de muchas personas creando nuevos empleos.\n\n**Próximo paso** – Los líderes de la UE y la Unión Africana se reunirán en Luanda los días 24 y 25 de noviembre de 2025 para hablar del corredor de Lobito y otros proyectos. Esta reunión ayudará a conseguir más apoyo y financiación para avanzar en el proyecto.\n\n**Frase clave** – El proyecto ferroviario del corredor de Lobito en Angola fortalecerá la economía de África Austral al mejorar las rutas comerciales y crear nuevas oportunidades de empleo.",
      "image_url": "public/images/news_image_Angolan-PR-highlights-the-potential-of-the-Lobito-.png",
      "image_prompt": "A detailed, warm painting of a vibrant railway stretching from a bustling Atlantic port with ships to rich, glowing mining landscapes inland, connected by a golden track winding through southern Africa, symbolizing economic growth and international trade, with abstract silhouettes of continents—Africa, Europe, Asia, and the Americas—interlinked by flowing lines representing global connectivity and partnership."
    }
  ]
}