{
  "personality": null,
  "timestamp": "2025-09-12T04:39:14.090875",
  "category": "Other",
  "news_summary": "Today's news highlights advancements in scientific career planning, new insights into early Neanderthal hunting behaviors, and historical evidence of Britain's economic resilience post-Roman Empire.",
  "news_summary_fr": "L'actualité d'aujourd'hui met en lumière les avancées en matière de planification de carrière scientifique, de nouvelles connaissances sur les comportements de chasse des premiers Néandertaliens et des preuves historiques de la résilience économique de la Grande-Bretagne après l'Empire romain.",
  "news_summary_es": "Las noticias de hoy destacan los avances en la planificación de carreras científicas, nuevos conocimientos sobre los comportamientos de caza de los primeros Neandertales y pruebas históricas de la resistencia económica de Gran Bretaña tras el Imperio Romano.",
  "articles": [
    {
      "title": "Tips and tricks to plan your career in science",
      "summary": "Nature, Published online: 11 September 2025; doi:10.1038/d41586-025-02889-wJulie Gould explores some of the theories and frameworks to help identify future work goals and achieve them.",
      "content": "Julie Gould 00:02\n\nHello and welcome to Working scientist, a Nature Careers podcast. I’m Julie Gould.\n\nThis is the first episode of our career planning series. Each episode concludes with a sponsored slot from the International Science Council, with support of the China Association for Science and Technology.\n\nThe ISC is exploring how early and mid-career researchers can navigate their careers in a constantly evolving scientific landscape through conversations with emerging and established scientists.\n\nJulie Gould 00:31\n\nDo you ever feel lost? I don’t mean in the literal sense, but in a way that you’re not quite sure what you’re doing with your career, and you don’t know what to do next, or how to move on to the next bit.\n\nTrust me, if this is the case, you’re not the only one.\n\nMany, many people today feel a bit like that.\n\nThey’re often focused on the project that’s right in front of them at the time, and then they worry about the next step when that’s finished.\n\nAnd this is the advice that a lot of young researchers get too, as I discovered when I spoke to a group of early career researchers at the Humboldt Meets Leibniz conference in Hanover in Germany in September 2024.\n\nFrancesca Tivano 01:09\n\nI’m Francesca Tivano from Italy. And I’m ending my PhD, actually. So at the beginning, it was like\n\nI had my plans for my career in academia and so on.\n\nBut actually you realize during the years that it’s a difficult path. So you see all the difficulties of instability in your life.\n\nJulie Gould 01:31\n\nDo you get advice from your supervisors about career planning? Do they talk to you about it?\n\nFrancesca Tivano 01:46\n\nMaybe at the end of your PhD, your supervisor starts wondering what you want to do next, but it’s like small time plans.\n\nJulie Gould 01:46\n\nThe question is: why are people getting lost in their careers?\n\nFatimah Williams 01:49\n\nPeople get lost because we’re not trained on either how to design a career or how to, in some ways, keep up with moving our career forward in a way that we want.\n\nJulie Gould 01:59\n\nThis is Fatimah Williams, an executive careers coach at Professional Pathways and an author based in the US.\n\nFatimah Williams 02:05\n\nSo even if that doesn’t mean advancement, as in promotion. But really like being an agent and how you want to move your life. Where do you want your skills to be utilized?\n\nJulie Gould 02:15\n\nFor young researchers in particular, it’s very easy to fall into the academic career path without thinking too much, because it’s so prescribed and obviously laid out.\n\nBut even though this seems easy, it’s also where the getting lost happens most frequently.\n\nFatimah Williams 02:30\n\nSo people get lost because they’re either just kind of getting head down, getting the work done, and they’re not popping up every so often to say: “Am I where I want to be? Do I have the skills to get where I want to go? Do I have the relationships to get where I want to go next?”\n\nReally being intentional about: “What do I want to do? How do I want to use my skills? Where do I want to apply these skills?”\n\nJulie Gould: 02:52\n\nNow, what Fatimah is not saying is that working in academia is a bad idea or an easy option. It definitely isn’t either of those.\n\nBut what she is suggesting is people need to be intentional about their careers. And that is exactly what we hope you’ll be able to do after you’ve heard this series about career planning from the Working Scientist podcast, supported by the International Science Council.\n\nAnd I think the first part of this is to understand what career planning really is.\n\nBecause what it isn’t is you just saying “I want to be a professor of x at university y in 10 years time.” And then hoping for the best, as Fatimah said, you need to be intentional.\n\nSo what is career planning? Well, career planning has a lot of theories and definitions underpinning it, says Holly Prescott, a career guidance practitioner and the careers advisor for postgraduate researchers at the University of Birmingham in the UK.\n\nShe describes career planning as…\n\nHolly Prescott 03:51\n\n…having some kind of systematic way to have experiences, understand what those experiences are telling you, evaluate that information, and then take actions accordingly.\n\nSome kind of form of experiential learning, really.\n\nJulie Gould 04:11\n\nWhen Holly works with clients, she makes sure that she understands what experiences they’ve had and what cultures they’ve come from, as she thinks that this might have an influence on how they make their career choices.\n\nHolly Prescott 04:23\n\nAs a careers advisor, I need to acknowledge that I’m trained in a model that is very western-centric and is quite individualist.\n\nWhere we think of person-centred career guidance, for example, putting the person at the centre, understanding their interests, what they enjoy, and then kind of supporting career decision-making in line with that.\n\nHowever, it really depends on your cultural background, what things might be a priority for you in career decision-making.\n\nSo I always go back to an example when I was training, where I had an international student come to me.\n\nAnd when I asked her why she was interested in the company she was interested in, she said, “because my friends like them,” which was a really important learning experience for me, because for her, for the culture that she came from, moving into a career that was well respected by others, well respected by her community, was of paramount importance.\n\nJulie Gould 05:22\n\nSo once you’re ready to do some career planning and ready to learn from your own experiences in the most efficient way possible, many career coaches advise that you apply a strategy to your learning.\n\nSarah Blackford, an academic careers coach, says that when she works with scientists on their career planning, she often finds that they’re engrossed in their current project, whether it’s finishing an experiment, writing a paper, publishing results.\n\nAnd so the strategy Sarah uses with her young researchers is one that they are already familiar with.\n\nShe likens career planning to planning experiments.\n\nSarah Blackford 06:05\n\nYou know, you’re trying to achieve something, and it involves different elements, different smaller processes that may all be going on at the same time.\n\nAnd as much as you can plan experiments and think about, you know, and reflect on what’s already been done, and refer to other people’s work, and you have to make decisions, you have to draw upon information, and then you do your work, and at the end of it, you hope to achieve your aims.\n\nAnd in the same way, it’s important to reflect on you, and where you are now, and to use resources and information in order to achieve your aims as well. So that you know at the end of your contract or when your PhD finishes, you can then move on to the next experiment, which will be the transition into your next role.\n\nJulie Gould 06:53\n\nSarah’s work with young researchers is based on many different theories of career planning, some with a psychological perspective, some with a social perspective, and others with an organizational perspective.\n\nSarah Blackford 07:05\n\nIt’s about how your social background and your environment, and even, you know, your family and your genetics, and how, you know, these things might have influenced you in the past.\n\nJulie Gould 07:16\n\nAnd one model that Sarah and a lot of other career coaches use to guide their clients was first proposed in 1977 by Law and Watts. And is called the DOTS model.\n\nSarah Blackford 07:27\n\n…which stands for decisions, opportunities, transition and self.\n\nAnd those are those kind of elements that I think if you’re trying to plan your career, they’re the four elements you should really be focusing on. But in that we overlay planned happenstance. So that’s Mitchell and Krumboltz, and that came back 20 years later.\n\nAnd that is where you harness behaviours such as being proactive, being positive, being flexible, taking a bit of a risk, coming out of your comfort zone, and, you know, networking and engaging with people. So, you know, that is where you make your own luck. Luck just doesn’t happen out of the blue.\n\nJulie Gould 08:11\n\nWe’ll actually have a whole episode in the series about planned happenstance career stories in a couple of weeks.\n\nSarah Blackford 08:16\n\nAnd then Holland’s theory of vocational personalities, which is the RIASEC model.\n\nJulie Gould 08:23\n\nHolland’s RIASEC model, first formally developed in the late 1950s, is one of the most influential frameworks in career theory.\n\nIt classifies both people and their working environments into six personality types, and the idea is that the people are more satisfied and successful when they work in the environments that match their personality type.\n\nSarah Blackford 08:44\n\nI have just transformed it a little bit. I’ve adapted it, and I’ve turned it into my PhD Career Choice Indicator.\n\nAnd you have six categories of functional, investigative, artistic, social, management and enterprise. And what you do is you use it as a tool to enable people, especially researchers, and I use it a lot with researchers, to reflect on the work they do, and then to try to figure out what they enjoy doing most. Because it’s the enjoyment that you want to take forward. And then, you know, maybe improve on things. Look at it for personal development. Look at it for career choice or jobseeking.\n\nAnd you know, there’s various ways you can use that.\n\nAnd then finally, one that I do refer to is Patton and McMahon, and theirs is all about, you know, all the different influences, communities influencing you, you influencing, things beyond your control as well.\n\nSo to sort of put that in the mix, because I think there’s a danger sometimes that people focus in on just skills or just interests, or just their subject knowledge, and you need to really take it as a whole as much as you can without overwhelming yourself.\n\nJulie Gould 09:59\n\nSo when it comes to putting these theories into practice and actually sitting down to do some career planning, the literature suggests that you do things in a certain order.\n\nCynthia Fuhrmann, an associate professor at the University of Massachusetts Chan Medical School, and leader and director of the Professional Development Hub, an initiative in the USA to help early career scientists, puts career planning into three phases, where phase one is the assessment phase.\n\nAnd here you ask yourself the hard questions like…\n\nCynthia Fuhrmann. 10:28\n\n…what are my own personal you know, strongest skills and strengths? What do I most enjoy doing? What are the values that are especially important to me? What are the needs or preferences that I have, you know, in my, certain things in my life that I that I need to address in my next career, maybe a certain geographic location, or a certain salary, or whatever it is for me to be successful.\n\nAnd so the assessment phase is what the literature calls that phase, which is really building awareness of yourself and considering what’s most important to you.\n\nJulie Gould 11:01\n\nWhen you’ve worked that out, you can move on to phase two, the investigation phase.\n\nCynthia Fuhrmann 11:05\n\nYou might be doing things like setting up conversations with people to learn about their different role and how they made their own career decisions.\n\nAnd we call those informational interviews, of course, right?\n\nOr you might be setting other goals and taking actions towards reading about careers, or attending career panel events.\n\nJulie Gould 11:23\n\nFinally, you can start phase three, the preparation phase.\n\nCynthia Fuhrmann 11:27\n\nPrepare or take steps, like to develop the skills or get the extra experience you might need for the types of roles you’re interested in.\n\nSo when I think about career planning, I think of especially those three phases, building awareness of yourself, investigating different types of career paths, and then taking steps to actually prepare for the types of roles you’re realizing you might be interested in.\n\nJulie Gould 11:49\n\nHere’s the thing, though, when I look back at my career, this is definitely not how I did it.\n\nAnd this is what organizational psychology professor Julia Yates from the City St George’s University in London in the UK, found too.\n\nShe was trying to find the theory that summed up how young people actually made their career choices in the real world.\n\nJulia Yates: 12:09\n\nAnd I kept reading and reading and reading, and I just couldn’t find anything out there. And there’s quite a lot of prescriptive career theory, so a lot of career support, which is kind of saying “this is how you ought to make a career decision.”\n\nBut actually, when I talked to, when I thought about my own career choices, when I thought about all the career choices of everybody I’ve ever met, people don’t conform to that.\n\nSo I was looking in the literature to find out, well, what do people actually do, because I thought that’s where you need to start. You need to start with what people actually do, and then support them to do what they’re doing, but a bit better.\n\nAnd it turned out there was nothing in the literature about that.\n\nSo I did a research project. I looked at, I got hold of about 30 recent graduates. These were all graduates who are currently working. And I asked them to talk me through the stages of career decision-making.\n\nSo I asked them to think back to a time in their lives when they didn’t know what they wanted to do, and talk me through the steps that they took in order to be here where they are today, working in a job..\n\nJulie Gould 13:12\n\nThe graduates Julia spoke to in her research were in all sorts of different fields, scientists, psychologists, musicians, teachers. All sorts of people from all different backgrounds, and broadly speaking, they all took the same steps.\n\nJulia Yates 13:25\n\nSo they didn’t start with the self-awareness bit, because I think that’s just too hard. It’s just too difficult to do that in the abstract.\n\nWhere they started was by just picking a job, and it would be any job, it would be a job that sounded vaguely okay.\n\nMaybe it was their work experience. Maybe it was something their dad suggested. Maybe they were at a party and somebody said, “Why don’t you do this?”\n\nAnd the next thing they did is they explored it some more, so they found out a bit about what was the job like, maybe they did a bit of, you know, research on the internet. Maybe they found a couple of people to speak to,\n\nAnd then, if it still sounded okay, that was the point where they started doing a bit of self-awareness.\n\nSo they were doing the self-awareness in the context of a particular idea, so not a blank sheet of paper.\n\nJulie Gould 14:13\n\nFor example, they might have picked the position of a research scientist, maybe an optics-lab based physics one, and had spent some time reading about what it’s really like to work at an optics bench, to work in a dark room where the smallest movements could interfere with the experiments.\n\nThey might have taken some time to speak to the people who do this already and found out how much time they spend in the lab compared to at a computer, doing data analysis and writing papers.\n\nAnd maybe after doing some of this due diligence, they might have decided that this wasn’t quite for them,\n\nJulia Yates 14:46\n\nOr they might think it’s okay, and so they do a little bit more research, maybe a bit a work experience at that point, they’d go through that sort of iterative process, sometimes thinking about a few different jobs, and then they’d get to the point where they’d think, “Okay. this feels alright. I think I’m going to give it a go.”\n\nNow, can I just add two other things to that? And one of them is that an awful lot of the graduates I spoke to did not feel that they had made a career choice. They were just doing something that sounded okay.\n\nThey weren’t at all sure they were going to stick with this forever. And I thought that was great. You know, I think maybe when you’re in your mid 20s, making a decision that you plan to stick with for the next 30 years is probably a bit ambitious.\n\nSo I really wholeheartedly respected the idea that they were kind of trying something. It seemed okay. They’d learn a lot, and maybe a few years down the line, they’d rethink.\n\nThe second thing that I thought was really interesting in what they talked about is that they use the application process as part of the exploration.\n\nSo traditionally, you would always have thought that people would make a career choice and then apply for a job.\n\nBut that’s not what these graduates did. These graduates use the application process as a way to find out more. So they applied, and then they made a choice.\n\nWhich is kind of putting that bit, a little bit the other way around from the way you’d normally think about it.\n\nJulie Gould: 16:09\n\nReally, this real-life model uses exactly the same phases as the ones Cynthia described earlier, but they’re in a different order, and they’re used in an iterative way. And as a result, this process does two things.\n\nOne, it helps give people a context within which to do the hard self-reflection stuff. And two, it actually helps people not get lost or stuck in the career decision-making process.\n\nAnd actually, there is a theory called Career Inaction Theory, which is a relatively new framework that focuses on why people do not take career-related actions, even when they’re unhappy or uncertain about the path that they’re on.\n\nAnd instead of assuming that people are always actively planning or progressing, the theory asks the question: why do people freeze or delay or avoid or stay still when making career decisions?\n\nJulia Yates 17:01\n\nSo one of the main things that people get stuck around is cognitive overload. So, you know, there are just too many jobs out there to think about, and people get overwhelmed, and then they just can’t bear it anymore, so they stop thinking about it.\n\nAnd actually, that makes perfect sense. If you think about all the numbers of jobs there are out there trying to narrow that down to one. I mean, no wonder people get overwhelmed.\n\nBut this process, the ones that the graduates told me about, they’re just sticking with one at a time. So actually, that’s much more, it’s much more possible to really think something through if you’re just thinking about it one at a time.\n\nJulie Gould 17:38\n\nAt the end of our conversation, Julia told me that she hopes that young people can understand from this that sometimes jobs don’t work out, but that this is okay.\n\nJulia Yates 17:47\n\nI think it can feel so utterly overwhelming and daunting that actually things work out. And even if a job doesn’t work out, it’s still incredibly useful as a process.\n\nMy first job, when I left university, was a complete disaster. I was so ill-suited, I was so unhappy, and I was so incompetent. And actually that was just awful, you know, I was deeply unhappy.\n\nBut then I left, and with retrospect, it was such a useful process to have been through.\n\nSo I suppose the message is: even career disasters are not disastrous. Unpleasant at the time, but you learn from them, and that means the next time around, you do it better.\n\nSo I would say you’re in your working life for a long time, and it’s really lovely to be able to reinvent yourself as you go through.\n\nSo when you’re starting out, don’t think this is the job I’m going to have to do for the next 40 years. It’s not your last step you’re thinking about. It’s your first step.\n\nJulie Gould 18:44\n\nSo to help you with your first step, or seventh or umpteenth career step, in the next episode of this series, we’ll be sharing some practical tips on how to get started with your career planning.\n\nBut before you go, here’s our sponsored slot from the International Science Council on career development for early and mid-career researchers in an ever-evolving scientific landscape.\n\nThanks for listening. I’m Julie Gould.\n\nIzzie Clarke: 19:14\n\nHello and welcome. I’m science journalist Izzie Clarke and in this podcast series, presented in partnership with the International Science Council, with the support of the China Association for Science and Technology, we’ll be exploring the changing scientific landscape for early- and mid-career researchers – and how best to navigate it.\n\nToday, I’m joined by Professor Robbert Dijkgraaf, a theoretical physicist and the President-elect of the International Science Council.\n\nRobbert Dijkgraaf: 19:45\n\nHello.\n\nIzzie Clarke: 19:46\n\nAnd Baojing Gu from Zhejiang University, Professor of Environmental and Resource Management.\n\nBaojing Gu: 19:51\n\nHello everyone.\n\nIzzie Clarke: 19:52\n\nThank you both so much for joining me. Robbert, let’s start with you. You’ve spoken about how the scientific landscape is undergoing major change – that’s what this episode is about. So, from your perspective, what are the biggest shifts in scientific careers today, particularly for early- and mid-career researchers?\n\nRobbert Dijkgraaf: 20:12\n\nWe are in a dramatic change in the whole academic enterprise. We see this acceleration of new technologies, of the larger community growing. But also the demands on the research community becomes much more intense. We want researchers not just to be excellent in doing research. We want them to work in interdisciplinary teams, we want them to connect to society, we want them to have policy advice. So, if you’re an early-career researcher, you might feel overwhelmed about how are you going to navigate indeed that landscape if it’s changing so rapidly.\n\nBaojing Gu: 20:57\n\nNowadays, we have fast transformation for the new technology, such as AI and big data. We need it to use in multiple languages from different research areas, and I think that’s the big challenge for the younger generations trying to understand the new global world and using more comprehensive angles.\n\nIzzie Clarke: 21:21\n\nAnd that fast transformation, these new technologies and that acceleration... yes, those are challenges but they’ll provide new opportunities, too. So, what would you advise early- and mid-career researchers who are facing that?\n\nRobbert Dijkgraaf: 21:35\n\nThere are terrific opportunities, not only to do great work but to redesign the abstract academic building in which they are operating. There are really opportunities for the next generation to shift the way we do science, to think differently about career paths, think differently about teamwork. For many decades, we had a static research enterprise, and we’re now living in a time where we feel this is no longer the appropriate way to position ourselves. And we will be disappointing society, disappointing policymakers, we’ll be disappointing ourselves if we not also restructure the academic enterprise.\n\nBaojing Gu: 22:23\n\nYes, I think we have the new challenges and the new opportunities. And especially we have big data. We have new technology, especially for AI. They are not only focusing in one area. Actually, it’s interdisciplinary. So, I think that is nowadays the innovation added by the new technology. We can actually solving more issues or more difficult issues for the younger generations. If you look into solving issues from very different angles, that can easily actually solve many very difficult questions. I think that’s also the chance for the younger generations.\n\nIzzie Clarke: 23:07\n\nAnd it opens up, I suppose, that accessibility and the communication as well. How can those early-career researchers, I guess, feel empowered to start some of that change?\n\nRobbert Dijkgraaf: 23:20\n\nI think one of the great pleasures to be a scientist is that you’re part of a worldwide community. So, I’m a physicist and I talk to physicists around the world. If you talk about how should you shape careers, how should you change the way in which we collaborate, how should you structure the academic institutions, often that is a discussion you only have nationally. I will have the conversation in the Netherlands and Baojing will have the conversation in China, and these are separate conversations. But actually, they’re again the same common issues because they are driven by the big, I would say, societal forces that attack science. So, the wonderful thing that ISC can do is to have these conversations. And then facilitating conversations like this works empowering because many young people have terrific ideas. But I think part of the role ISC has is to exchange these best practices.\n\nBaojing Gu: 24:22\n\nWe have one world, one house. We need the world to work together, especially for the climate-change issues. Each region have their own issues. And so, I think, ISC have a platform that allows us to discuss with each other. That helps the scientists to understand sustainability in different parts of the world. And finally, we unify as one world.\n\nRobbert Dijkgraaf: 24:47\n\nThat’s a really very important point that Baojing made. We cannot solve these big issues if we are not collaborating globally.\n\nIzzie Clarke: 24:56\n\nYes, absolutely. But with that international collaboration comes travel, communications, as well, and sometimes that can be difficult, especially if you are at the beginning or the middle of your career. So, Baojing, if I ask you, what challenges have you faced in international collaboration and how have you been able to adapt to that situation?\n\nBaojing Gu: 25:18\n\nI think as a very beginning, as a early-career, whether you can find the resource to support you to do the international collaboration, whether you have time, you have resource, to cover the cost, that’s quite important. Nowadays, we can search to see them online, but it works different if you really go to meet people, talk to people. The ideas come from their smile. Or they’re angry. You can really understand people and understand different parts of the world through the face-to-face communication.\n\nIzzie Clarke: 25:53\n\nYeah, there’s no doubt that there’s something special about face-to-face communication. But that also relies on resources and that’s something to address – whether that’s funding, infrastructure or time – that affects scientists across the globe. So, what solutions or support structures do you think are the most effective for early- and mid-career researchers?\n\nRobbert Dijkgraaf: 26:16\n\nI think it’s very important to make this point that Baojing just made, that it’s so important to have these face-to-face personal interactions. But in an early phase of your career, you don’t realize that these people you meet might travel with you your whole career, and these are really lifelong contacts that will pay off. So, I think it’s incredibly important that people who organize conferences, schools, events, make sure that they have the means and the resources available to support young researchers from around the world, particularly the Global South, from areas where they are very restricted in resources. To achieve equity in science, it’s important that we do more for those who have less.\n\nBaojing Gu: 27:09\n\nActually, I participate in several meetings hold by ISC and they cover all my costs. I think that’s... very grateful for that, and that I can travel to Kuala Lumpur and to Oman, and I think the place is more important. I think I agree with Robbert that such as we can have a meeting in Africa or in other regions that’s short of resources, but we can bring other parts of the world to that region that allow more people from that region to participate in such kind of activities.\n\nIzzie Clarke: 27:46\n\nSo, let’s look ahead to the future. What are the biggest trends that you both see in terms of scientific careers for the future, and how can early- and mid-career researchers best prepare for them?\n\nRobbert Dijkgraaf: 27:58\n\nWhat I see happening is that the life of a scientist will be no longer one dimensional. You can go to other fields, you can be active in public outreach, in communication. And, of course, the other big trend is that we look at the collective because all those demands that are on science, not a single person can do as a single individual. We have to do it collectively within our institutions, within our nations, and I think also in the global community. And my biggest message to early-career scientists: feel free to explore that space. Keep that explorative attitude that you have in your research also for your own career, and find your own path in this vast space where you feel most at home.\n\nIzzie Clarke: 28:48\n\nBaojing, what do you think?\n\nBaojing Gu: 28:51\n\nI’m thinking the future is maybe more creative for the younger generation with the help of AI, and we can do more creative job. And we may not only change science, but also the world – how people connect to each other, how people talk to each other. And we build the high-technique facilities for the younger generation. Allow them to really create new framework or things that can lead our humankind for our next step. Another thing is critical thinking. When we read, whether we have critical thinking, whether personally we do wrong or we can do better. And I think the third most important part is see the world. We really go to field, see the world, talk to the citizens to understand their life, to understand the real world. And then we combine our critical thinking, readings and already known knowledge, and whether we can have new creative ideas for the sustainability in the future.\n\nIzzie Clarke: 30:03\n\nThat’s a great point, it’s about listening and paying attention to both your data, as well as the real world and who that research impacts.\n\nRobbert Dijkgraaf: 30:13\n\nI would also say listen to your inner voice. It’s a really complex world which you’re navigating, this is vast ocean. But I think inside you you have a little compass that tells you where your passion is, what perhaps the very beginning of an idea is. But make sure to listen to this little voice inside you, because that will guide you through the future.\n\nIzzie Clarke: 30:38\n\nGreat advice. Thank you both so much for joining me today.\n\nIf you’re an early- or mid-career researcher and you want to be part of the global community that Baojing and Robbert mentioned, then join the International Science Council forum for emerging scientists.\n\nVisit the website council.science/forum. I’m Izzie Clarke, and next time we’ll be exploring the importance of careers within science policy. Until then.",
      "url": "https://www.nature.com/articles/d41586-025-02889-w",
      "source": "Nature",
      "published": "2025-09-12",
      "sentiment_score": 0.8,
      "reasoning": "The article provides meaningful guidance and frameworks for early- and mid-career researchers navigating the evolving scientific landscape. It highlights broad, positive impacts on the scientific community worldwide by empowering researchers with career planning strategies, fostering international collaboration, and addressing challenges such as resource inequities. The content is substantive, focused on a single topic, and offers practical insights that can inspire and uplift scientists globally.",
      "category": "Other",
      "personality_title": "Guiding scientists through career planning in a changing world",
      "personality_presentation": "**Context**\nMany early- and mid-career scientists feel unsure about how to plan their futures in research. The scientific world is quickly changing with new technologies and growing demands, making career paths less clear than before.\n\n**What happened**\nA Nature Careers podcast series, supported by the International Science Council (ISC), shared advice and career planning frameworks for researchers. Experts and young scientists discussed common challenges like feeling lost, the need for intentional career decisions, and how to use models like the DOTS and RIASEC to understand career choices better. Research showed that people often start by trying a job that seems okay, then learn about themselves through experience rather than planning everything in advance.\n\n**Impact**\nThis approach helps scientists avoid feeling stuck by focusing on one step at a time and learning from each experience. The ISC also encourages global collaboration, especially helping researchers with fewer resources to connect and grow. Experts emphasized that even career setbacks teach valuable lessons and that scientists can reshape how science is done by working together across countries and disciplines.\n\n**What's next step**\nThe podcast will continue to offer practical tips on career planning. Meanwhile, early- and mid-career researchers are invited to join ISC forums to share ideas and support each other. The focus is on helping scientists explore, adapt, and find career paths that fit their skills and passions in a fast-changing world.\n\n**One-sentence takeaway**\nScientists can better navigate their careers by combining practical planning tools with real-world experience and global collaboration in today’s evolving research landscape.",
      "personality_title_fr": "Accompagner les scientifiques dans la planification de carrière dans un monde en mutation",
      "personality_presentation_fr": "**Contexte**\nDe nombreux chercheurs en début ou milieu de carrière se sentent incertains quant à la planification de leur avenir dans la recherche. Le monde scientifique évolue rapidement avec de nouvelles technologies et des exigences croissantes, rendant les parcours professionnels moins clairs.\n\n**Ce qui s'est passé**\nUne série de podcasts Nature Careers, soutenue par le Conseil international de la science (ISC), a partagé des conseils et des cadres pour aider les chercheurs. Des experts et jeunes scientifiques ont discuté des défis courants comme le sentiment de perte, la nécessité de décisions de carrière intentionnelles, et l’utilisation de modèles comme DOTS et RIASEC pour mieux comprendre les choix de carrière. Une recherche a montré que les gens commencent souvent par essayer un emploi qui semble correct, puis apprennent sur eux-mêmes par l’expérience plutôt que de tout planifier d’avance.\n\n**Impact**\nCette approche aide les scientifiques à ne pas rester bloqués en se concentrant sur une étape à la fois et en apprenant de chaque expérience. L’ISC encourage aussi la collaboration mondiale, en aidant particulièrement les chercheurs avec moins de ressources à se connecter et progresser. Les experts ont souligné que même les échecs de carrière sont précieux et que les scientifiques peuvent transformer la recherche en travaillant ensemble à travers pays et disciplines.\n\n**Étape suivante**\nLe podcast continuera à offrir des conseils pratiques sur la planification de carrière. En attendant, les chercheurs en début et milieu de carrière sont invités à rejoindre les forums ISC pour partager idées et soutien. L’objectif est d’aider les scientifiques à explorer, s’adapter et trouver des parcours correspondant à leurs compétences et passions dans un monde en rapide évolution.\n\n**Message clé en une phrase**\nLes scientifiques peuvent mieux gérer leur carrière en combinant outils pratiques, expérience réelle et collaboration mondiale dans le paysage de la recherche actuel en évolution.",
      "personality_title_es": "Guiando a los científicos en la planificación de carrera en un mundo cambiante",
      "personality_presentation_es": "**Contexto**\nMuchos científicos en etapas tempranas o medias de su carrera sienten incertidumbre sobre cómo planificar su futuro en la investigación. El mundo científico cambia rápidamente con nuevas tecnologías y mayores exigencias, haciendo que las trayectorias profesionales sean menos claras.\n\n**Qué pasó**\nUna serie de podcasts de Nature Careers, apoyada por el Consejo Internacional de la Ciencia (ISC), compartió consejos y marcos para ayudar a los investigadores. Expertos y jóvenes científicos discutieron desafíos comunes como sentirse perdidos, la necesidad de decisiones de carrera intencionales, y el uso de modelos como DOTS y RIASEC para entender mejor las elecciones profesionales. Investigaciones mostraron que las personas suelen empezar probando un trabajo que parece aceptable y luego aprenden sobre sí mismos mediante la experiencia, en lugar de planear todo desde el inicio.\n\n**Impacto**\nEste enfoque ayuda a los científicos a no quedarse atascados al enfocarse en un paso a la vez y aprender de cada experiencia. El ISC también fomenta la colaboración global, ayudando especialmente a investigadores con menos recursos a conectarse y crecer. Los expertos destacaron que incluso los tropiezos en la carrera aportan aprendizajes valiosos y que los científicos pueden transformar la forma de hacer ciencia trabajando juntos entre países y disciplinas.\n\n**Próximo paso**\nEl podcast seguirá ofreciendo consejos prácticos sobre planificación de carrera. Mientras tanto, los investigadores en etapas tempranas y medias están invitados a unirse a los foros del ISC para compartir ideas y apoyarse mutuamente. El enfoque es ayudar a los científicos a explorar, adaptarse y encontrar caminos profesionales que se ajusten a sus habilidades y pasiones en un mundo que cambia rápido.\n\n**Conclusión en una frase**\nLos científicos pueden navegar mejor sus carreras combinando herramientas prácticas, experiencia real y colaboración global en el cambiante panorama de la investigación actual.",
      "image_url": "public/images/news_image_Tips-and-tricks-to-plan-your-career-in-science.png",
      "image_prompt": "A warm, detailed painting of a winding path made of interconnected scientific tools—microscopes, test tubes, and books—leading through a softly glowing, evolving landscape filled with floating puzzle pieces and glowing orbs symbolizing ideas and collaboration, with gentle silhouettes of diverse hands reaching out to connect the pieces, all rendered in natural, muted earth tones."
    },
    {
      "title": "Early Neanderthals hunted ibex on steep mountain slopes",
      "summary": "Ancient remains from a cave in Serbia show that Neanderthals were hunting mountain goats 300,000 years ago, adding to evidence of their ability to adapt to different environments",
      "content": "Ancient remains from a cave in Serbia show that Neanderthals were hunting mountain goats 300,000 years ago, adding to evidence of their ability to adapt to different environments\n\nIbex can move nimbly across steep mountain slopes Serge Goujon/Shutterstock\n\nNearly 300,000 years ago, Neanderthals had already figured out how to hunt mountain goats along vertical cliffs and process them in well-organised camps.\n\nKnown for ambushing large animals in Western Europe’s flat meadows and forests, it seems Neanderthals adapted to the hills of Eastern Europe by adding nimble ibex to their hunting regime. The early humans skinned and butchered the animals in a nearby cave before roasting their bones for marrow and grease, showing impressive skill and knowledge far earlier than expected, says Stefan Milošević at the University of Belgrade in Serbia.\n\n“The approach of hunting ibex is completely different, because it lives on a very rugged and steep, barren terrain,” he says. “We now see that early Neanderthals – who had barely differentiated themselves anthropologically as a species – were already exploiting ecological niches that no hominin had ever exploited before.”\n\nNeanderthals evolved about 400,000 years ago, but most of what we know about them comes from sites in Western Europe that are younger than 150,000 years. So finding clues that fill in gaps in the Neanderthal timeline, habitat and culture is critical, says Marie-Hélène Moncel at France’s National Museum of Natural History in Paris, who wasn’t involved in the study.\n\nIn 2017, archaeologists found Neanderthal remains in an approximately 290,000-year-old layer of the Velika Balanica cave in Serbia, making them the oldest such remains found in Eastern Europe.\n\nSubscriber-only newsletter Sign up to Our Human Story Each month, Michael Marshall unearths the latest news and ideas about ancient humans, evolution, archaeology and more. Sign up to newsletter\n\nSince then, Milošević and his colleagues have discovered hundreds of stone tools and sifted through about 30,000 animal bone fragments in the cave. Nearly three-quarters of the fragments are slivers less than 2 centimetres long, and most of the identifiable ones are from ibex and red deer killed in spring and summer, suggesting the Neanderthals were seasonal cave dwellers.\n\nSome bones – especially long deer legs – were burned and cracked open, meaning these early Neanderthals were probably heating bones to liquefy the marrow for easier extraction and leaving leftover fragments in the hearth so that bone grease would keep the fire burning. Others showed signs of tendon harvesting, possibly for rope or nets.\n\nDeer skeletons represented older youngsters and adults, a sign of selective hunting that promotes herd survival, says Milošević. But the ibex were killed at all life stages – suggesting the Neanderthals were still “rookies” up against mountain goats, probably hunting with sharpened sticks and rudimentary traps. “They most likely had a lot of unsuccessful attempts,” he says.\n\nIn addition to these preferred food sources, the researchers also found a few processed remains from wild boar, cave bears, wolves, foxes, leopards and various birds.\n\nThe organised positions of the bones in different sections of the cave point to distinct zones for specialised tasks. The hearth was in the centre, for example, with discarded bones piled up behind it, and the entrance appeared to be used as a tool workshop.\n\nOverall, the findings point to “remarkable cognitive flexibility,” says José Carrión at the University of Murcia in Spain. “It’s a confirmation that Neanderthals were creative problem-solvers, managing complex habitats with ingenuity and skill. Neanderthals were humans – intelligent, social, and extraordinarily adaptive.”\n\n“What emerges from Balanica is the picture of Neanderthals who were not only resilient but already experimenting with strategies and social organisation that we tend to associate with much later periods,” says Antonio Rodríguez-Hidalgo at the Archaeological Institute of Mérida in Spain. “It reminds us that Neanderthal sophistication was not a late spark, but a deep-rooted flame that ignited surprisingly early in human history.”\n\nJournal reference: Quaternary Science Reviews DOI: 10.1016/j.quascirev.2025.109554",
      "url": "https://www.newscientist.com/article/2495962-early-neanderthals-hunted-ibex-on-steep-mountain-slopes/?utm_campaign=RSS%7CNSNS&utm_source=NSNS&utm_medium=RSS&utm_content=home",
      "source": "New Scientist - Home",
      "published": "2025-09-11",
      "sentiment_score": 0.8,
      "reasoning": "The article reports a significant archaeological discovery that provides new insights into Neanderthal cognitive abilities and adaptability 300,000 years ago. This finding broadens our understanding of human evolution and ancient human behavior, which has broad scientific and educational value. The story is focused, detailed, and highlights a meaningful advancement in knowledge about early humans.",
      "category": "Other",
      "personality_title": "Neanderthals hunted mountain goats on steep cliffs 300,000 years ago",
      "personality_presentation": "**Context** – Neanderthals are an ancient human species that lived around 400,000 to 40,000 years ago. Most information about them comes from Western Europe, but less is known about their lives in Eastern Europe.\n\n**What happened** – Archaeologists discovered remains in a cave in Serbia showing that Neanderthals hunted mountain goats called ibex about 300,000 years ago. They hunted these animals on steep, rocky cliffs and brought them back to the cave to skin, butcher, and cook. The Neanderthals also used bone marrow for food and made tools from stone and animal parts.\n\n**Impact** – This discovery shows that Neanderthals were very smart and could adapt to hard environments, like steep mountain areas. Hunting ibex required different skills than hunting animals on flat land, which means Neanderthals were creative problem-solvers earlier than scientists thought. It also reveals they organized their camp with special areas for cooking, tool making, and waste.\n\n**What's next step** – Researchers will continue studying the cave remains to learn more about Neanderthal life and skills. They hope to find more clues about how these early humans lived, hunted, and worked together in different environments.\n\n**One-sentence takeaway** – Neanderthals in Eastern Europe hunted mountain goats on steep cliffs 300,000 years ago, showing early intelligence and adaptability in challenging landscapes.",
      "personality_title_fr": "Les Néandertaliens chassaient les bouquetins sur des falaises escarpées il y a 300 000 ans",
      "personality_presentation_fr": "**Contexte** – Les Néandertaliens sont une espèce humaine ancienne qui a vécu il y a environ 400 000 à 40 000 ans. La plupart des informations viennent d'Europe de l'Ouest, mais on sait moins de choses sur leur vie en Europe de l'Est.\n\n**Ce qui s'est passé** – Des archéologues ont découvert dans une grotte en Serbie des traces montrant que les Néandertaliens chassaient des bouquetins il y a environ 300 000 ans. Ils attrapaient ces animaux sur des falaises abruptes et les ramenaient à la grotte pour les dépecer, découper et cuire. Ils utilisaient aussi la moelle des os pour se nourrir et fabriquaient des outils en pierre et en os.\n\n**Impact** – Cette découverte prouve que les Néandertaliens étaient très intelligents et pouvaient s’adapter à des environnements difficiles, comme les montagnes escarpées. Chasser le bouquetin demande des compétences différentes de celles pour chasser sur un terrain plat, ce qui montre qu’ils étaient des résolveurs de problèmes créatifs très tôt. On voit aussi qu’ils organisaient leur camp avec des zones spéciales pour cuisiner, fabriquer des outils et jeter les déchets.\n\n**Prochaine étape** – Les chercheurs vont continuer à étudier les restes de la grotte pour mieux comprendre la vie et les compétences des Néandertaliens. Ils espèrent trouver d’autres indices sur leurs modes de vie, leurs chasses et leur organisation sociale dans différents milieux.\n\n**Résumé en une phrase** – Les Néandertaliens d’Europe de l’Est chassaient le bouquetin sur des falaises il y a 300 000 ans, montrant une intelligence et une adaptation précoces dans des paysages difficiles.",
      "personality_title_es": "Los neandertales cazaban cabras montesas en acantilados hace 300.000 años",
      "personality_presentation_es": "**Contexto** – Los neandertales son una especie humana antigua que vivió hace entre 400.000 y 40.000 años. La mayoría de los datos provienen de Europa Occidental, pero se sabe menos sobre su vida en Europa del Este.\n\n**Qué pasó** – Arqueólogos encontraron en una cueva en Serbia pruebas de que los neandertales cazaban cabras montesas llamadas íbices hace unos 300.000 años. Cazaban estos animales en acantilados empinados y los llevaban a la cueva para despellejarlos, cortar la carne y cocinarla. También usaban la médula ósea como alimento y fabricaban herramientas de piedra y hueso.\n\n**Impacto** – Este hallazgo muestra que los neandertales eran muy inteligentes y podían adaptarse a ambientes difíciles, como las montañas escarpadas. Cazar íbices requiere habilidades distintas a las de cazar en terrenos planos, lo que indica que eran solucionadores de problemas creativos desde muy temprano. Además, organizaban su campamento con zonas especiales para cocinar, fabricar herramientas y desechar restos.\n\n**Próximo paso** – Los investigadores seguirán estudiando los restos de la cueva para aprender más sobre la vida y habilidades de los neandertales. Esperan encontrar más pistas sobre cómo vivían, cazaban y se organizaban en diferentes ambientes.\n\n**Frase clave** – Los neandertales del este de Europa cazaban cabras montesas en acantilados hace 300.000 años, demostrando inteligencia y adaptación tempranas en paisajes difíciles.",
      "image_url": "public/images/news_image_Early-Neanderthals-hunted-ibex-on-steep-mountain-s.png",
      "image_prompt": "A warm, detailed painting of a rugged mountain slope with nimble ibex gracefully navigating steep cliffs, alongside a nearby cave entrance glowing softly with the flicker of a hearth fire surrounded by scattered stone tools and animal bones, all rendered in natural earthy tones and simple colors, evoking early human ingenuity and adaptation."
    },
    {
      "title": "Britain's economy thrived after the withdrawal of the Roman Empire",
      "summary": "An archaeological dig in northern England shows iron and lead processing continued and even increased after the departure of the Romans",
      "content": "An archaeological dig in northern England shows iron and lead processing continued and even increased after the departure of the Romans\n\nArchaeological excavations near Aldborough, UK, are helping us understand life after Roman occupation R Ferraby & M.J. Millet\n\nWhen the Roman Empire withdrew from Britain, the result was not chaos and economic collapse. The metals industry in what is now northern England continued and even expanded in the subsequent centuries, according to an archaeological record of pollution from metalworking.\n\n“The argument has been that, with the disappearance of state apparatus and linked state transport systems, the regional economies collapse totally,” says Christopher Loveluck at the University of Nottingham in the UK. But that isn’t what the archaeology revealed. “We’re seeing an increase in metal pollution products.”\n\nAdvertisement\n\nLoveluck is part of a team that has excavated Roman remains from Aldborough in North Yorkshire, England. Under Roman rule, this town was called Isurium Brigantum, where metals like iron and lead were mined and processed.\n\nThe team found aerosol pollution from these metalworking operations had become trapped in the silt accumulating in an ancient riverbed at the archaeological site. By digging through the layers of sediment, the team was able to reconstruct how pollution levels varied between 345 and 1779 AD.\n\n“They get this long chronology, so you really can trace the ups and the downs,” says Jane Kershaw at the University of Oxford, who wasn’t involved in the research but who has studied early medieval metal mining.\n\nSubscriber-only newsletter Sign up to Our Human Story Each month, Michael Marshall unearths the latest news and ideas about ancient humans, evolution, archaeology and more. Sign up to newsletter\n\nIn the late 300s and early 400s, the Roman Empire lost control of Britain and withdrew. “The government apparatus goes, the tax collection apparatus goes, no new coinage arrives in Britain, and they almost certainly withdraw all of the field army units as well,” Loveluck says. The subsequent centuries have few written records, and certain industries – notably wheel-thrown pottery – went into steep decline. This gave rise to a narrative of “the society of 5th century Britain just collapsing”, says Loveluck.\n\nThe riverbed record tells a different story. Lead pollution was low during Roman times, and fell only slightly in the late 300s and early 400s. It then rose steadily until the mid-500s. Likewise, pollution from ironworking rose during the first half of the 500s.\n\nThis, argues Loveluck, suggests continuity in the large-scale production of essential commodities.\n\nThe rise in metal production may have been due to internal fighting, suggests Kershaw. “It’s a period where the various Anglo-Saxon kingdoms are coalescing,” she says. “There’s a lot of fighting between those different kingdoms.” Many men were buried in graves with swords and knives.\n\nMetal production then declined sharply in the mid-500s, and remained low for several decades. The team suggests this might be due to the Justinianic plague, which cut through the lands around the Mediterranean in 541-549 AD. Ancient DNA evidence from a graveyard in east England shows the plague did reach Britain. However, it is not clear how severe or widespread it was. “We don’t have grave pits full of plague victims, for instance, like we do with later plague events,” says Kershaw.\n\nAnglo-Saxon coins dating from the 10th and 11th century Andrew Cowie/Alamy\n\nThe apparent resilience of Aldborough metal production in the face of the Roman withdrawal fits with other evidence of economic and political continuity. “Droitwich in Worcestershire [in western England] has an unbroken sequence of salt production from the Roman period to the modern period,” says Loveluck.\n\nThe period after the Roman withdrawal has been dubbed the Dark Ages, due to a lack of written records and supposed intellectual decline. However, historians say that is at best an oversimplification.\n\nSome practices did cease, like wheel-thrown pottery and building using stone. But this period also saw the production of spectacular metalwork, often using copper. “If everything was so terrible and dark, how come they’re wearing these amazing brooches and they’ve got colourful bead necklaces,” says Kershaw.",
      "url": "https://www.newscientist.com/article/2495847-britains-economy-thrived-after-the-withdrawal-of-the-roman-empire/?utm_campaign=RSS%7CNSNS&utm_source=NSNS&utm_medium=RSS&utm_content=home",
      "source": "New Scientist - Home",
      "published": "2025-09-11",
      "sentiment_score": 0.7,
      "reasoning": "The archaeological findings reveal a positive and inspiring narrative about economic resilience and continuity in Britain after the Roman Empire's withdrawal, challenging the long-held belief of societal collapse. This has broad historical and cultural significance, providing meaningful insight into human history and societal adaptation.",
      "category": "Other",
      "personality_title": "Northern England’s metal industry thrived after Romans left",
      "personality_presentation": "**Context** – When the Roman Empire left Britain around 400 AD, many believed the economy collapsed and society fell into chaos. Written records from that time are scarce, making it hard to know what really happened.\n\n**What happened** – Archaeologists dug near Aldborough in northern England, a place where Romans mined and processed metals like iron and lead. They studied pollution trapped in old river mud to track metal production from 345 to 1779 AD. Surprisingly, metalworking did not stop after the Romans left. Instead, pollution from iron and lead increased, showing that metal production grew in the centuries following Roman rule.\n\n**Impact** – This discovery challenges the idea that Britain’s economy fell apart after the Romans left. It shows that people kept important industries running and even expanded them. The rise in metalwork might be linked to local conflicts as new kingdoms formed. Although metal production dipped during the mid-500s, possibly due to the plague, it later recovered. This evidence gives a clearer picture of life in early medieval Britain and shows that the so-called Dark Ages were not completely dark.\n\n**What's next step** – Researchers will continue studying pollution and other archaeological clues to learn more about how societies changed during this time. Understanding these patterns can help rewrite history about Britain’s early medieval period and reveal how people adapted to big changes.\n\n**One-sentence takeaway** – After the Romans left Britain, metalworking in northern England not only continued but grew, showing that the economy remained strong despite political changes.",
      "personality_title_fr": "L’industrie métallurgique prospérait dans le nord de l’Angleterre après le départ des Romains",
      "personality_presentation_fr": "**Contexte** – Lorsque l’Empire romain a quitté la Grande-Bretagne vers 400 après J.-C., on pensait que l’économie s’était effondrée et que la société était en chaos. Les documents écrits de cette époque sont rares, ce qui rend difficile la compréhension de la réalité.\n\n**Ce qui s’est passé** – Des archéologues ont creusé près d’Aldborough, dans le nord de l’Angleterre, un lieu où les Romains extrayaient et travaillaient le fer et le plomb. Ils ont étudié la pollution piégée dans la boue d’une ancienne rivière pour suivre la production de métaux entre 345 et 1779 après J.-C. Contre toute attente, le travail des métaux ne s’est pas arrêté après le départ des Romains. Au contraire, la pollution liée au fer et au plomb a augmenté, montrant que la production métallurgique s’est développée après la domination romaine.\n\n**Impact** – Cette découverte remet en question l’idée que l’économie britannique s’est effondrée après le départ des Romains. Elle montre que les populations ont maintenu des industries importantes et les ont même développées. L’augmentation de la production métallique pourrait être liée à des conflits locaux lors de la formation de nouveaux royaumes. Bien que la production ait baissé au milieu des années 500, peut-être à cause de la peste, elle s’est ensuite rétablie. Ces preuves offrent une meilleure compréhension de la vie au début du Moyen Âge britannique et montrent que la période dite des « Âges sombres » n’était pas totalement sombre.\n\n**Prochaine étape** – Les chercheurs continueront d’étudier la pollution et d’autres indices archéologiques pour mieux comprendre les changements sociaux de cette époque. Ces recherches permettront de réécrire l’histoire du début du Moyen Âge en Grande-Bretagne et de montrer comment les populations se sont adaptées aux grands changements.\n\n**Résumé en une phrase** – Après le départ des Romains, la métallurgie dans le nord de l’Angleterre a non seulement continué, mais s’est développée, prouvant que l’économie est restée forte malgré les changements politiques.",
      "personality_title_es": "La industria metalúrgica del norte de Inglaterra prosperó tras la salida de los romanos",
      "personality_presentation_es": "**Contexto** – Cuando el Imperio Romano se retiró de Gran Bretaña alrededor del año 400, se pensaba que la economía colapsó y la sociedad entró en caos. Los registros escritos de esa época son escasos, lo que dificulta conocer la verdad.\n\n**Qué pasó** – Arqueólogos excavaron cerca de Aldborough, en el norte de Inglaterra, un lugar donde los romanos extraían y trabajaban hierro y plomo. Estudiaron la contaminación atrapada en lodos de un antiguo río para seguir la producción de metales entre los años 345 y 1779. Sorprendentemente, la metalurgia no se detuvo tras la salida romana. Al contrario, la contaminación por hierro y plomo aumentó, mostrando que la producción de metales creció en los siglos posteriores.\n\n**Impacto** – Este hallazgo desafía la idea de que la economía británica colapsó tras la retirada romana. Muestra que la gente mantuvo industrias importantes e incluso las amplió. El aumento en la producción de metales podría estar relacionado con conflictos locales mientras se formaban nuevos reinos. Aunque la producción bajó a mediados del siglo VI, posiblemente por la peste, luego se recuperó. Esta evidencia ofrece una imagen más clara de la vida en la Gran Bretaña medieval temprana y muestra que la llamada Edad Oscura no fue completamente oscura.\n\n**Próximo paso** – Los investigadores seguirán estudiando la contaminación y otras pistas arqueológicas para aprender más sobre cómo cambiaron las sociedades en ese tiempo. Comprender estos patrones puede ayudar a reescribir la historia del periodo medieval temprano británico y mostrar cómo las personas se adaptaron a grandes cambios.\n\n**Resumen en una frase** – Tras la salida de los romanos, la metalurgia en el norte de Inglaterra no solo continuó, sino que creció, demostrando que la economía se mantuvo fuerte a pesar de los cambios políticos.",
      "image_url": "public/images/news_image_Britains-economy-thrived-after-the-withdrawal-of-t.png",
      "image_prompt": "A detailed, warm-toned painting of a flowing ancient riverbed layered with subtle sediment textures, where glowing symbolic representations of iron and lead ores gently radiate beneath the water’s surface, surrounded by stylized silhouettes of early medieval metal tools and swords, evoking continuity and resilience of metalworking in post-Roman northern England."
    }
  ]
}