{
  "personality": null,
  "timestamp": "2025-08-19T04:40:28.318166",
  "category": "Environment",
  "news_summary": "Advancements in monitoring Earth's water cycle, uncovering causes of methane increases, promoting regenerative farming, and natural weed control highlight significant progress in environmental sustainability and climate understanding.",
  "news_summary_fr": "Les progrès réalisés dans la surveillance du cycle de l'eau de la Terre, la découverte des causes de l'augmentation du méthane, la promotion de l'agriculture régénératrice et le contrôle naturel des mauvaises herbes mettent en évidence les avancées significatives en matière de durabilité environnementale et de compréhension du climat.",
  "news_summary_es": "Los avances en el seguimiento del ciclo del agua de la Tierra, el descubrimiento de las causas del aumento del metano, el fomento de la agricultura regenerativa y el control natural de las malas hierbas ponen de relieve los importantes progresos realizados en la sostenibilidad medioambiental y la comprensión del clima.",
  "articles": [
    {
      "title": "A Decade of Global Water Cycle Monitoring: NASA Soil Moisture Active Passive Mission",
      "summary": "Introduction The NASA Soil Moisture Active Passive (SMAP) mission, launched in 2015, has over 10 years of global L-band radiometry observations. The low frequency [1.4 GHz frequency or 21 cm (8 in) wavelength] measurements provide information on the state of land surfaces in all weather conditions – regardless of solar illumination. A principal objective of […]",
      "content": "Introduction\n\nThe NASA Soil Moisture Active Passive (SMAP) mission, launched in 2015, has over 10 years of global L-band radiometry observations. The low frequency [1.4 GHz frequency or 21 cm (8 in) wavelength] measurements provide information on the state of land surfaces in all weather conditions – regardless of solar illumination. A principal objective of the SMAP mission is to provide estimates of surface soil moisture and its frozen or thawed status. Over the land surface, soil moisture links the water, energy, and carbon cycles. These three cycles are the main drivers of regional climate and regulate the functioning of ecosystems.\n\nThe achievement of 10 years in orbit is a fitting time to reflect on what SMAP has accomplished. After briefly discussing the innovative measurement approach and the instrument payload (e.g., a radiometer and a regrettably short-lived L-band radar), a significant section of this article is devoted to describing the mission’s major scientific achievements and how the data from SMAP have been used to serve society (e.g., applied sciences) – including SMAP’s pathfinding role as Early Adopters. This content is followed by a discussion of how SMAP has dealt with issues related to radio frequency interference in the L-Band region, a discussion of the SMAP data products suite, future plans for the SMAP active–passive algorithm, and a possible follow-on L-band global radiometry mission being developed by the European Union’s Copernicus Programme that would allow for data continuity beyond SMAP. This summary for The Earth Observer is excerpted from a longer and more comprehensive paper that, as of this article’s posting, is being prepared for publication in the Proceedings of the Institute of Electrical and Electronics Engineers (IEEE).\n\nSMAP Measurement Approach and Instruments\n\nThe SMAP primary and operating instrument is the L-band radiometer, which collects precise surface brightness temperature data. The radiometer includes advanced radio frequency interference (RFI) detection and mitigation hardware and software. The radiometer measures vertical and horizontal polarization observations along with the third and fourth Stokes parameters (T3 and T4) of the microwave radiation upwelling from the Earth. The reflector boom and assembly, which includes a 6 m (20 ft) deployable light mesh reflector, is spun at 14.6 revolutions-per-minute, which creates a 1000 km (621 mi) swath as the SMAP satellite makes its Sun-synchronous orbit of the Earth – see Figure 1. This approach allows coverage of the entire globe in two to three days with an eight-day exact repeat. The radiometer instrument is calibrated monthly by pointing it to the deep sky.\n\nFigure 1. An artist’s rendering of the SMAP Observatory showing both the radiometer and radar. Figure credit: NASA/Jet Propulsion Laboratory/California Institute of Technology\n\nThe original SMAP instrument design included a companion L-band radar, which operated from April through early July 2015, acquiring observations of co- and cross-polarized radar backscatter at a spatial resolution of about 1 km (0.6 mi) with a temporal revisit of about three days over land. This data collection revealed the dependence of L-band radar signals on soil moisture, vegetation water content, and freeze thaw state. The radar transmitter failed on July 7, 2015. Shortly thereafter, the radar receiver channels were repurposed to record the reflected signals from the Global Navigation Satellite System (GNSS) constellation in August 2015, making SMAP the first full-polarimetric GNSS reflectometer in space for the investigation of land surface and cryosphere.\n\nScientific Achievements from a Decade of SMAP Data\n\nA decade of SMAP soil moisture observations have led to a plethora of scientific achievements. The data have been used to quantify the linkages of the three main metabolic cycles (e.g., carbon, water, and energy) on land. They have also been used to improve drought assessments and flood prediction as well as the accuracy of numerical weather prediction (NWP) models. They are also used to measure liquid water and thickness of ice sheets, and sea surface salinity. The subsections that follow describe how SMAP data are being put to use in myriad ways that benefit society.\n\nQuantifying Processes that Link the Terrestrial Water, Energy, and Carbon Cycles\n\nThe primary SMAP science goal is to develop observational benchmarks of how the water, energy, and carbon cycles link together over land. Soil moisture is the variable state of the land branch of the water cycle. It links the water cycle to the energy cycle through limiting latent heat flux – the change in energy as heat exchanges when water undergoes a phase change, such as evapotranspiration at the land–atmosphere interface. Soil moisture also links the water and carbon cycles, which is evident through plant photosynthesis. SMAP global observations of soil moisture fields, in conjunction with remote sensing of elements of the energy and carbon cycles, can reveal how these three cycles are linked in the real world as a benchmark for weather and Earth system models.\n\nPhotosynthesis is down-regulated by both the deficit in water availability and the lack of an adequate amount of photosynthetically active radiation. Global maps reveal how soil moisture and light regulate photosynthesis – see Figure 2. These benchmark observational results can be used to assess how Earth system models link to the three main metabolic cycles of the climate system.\n\nFigure 2. Observed regulation of photosynthesis by water availability [left] and light availability [right]. Blue denotes greater limitation. Photosynthesis rates for both maps determined using solar-induced fluorescence (SIF) measurements (mW/m2 nm sr) from the 2/nm/sr) of the estimated SIF-SM relationship in the water-limited regime [left] and the model slope (10-3/nm/sr) of estimated SIF-PAR relationship in the light-limited regime [right]. . Observed regulation of photosynthesis by water availability [left] and light availability [right]. Blue denotes greater limitation. Photosynthesis rates for both maps determined using solar-induced fluorescence (SIF) measurements (mW/mnm sr) from the Tropospheric Ozone Monitoring Instrument (TROPOMI) on the European Union’s Copernicus Sentinel-5P mission. Water availability was determined using soil moisture (SM) measurements from the Soil Moisture Active Passive (SMAP) mission. Light availability was determined using measurements of photosynthetically active radiation (PAR) from the Moderate Resolution Imaging Spectroradiometer (MODIS) on NASA’s Terra and Aqua platforms. The resulting maps show the model slope (mW/m/nm/sr) of the estimated SIF-SM relationship in the water-limited regime [left] and the model slope (10/nm/sr) of estimated SIF-PAR relationship in the light-limited regime [right]. Figure credit: Jonard et al (2022) in Jonard et al (2022) in Biogeosciences\n\nDevelopment of Improved Flood Prediction and Drought Monitoring Capability\n\nSMAP products have also been widely used in applied sciences and natural hazard decision-support systems. SMAP’s observation-based soil moisture estimates offer transformative information for managing water-related natural hazards, such as monitoring agricultural drought – defined as a persistent deficit in soil moisture – and flood volumes – defined as the landscape’s water absorption capacity during precipitation events. The SMAP project produces a parallel, near-real-time data stream that is accessed by a number of federal and state agencies in decision-support systems related to drought monitoring, food security, and landscape inundation and trafficability.\n\nEnhancing Weather and Climate Forecasting Skill\n\nSMAP’s enhancement of numerical weather prediction, model skill, and reduction of climate model projection uncertainties is based on the premise of the contribution of solar energy to weather and climate dynamics. Soil moisture has a strong influence on how available solar energy is partitioned into components (e.g., sensible heat flux versus latent heat flux) over land. The influence propagates through the atmospheric boundary layer and ultimately influences the evolution of weather.\n\nTo give an example, land surface processes can affect the evolution of the U.S. Great Plains low-level jets (GPLLJs). These jets drive mesoscale convective weather systems. Previous studies have shown that GPLLJs are sensitive to regional soil moisture gradients. Assimilation of SMAP soil moisture data improves forecasts of weakly synoptically forced or uncoupled GPLLJs compared to forecasts of cyclone-induced coupled GPLLJs. For example, the NASA Unified Weather Research and Forecasting Model, with 75 GPLLJs at 9 km (5.6 mi) resolution both with and without SMAP soil moisture data assimilation [SMAP data assimilation (DA) and no-DA respectively], shows how the windspeed mean absolute difference between SMAP DA and no-DA increase approximately linearly over the course of the simulation with maximum differences at 850 hPa (or mb) for the jet entrance and core – see Figure 3.\n\nFigure 3. The impact of adding soil moisture data [SMAP data assimilation (DA) minus no-DA] to a model simulation from the The impact of adding soil moisture data [SMAP data assimilation (DA) minus no-DA] to a model simulation from the NASA Unified Weather Research and Forecasting Model (NU-WRF)) of the Great Plains Low Level Jet (GPLLJ). The results show the mean over 75 independent GPLLJ events. The plots correspond to wind speed difference with height (y-axis) and time (hours on x-axis). The panels are for jet entrance [left], jet core [middle] and jet exit [right]. Soil moisture data assimilation enhances the intensity of the simulated GPLLJ. The stippling corresponds to 99% statistical confidence. Figure credit: Ferguson (2020) in : Ferguson (2020) in Monthly Weather Review\n\nMeasuring Liquid Water Content and Thickness of Ice Sheets\n\nThe mass loss of Greenland and Antarctica ice sheets contributes to sea-level rise – which is one of the most impactful and immediate damaging consequences of climate change. The melt rates over the last few years have raised alarm across the globe and impact countries with coastal communities. The cryosphere community has raised a call-to-action to use every observing system and model available to monitor the patterns and rates of land ice melt.\n\nSurface melt affects the ice cap mass loss in many ways: the direct melt outflow from the ablation zone of the Greenland ice sheet, the structural change of the percolation zone of the Greenland ice sheet, changes in the melt water retention and outflow boundaries, changes in the structure of the Antarctic ice shelves, and destabilization of the buttressing of the glacier outflow through various processes (e.g., hydrofracturing and calving). The long-term climate and mass balance models rely on accurate representation of snow, firn, and ice processes to project the future sea level.\n\nThe SMAP L-band radiometer has relatively long wavelength [21 cm (8 in)] observations compared to other Earth-observing instruments. It enables the measurement of liquid water content (LWC) in the ice sheets and shelves as it receives the radiation from the deep layers of the snow/firn/ice column. Relatively high LWC values absorb the emission only partially, making the measurement sensitive to different liquid water amounts (LWA) in the entire column. Figure 4 shows the cumulative LWA for 2015–2023 based on SMAP measurements.\n\nFigure 4. Total annual sum of SMAP daily liquid water amount (LWA) for 2015–2023. The black solid line on each map represents grid edges, and the grey color mask inside the ice sheet indicates melt detections by decreasing brightness temperature. Figure Credit: Andreas Colliander [Finnish Meteorological Institute].\n\nThe SMAP L-band radiometer has also been used to derive the thickness of thin sea ice [< 0.5–1 m (<1.6–3.3 ft)] across both the Arctic and Southern Ocean. Thin ice thickness retrievals from the European Space Agency’s (ESA) Soil Moisture and Ocean Salinity (SMOS) mission have been recalibrated to SMAP, using the same fixed incidence angle. The data show strong agreement and demonstrate clear benefits of a combined dataset. The L-band thin ice thickness retrievals provide a useful complement to higher-resolution profiles of thicker ice obtained from satellite altimeters (e.g. ESA’s CryoSat-2 and NASA’s Ice, Clouds and land Elevation Satellite–2 missions).\n\nExtending and Expanding the Aquarius Sea Surface Salinity Record\n\nThe joint NASA/Argentinian Aquarius/Satélite de Aplicaciones Científicas (SAC)-D (Aquarius), which operated from 2011–2015, used an L-band radiometer and an L-band scatterometer to make unprecedented monthly maps of global sea surface salinity at 150-km (93-mi) resolution. The SMAP L-band radiometer has not only extended the sea surface salinity record in the post-Aquarius period, it has also increased the spatial resolution and temporal frequency of these measurements because of its larger reflector and wider swath. The increased resolution and revisit allow new and unprecedented perspectives into mixing and freshwater events, coastal plume tracking, and other more local oceanic features.\n\nProviding New Perspectives on Global Ecology and Plant Water Stress\n\nThe L-band vegetation optical depth (VOD) – which is related to water content in vegetation – has been retrieved simultaneously with soil moisture using SMAP’s dual-polarized brightness temperatures and is being used to better understand global ecology. Water in above-ground vegetative tissue attenuates and thus depolarizes surface microwave emission, and VOD quantifies this effect. SMAP can provide global observations of VOD in all weather conditions with a two to three day temporal frequency. Changes in VOD indicate either plant rehydration or growth. Ecologists benefit from this new ecosystem observational data, which augments optical and near-infrared vegetation indices [e.g., leaf area index (LAI)] and has a higher temporal frequency that is not affected by clouds and does not saturate as rapidly for dense vegetation.\n\nExamples of how the data have been used include deciphering the conditions when vegetation uptakes soil water only for rehydration (i.e., VOD increase with no LAI change) compared to plant growth (i.e., increase in both VOD and LAI). The applications of VOD are increasing and the ecology community views this product as a valuable additional perspective on soil–plant water relations.\n\nAt the moment, this measurement has no ground-based equivalent. Therefore, field experiments with airborne instruments and ground sampling teams are needed to firmly establish the product as a new observational capability for global ecology.\n\nApplied Science Collaboration: SMAP Observations Serving Society\n\nThe SMAP project has worked with the NASA Earth Science Division Applied Sciences Program (now known as Earth Science to Action) and the natural hazards monitoring and forecasting communities for pre- and post-launch implementation of SMAP products in their operations. In some operational applications, for which long-term data continuity is a requirement, the SMAP data are still used for assessment of current conditions, as well as research and development.\n\nThe Original Early Adopters\n\nPrior to its launch, the SMAP mission established a program to explore and facilitate applied and operational uses of SMAP mission data products in decision-making activities for societal benefit. To help accomplish these objectives, SMAP was the first NASA mission to create a formal Applications Program and an Early Adopter (EA) program, which eventually became a requirement for all future NASA Earth Science directed satellite missions. SMAP’s EA program increases the awareness of mission products, broadens the user community, increases collaboration with potential users, improves knowledge of SMAP data product capabilities, and expedites the distribution and uses of mission products after launch.\n\nSMAP Data in Action\n\nSeveral project accomplishments have been achieved primarily through an active continuous engagement with EAs and operational agencies working towards national interests. SMAP soil moisture data have been used by the U.S. Department of Agriculture (USDA) for domestic and international crop yield applications. For example the USDA’s National Agricultural Statistics Service (NASS) conducts a weekly survey of crop progress, crop condition, and soil moisture condition for U.S. cropland. NASS surveys and publishes state-level soil moisture conditions in the NASS Crop Progress Report.\n\nThe traditional field soil moisture survey is a large-scale, labor-intensive data collection effort that relies heavily on responses from farmers, agricultural extension agents and/or other domain experts for field observations. One weakness of these observations is that they are based on subjective assessments rather than quantitative measures and can lead to spatial inconsistency based on the human responses from the respective counties. Moreover, the NASS Crop Progress Reports do not provide specific geolocation information for the assessed soil moisture conditions – which are extremely useful metadata to provide to data users. NASS implemented the use of SMAP observations in their weekly reports during the growing period (March–November). SMAP maps estimated root-zone soil moisture for the week of November 14–20, 2022, over NASS Pacific (California and Nevada) and Delta (Arkansas, Mississippi and Louisiana) regional domains—see Figure 5.\n\nFigure 5. SMAP-based soil moisture estimates for California, Nevada, Arkansas, Mississippi, and Louisiana, used by the U.S. Department of Agriculture’s (USDA) National Agricultural Statistics Service (NASS) in their weekly report covering November 14–20, 2022. These data are available for selected states at the NASS website linked in the text. Figure Credit: NASS\n\nSMAP Radio Frequency Interference Detection and Mitigation\n\nAlthough SMAP operates within the protected frequency allocation of 1400–1427 MHz, the radiometer has been impacted by radio frequency interference over the mission lifetime. Unauthorized in-band transmitters as well as out-of-band emissions from transmitters operating adjacent to the allocated spectrum have been observed in SMAP measurements since its launch. The previously launched SMOS and Aquarius radiometers provide evidence of global RFI at L-band. Consequently, SMAP was designed to incorporate a novel onboard digital detector on the back end to enable detection and filtering of RFI. The radiometer produces science data in time and frequency, enabling the use of multiple RFI detection methods in the ground processing software.\n\nOn-orbit data demonstrate that the RFI detection and filtering performs well and improves the quality of SMAP brightness temperature measurements. The algorithms are most effective at filtering RFI that is sparse in time and frequency, with minimal impact on the noise equivalent delta temperature (NEDT) – a measure of the radiometer sensitivity. Some areas of the globe remain problematic as RFI that is very high level and persistent results in high percentages of data loss due to removal of contaminated data. A global map of RFI detection rate for January 2025 shows a large contrast between Eastern and Western Hemispheres and between Northern and Southern Hemispheres – see Figure 6. Regions of isolated RFI and severe RFI correspond to populated areas. A detection rate of 100% means all pixels are flagged and removed, resulting in data loss. Analysis of spectral information reveal many sources are likely terrestrial radar systems; however, many wideband, high-level sources and low-level, non-radar sources also persist. Over areas of geopolitical conflict, the time-frequency data show interference covering the entire radiometer receiver bandwidth.\n\nFigure 6. Percentage of pixels on a 0.25° grid for January 2025 that have been flagged for removal by the Soil Moisture Active Passive radio frequency interference detection algorithms. Figure Credit: Priscilla N. Mohammed [GSFC]\n\nThe RFI challenge is further addressed through official spectrum management channels and formal reports that include the geolocated coordinates of sources, interference levels, frequency of occurrence during the observed period, and spectral information – all of which aid field agents as they work to identify potential offenders. Reports are submitted to the NASA Spectrum office and then forwarded to the country of interest through the Satellite Interference Reporting and Resolution System.\n\nSMAP Science Data Products\n\nThe current suite of SMAP science data products is available in the Table. The principal data products are grouped in four levels designated as L1–4. The L1 products are instrument L-band brightness temperature in Kelvin and include all four Stokes parameters (i.e., horizonal and vertical polarization as well as third and fourth Stokes). Both 6:00 AM equatorial crossing (descending) and 6:00 PM equatorial crossing (ascending data) are contained in the products. The user has access to quality flags of the conditions under which measurements are available for each project. The L1B products are time-ordered and include fore and aft measurements. L1C products are on the Equal-Area Scalable Earth V2 (EASE2) grid with polar and global projections. L2 data products are geophysical retrievals (i.e., soil moisture, VOD, and binary freeze/thaw classification on a fixed Earth grid). The L2 half-orbit products are available to the public within a day of acquisition. L3 products are daily composites and include all half-orbits for that day.\n\nThe SMAP project also produces L4 data that are the result of data assimilation. The L4 products take advantage of other environmental observations, such as precipitation, air temperature and humidity, radiative fluxes at the land surface, and ancillary land use and soil texture information, to produce estimates of surface [nominally 0–5 cm (0–2 in)] and subsurface (e.g., root-zone up to a meter) soil moisture. The data assimilation system is a merger of model and measurements and hence resolves the diurnal cycle of land surface conditions. The data assimilation system also provides estimates of surface fluxes of carbon, energy, and water, such as evaporation, runoff, gross primary productivity (GPP), and respiration. The difference between GPP and respiration is the net ecosystem exchange, which is the net source/sink of the carbon cycle over land.\n\nThe SMAP suite of products also include near-real-time (NRT) brightness temperature and soil moisture products for use in operational weather forecast applications. The NRT product targets delivery to users within three hours of measurement acquisition. The NRT uses predicted SMAP antenna pointing (instead of telemetry) and model predicted ancillary data (soil temperature) in order to support operational centers that require more than three hours of data products for updating weather forecast models. To date SMAP has met its required and target (for NRT) latency requirements.\n\nTwo other data projects merge synergistically with other (colocated) satellite measurements. The SPL2SMAP_S merges SMAP L-band radio brightness measurements with C-band synthetic aperture radar (SAR) measurements from the ESA Copernicus Sentinel-1 mission. The SAR data have high resolution and allow the generation of 1 and 3 km (0.62 and 1.8 mi) merged surface soil moisture estimates. The high resolution soil moisture information, however, is only available when there is coincident SMAP and Sentinel-1 measurements. The refresh rate of this product is limited and can be as long as 12 days.\n\nThe merged SMOS–SMAP passive L-band radiometry data allows the generation of global, near daily surface soil moisture estimates, which are required to resolve fast hydrologic processes, such as gravity drainage and recharge flux. These parameters are only partially resolved with the SMAP, with a two to three day data refresh rate. This product interpolates the multi-angular SMOS data to the SMAP 40º incident angle and uses all SMAP algorithms, including correction of waterbody impact on SMAP brightness temperature, and ancillary data for geophysical inversions to soil moisture and VOD, ensuring consistency. The combined SMAP–SMOS data product may not be available daily across locations, such as Japan, parts of China, and the Middle East, where RFI affects data collection.\n\nTable. Soil Moisture Active Passive suite of science products are available through the National Snow and Ice Data Center, one of NASA’s Distributed Active Archive Centers.\n\nProduct Type Product description Resolution (Gridding) Granule Extent SPL1BTB Geolocated, calibrated brightness temperature in time order 36 km Half Orbit SPL1CTB_E Backus-Gilbert interpolated, calibrated brightness temperature in time order (9 km) Half Orbit SPL1CTB Geolocated, calibrated brightness temperature on Equal-Area Scalable Earth V2 (EASE2) grid 36 km Half Orbit SPL1CTB_E Backus-Gilbert interpolated, calibrated brightness temperature on EASE2 grid (9 km) Half Orbit SPL2SMP Radiometer soil moisture and vegetation optical depth 36 km Half Orbit SPL2SMP_E Radiometer soil moisture and vegetation optical depth based on SPL1CTB (9 km) Half Orbit SPL2SMAP_S SMAP radiometer/Copernicus Sentinel-1 soil moisture 3 km Sentinel-1 SPL3SMP Daily global composite radiometer soil moisture and vegetation optical depth based on SPL1CTB 36 km Daily–Global SPL3SMP_E Daily global composite radiometer soil moisture and vegetation optical depth based on SPL1CTB_E (9 km) Daily–Global SPL3FTP Daily composite freeze/thaw state based on SPL1CTB 36 km Daily–Global SPL3FTP_E Daily composite freeze/thaw state based on SPL1CTB_E (9 km) Daily–Global SPL4SMAU Surface and Root Zone soil moisture 9 km 3 hours - Global SPL4CMDL Carbon Net Ecosystem Exchange 9 km Daily–Global SPL1BTB_NRT Near Real Time Geolocated, calibrated brightness temperature in time order 36 km Half Orbit SPL2SMP_NRT Near Real Time Radiometer soil moisture 36 km Half Orbit L2/L3 SMOS SM SMOS soil moisture and VOD based on SMAP algorithms (9 km) Half Orbit/Daily Global\n\nFuture Directions for the SMAP Active–Passive Algorithm\n\nAlthough the SMAP radar failed not long after launch, the data that were collected have been used to advance the development of the SMAP Active–Passive (AP) algorithm, which will be applied to the combined SMAP radiometer data and radar data from the NASA–Indian Space Research Organisation (ISRO) Synthetic Aperture Radar [NISAR] mission, a recently-launched L-Band Synthetic Aperture mission to produce global soil moisture at a spatial resolution of 1 km (0.62 mi) or better. The high resolution product can advance applications of SMAP data (e.g., agricultural productivity, wildfire, and landslide monitoring).\n\nData Continuity Beyond SMAP\n\nA forthcoming mission meets some – but not all – of the SMAP measurement requirements and desired enhancements. The European Union’s Copernicus Program Copernicus Imaging Microwave Radiometer (CIMR) mission is a proposed multichannel microwave radiometry observatory that includes L-band and four other microwave channels sharing a large mesh reflector. The mesh reflector is similar to the one that is used on SMAP, but larger. The successful SMAP demonstration of rotating large deployable mesh antennas for Earth observations has been useful to the CIMR design.\n\nIn terms of RFI detection capability, CIMR will also use an approach that is similar to SMAP. With regard to instrument thermal noise (NEDT) and data latency, CIMR meets or comes close to the next-mission desired characteristics and equals or exceeds SMAP in most of the attributes. The native L-band resolution of CIMR is ~60 km (37 mi); however, the measurements are coincident and higher-resolution measurements in this configuration allow reconstruction of L-band radiometry at higher resolution than CIMR’s L-band. It may be possible to combine the L- and C-bands and achieve a reconstructed ~15 km (9 mi) L-band product based on the coincident and overlapping measurements. A refresh rate of one day is possible with the wide-swath characteristic of CIMR.\n\nCIMR is currently in development; the first version, CIMR-1A, is expected to launch within this decade and the second version, CIMR-1B, in the mid 2030s. Since the Copernicus program supports operational activities (e.g., numerical weather prediction), the program includes plans for follow-on CIMR observatories so that the data record will be maintained without gaps in the future.\n\nConclusions\n\nThe SMAP mission was launched in 2015 and has produced over 10 years of science data. Because of its unique instrument and operating characteristics, the global low-frequency microwave radiometry with the SMAP observatory has resulted in surface soil moisture, vegetation optical depth, and freeze/thaw state estimates that outperform past and current products. The data have been widely used in the Earth system science community and also applied to natural hazards applications.\n\nThe Earth system science and application communities are actively using the decade-long, high-quality global L-band radiometry. The intensity and range of SMAP science data usage is evident in the number of peer-reviewed journal publications that contain SMAP or Soil Moisture Active Passive in their title or abstract and use SMAP data in the study (i.e., search: www.webofscience.com data-base). The authors acknowledge that many publications escape this particular query approach. Currently the bibliography includes over 1700 entries and over 20,000 citations spanning several elements of Earth system science, including hydrologic science and regional and global water cycle, oceanic and atmospheric sciences, cryosphere science, global ecology as well as microwave remote sensing technologies.\n\nTo Learn More About SMAP\n\nA more comprehensive bibliography of studies published based on SMAP data products, a set of one-page SMAP science and applications highlights in standardized format, and SMAP project documents including assessment reports are all available online via the links provided.\n\nAcknowledgements\n\nThe authors wish to acknowledge the contributions of the SMAP Science Team, the SMAP Algorithm Development Team, and the SMAP Project Office engineers and staff. All of these teams contribute to the ongoing SMAP science product generation and uses reported in this article.\n\nDara Entekhabi\n\nMassachusetts Institute of Technology\n\ndarae@mit.edu\n\nSimon Yueh\n\nJet Propulsion Laboratory/California Institute of Technology\n\nsimon.h.yueh@jpl.nasa.gov\n\nRajat Bindlish\n\nNASA Goddard Space Flight Center\n\nrajat.bindlish@nasa.gov\n\nMark Garcia\n\nJet Propulsion Laboratory/California Institute of Technology\n\nmark.d.garcia@jpl.nasa.gov\n\nJared Entin\n\nNASA Headquarters\n\njared.k.entin@nasa.gov\n\nCraig Ferguson\n\nNASA Headquarters\n\ncraig.r.ferguson@nasa.gov",
      "url": "https://science.nasa.gov/science-research/earth-science/a-decade-of-global-water-cycle-monitoring-nasa-soil-moisture-active-passive-mission/",
      "source": "NASA",
      "published": "2025-08-18",
      "sentiment_score": 0.9,
      "reasoning": "The article details a decade-long NASA mission (SMAP) that provides critical global soil moisture data, linking water, energy, and carbon cycles, improving drought and flood prediction, enhancing weather and climate forecasting, and monitoring ice sheet melt contributing to sea-level rise. The mission's data have broad societal and environmental benefits, supporting agriculture, natural hazard management, and climate science. It includes substantial context on the mission's instruments, scientific achievements, applications, and future continuity plans, demonstrating significant positive real-world impact and broad significance.",
      "category": "Environment",
      "personality_title": "NASA's SMAP mission marks 10 years of global soil moisture monitoring with wide benefits",
      "personality_presentation": "**Context** – Since 2015, NASA's Soil Moisture Active Passive (SMAP) satellite has been measuring soil moisture and freeze/thaw states worldwide. It uses a special instrument called an L-band radiometer that can see through clouds and works day and night. Soil moisture is important because it connects water, energy, and carbon cycles that affect climate and ecosystems.\n\n**What happened** – SMAP has now completed over 10 years in space, collecting data that helps scientists understand how soil moisture affects weather, droughts, floods, plant growth, and melting ice sheets. Although its radar instrument failed early in the mission, the radiometer has continued to provide detailed information across the globe every 2-3 days. NASA has worked with many agencies, like the U.S. Department of Agriculture, to apply SMAP data in real-world decisions such as crop monitoring and natural hazard tracking.\n\n**Impact** – SMAP's data have improved drought and flood predictions, helped weather forecasts by including soil moisture in models, and measured changes in ice sheets that contribute to sea level rise. For example, SMAP helps show how water availability limits plant photosynthesis and growth. It also supports better tracking of soil moisture for farmers, reducing guesswork in crop reports. The mission’s ability to detect radio interference and filter it out keeps the data reliable. This decade-long data record is unique and valuable for many areas of Earth science.\n\n**What's next step** – NASA plans to combine SMAP data with new radar data from the NASA-ISRO Synthetic Aperture Radar (NISAR) mission for higher-resolution soil moisture maps. Additionally, the European Union’s Copernicus Program is developing the Copernicus Imaging Microwave Radiometer (CIMR) mission to continue global soil moisture monitoring with improved instruments, ensuring this important data record continues into the future.\n\n**One-sentence takeaway** – NASA’s SMAP mission has provided a unique 10-year global soil moisture record that improves weather, climate, agriculture, and ice melt monitoring, with plans underway to extend and enhance this vital Earth observation.\n",
      "personality_title_fr": "La mission SMAP de la NASA célèbre 10 ans de surveillance mondiale de l’humidité du sol aux multiples bénéfices",
      "personality_presentation_fr": "**Contexte** – Depuis 2015, le satellite Soil Moisture Active Passive (SMAP) de la NASA mesure l’humidité du sol et l’état gel/dégel dans le monde entier. Il utilise un instrument spécial appelé radiomètre en bande L, capable de voir à travers les nuages et de fonctionner jour et nuit. L’humidité du sol est importante car elle relie les cycles de l’eau, de l’énergie et du carbone qui influencent le climat et les écosystèmes.\n\n**Ce qui s’est passé** – SMAP a maintenant passé plus de 10 ans en orbite, collectant des données qui aident les scientifiques à comprendre comment l’humidité du sol affecte le temps, les sécheresses, les inondations, la croissance des plantes et la fonte des calottes glaciaires. Bien que son radar ait rapidement cessé de fonctionner, le radiomètre continue de fournir des informations détaillées tous les 2 à 3 jours à l’échelle mondiale. La NASA collabore avec plusieurs agences, comme le Département américain de l’agriculture, pour utiliser les données SMAP dans des décisions réelles, notamment pour le suivi des cultures et la gestion des risques naturels.\n\n**Impact** – Les données SMAP ont amélioré les prévisions de sécheresse et d’inondation, aidé à affiner les modèles météorologiques en intégrant l’humidité du sol, et mesuré les changements des calottes glaciaires contribuant à la montée du niveau des mers. Par exemple, SMAP montre comment la disponibilité en eau limite la photosynthèse et la croissance des plantes. Elle soutient aussi un meilleur suivi de l’humidité du sol pour les agriculteurs, réduisant les approximations dans les rapports agricoles. La mission détecte et filtre les interférences radio, garantissant la fiabilité des données. Ce record de données sur dix ans est unique et précieux pour de nombreux domaines scientifiques.\n\n**Prochaines étapes** – La NASA prévoit de combiner les données SMAP avec celles du radar de la mission NISAR (NASA-ISRO Synthetic Aperture Radar) pour obtenir des cartes d’humidité du sol à plus haute résolution. De plus, le programme Copernicus de l’Union européenne développe la mission CIMR (Copernicus Imaging Microwave Radiometer) pour poursuivre la surveillance mondiale de l’humidité du sol avec des instruments améliorés, assurant ainsi la continuité de cette importante série de données.\n\n**Phrase clé** – La mission SMAP de la NASA fournit un enregistrement mondial unique de l’humidité du sol sur 10 ans, améliorant la météo, le climat, l’agriculture et la surveillance de la fonte des glaces, avec des projets pour prolonger et enrichir ces observations essentielles.\n",
      "personality_title_es": "La misión SMAP de la NASA cumple 10 años monitoreando la humedad del suelo con beneficios globales",
      "personality_presentation_es": "**Contexto** – Desde 2015, el satélite Soil Moisture Active Passive (SMAP) de la NASA mide la humedad del suelo y el estado de congelación/descongelación en todo el mundo. Utiliza un instrumento especial llamado radiómetro de banda L, que puede ver a través de las nubes y funciona de día y de noche. La humedad del suelo es importante porque conecta los ciclos del agua, la energía y el carbono que afectan el clima y los ecosistemas.\n\n**Qué pasó** – SMAP ha cumplido más de 10 años en órbita, recopilando datos que ayudan a los científicos a entender cómo la humedad del suelo influye en el clima, las sequías, las inundaciones, el crecimiento de plantas y el derretimiento de las capas de hielo. Aunque su radar dejó de funcionar temprano, el radiómetro ha seguido proporcionando información detallada en todo el mundo cada 2 a 3 días. NASA ha trabajado con varias agencias, como el Departamento de Agricultura de EE.UU., para usar los datos de SMAP en decisiones reales como el monitoreo de cultivos y la gestión de desastres naturales.\n\n**Impacto** – Los datos de SMAP han mejorado las predicciones de sequías e inundaciones, ayudado a mejorar los modelos meteorológicos incluyendo la humedad del suelo, y medido cambios en las capas de hielo que contribuyen al aumento del nivel del mar. Por ejemplo, SMAP muestra cómo la disponibilidad de agua limita la fotosíntesis y el crecimiento de las plantas. También apoya un mejor seguimiento de la humedad del suelo para agricultores, reduciendo la incertidumbre en los informes agrícolas. La misión detecta y filtra interferencias de radio para mantener la calidad de los datos. Este registro de datos de una década es único y valioso para muchas áreas científicas.\n\n**Próximos pasos** – NASA planea combinar los datos de SMAP con los del radar de la misión NISAR (NASA-ISRO Synthetic Aperture Radar) para obtener mapas de humedad del suelo con mayor resolución. Además, el programa Copernicus de la Unión Europea desarrolla la misión CIMR (Copernicus Imaging Microwave Radiometer) para continuar el monitoreo global de la humedad del suelo con instrumentos mejorados, asegurando la continuidad de este importante registro de datos.\n\n**Frase clave** – La misión SMAP de la NASA ha proporcionado un registro global único de humedad del suelo durante 10 años que mejora el clima, la agricultura y el monitoreo del derretimiento de hielo, con planes para extender y mejorar estas observaciones esenciales.\n",
      "image_url": "public/images/news_image_A-Decade-of-Global-Water-Cycle-Monitoring-NASA-Soi.png",
      "image_prompt": "A detailed, warm-toned painting of a large, gently spinning satellite with a distinctive 6-meter mesh reflector orbiting above a vibrant Earth, where the land below shows glowing, interconnected streams representing soil moisture linking water, energy, and carbon cycles, alongside abstract icy regions with subtle layers indicating ice sheet thickness and liquid water content, all rendered in natural, soft earth and ice hues without human figures."
    },
    {
      "title": "Scientists just found a hidden factor behind Earth’s methane surge",
      "summary": "Roughly two-thirds of all atmospheric methane, a potent greenhouse gas, comes from methanogens. Tracking down which methanogens in which environment produce methane with a specific isotope signature is difficult, however. UC Berkeley researchers have for the first time CRISPRed the key enzyme involved in microbial methane production to understand the unique isotopic fingerprints of different environments to better understand Earth's methane budget.",
      "content": "Roughly two-thirds of all emissions of atmospheric methane -- a highly potent greenhouse gas that is warming planet Earth -- come from microbes that live in oxygen-free environments like wetlands, rice fields, landfills and the guts of cows.\n\nTracking atmospheric methane to its specific sources and quantifying their importance remains a challenge, however. Scientists are pretty good at tracing the sources of the main greenhouse gas, carbon dioxide, to focus on mitigating these emissions. But to trace methane's origins, scientists often have to measure the isotopic composition of methane's component atoms, carbon and hydrogen, to use as a fingerprint of various environmental sources.\n\nA new paper by researchers at the University of California, Berkeley, reveals how the activity of one of the main microbial enzymes involved in producing methane affects this isotope composition. The finding could change how scientists calculate the contributions of different environmental sources to Earth's total methane budget.\n\n\"When we integrate all the sources and sinks of carbon dioxide into the atmosphere, we kind of get the number that we're expecting from direct measurement in the atmosphere. But for methane, large uncertainties in fluxes exist -- within tens of percents for some of the fluxes -- that challenge our ability to precisely quantify the relative importance and changes in time of the sources,\" said UC Berkeley postdoctoral fellow Jonathan Gropp, who is first author of the paper. \"To quantify the actual sources of methane, you need to really understand the isotopic processes that are used to constrain these fluxes.\"\n\nGropp teamed up with a molecular biologist and a geochemist at UC Berkeley to, for the first time, employ CRISPR to manipulate the activity of this key enzyme to reveal how these methanogens interact with their food supply to produce methane.\n\n\"It is well understood that methane levels are rising, but there is a lot of disagreement on the underlying cause,\" said co-author Dipti Nayak, UC Berkeley assistant professor of molecular and cell biology. \"This study is the first time the disciplines of molecular biology and isotope biogeochemistry have been fused to provide better constraints on how the biology of methanogens controls the isotopic composition of methane.\"\n\nMany elements have heavier or lighter versions, called isotopes, that are found in small proportions in nature. Humans are about 99% carbon-12 and 1% carbon-13, which is slightly heavier because it has an extra neutron in its nucleus. The hydrogen in water is 99.985% hydrogen-1 and 0.015% deuterium or hydrogen-2, which is twice as heavy because it has a neutron in its nucleus.\n\nThe natural abundances of isotopes are reflected in all biologically produced molecules and variations can be used to study and fingerprint various biological metabolisms.\n\n\"Over the last 70 years, people have shown that methane produced by different organisms and other processes can have distinctive isotopic fingerprints,\" said geochemist and co-author Daniel Stolper, UC Berkeley associate professor of earth and planetary science. \"Natural gas from oil deposits often looks one way. Methane made by the methanogens within cow guts looks another way. Methane made in deep sea sediments by microorganisms has a different fingerprint. Methanogens can consume or 'eat', if you will, a variety of compounds including methanol, acetate or hydrogen; make methane; and generate energy from the process. Scientists have commonly assumed that the isotopic fingerprint depends on what the organisms are eating, which often varies from environment to environment, creating our ability to link isotopes to methane origins.\"\n\n\"I think what's unique about the paper is, we learned that the isotopic composition of microbial methane isn't just based on what methanogens eat,\" Nayak said. \"What you 'eat' matters, of course, but the amount of these substrates and the environmental conditions matter too, and perhaps more importantly, how microbes react to those changes.\"\n\n\"Microbes respond to the environment by manipulating their gene expression, and then the isotopic compositions change as well,\" Gropp said. \"This should cause us to think more carefully when we analyze data from the environment.\"\n\nThe paper will appear Aug. 14 in the journal Science.\n\nVinegar- and alcohol-eating microbes\n\nMethanogens -- microorganisms that are archaea, which are on an entirely separate branch of the tree of life from bacteria -- are essential to ridding the world of dead and decaying matter. They ingest simple molecules -- molecular hydrogen, acetate or methanol, for example -- excreted by other organisms and produce methane gas as waste. This natural methane can be observed in the pale Will-o'-the-wisps seen around swamps and marshes at night, but it's also released invisibly in cow burps, bubbles up from rice paddies and natural wetlands and leaks out of landfills. While most of the methane in the natural gas we burn formed in association with hydrocarbon generation, some deposits were originally produced by methanogens eating buried organic matter.\n\nThe isotopic fingerprint of methane produced by methanogens growing on different \"food\" sources has been well established in laboratory studies, but scientists have found that in the complexity of the real world, methanogens don't always produce methane with the same isotopic fingerprint as seen in the lab. For example, when grown in the lab, species of methanogens that eat acetate (essentially vinegar), methanol (the simplest alcohol), or molecular hydrogen (H 2 ) produce methane, CH 4 , with a ratio of hydrogen and carbon isotopes different from the ratios observed in the environment.\n\nGropp had earlier created a computer model of the metabolic network in methanogens to understand better how the isotope composition of methane is determined. When he got a fellowship to come to UC Berkeley, Stolper and Nayak proposed that he experimentally test his model. Stolper's laboratory specializes in measuring isotope compositions to explore Earth's history. Nayak studies methanogens and, as a postdoctoral fellow, found a way to use CRISPR gene editing in methanogens. Her group recently altered the expression of the key enzyme in methanogens that produces the methane -- methyl-coenzyme M reductase (MCR) -- so that its activity can be dialed down. Enzymes are proteins that catalyze chemical reactions.\n\nExperimenting with these CRISPR-edited microbes -- in a common methanogen called Methanosarcina acetivorans growing on acetate and methanol -- the researchers looked at how the isotopic composition of methane changed when the enzyme activity was reduced, mimicking what is thought to happen when the microbes are starved for their preferred food.\n\nThey found that when MCR is at low concentrations, cells respond by altering the activity of many other enzymes in the cell, causing their inputs and outputs to accumulate and the rate of methane generation to slow so much that enzymes begin running both backwards and forwards. In reverse, these other enzymes remove a hydrogen from carbon atoms; running forward, they add a hydrogen. Together with MCR, they ultimately produce methane (CH 4 ). Each forward and reverse cycle requires one of these enzymes to pull a hydrogen off of the carbon and add a new one ultimately sourced from water. As a result, the isotopic composition of methane's four hydrogen molecules gradually comes to reflect that of the water, and not just their food source, which starts with three hydrogens.\n\nThis is different from typical assumptions for growth on acetate and methanol that assume no exchange between hydrogen derived from water and that from the food source.\n\n\"This isotope exchange we found changes the fingerprint of methane generated by acetate and methanol consuming methanogens vs. that typically assumed. Given this, it might be that we have underestimated the contribution of the acetate-consuming microbes, and they might be even more dominant than we have thought,\" Gropp said. \"We're proposing that we at least should consider the cellular response of methanogens to their environment when studying isotopic composition of methane.\"\n\nBeyond this study, the CRISPR technique for tuning production of enzymes in methanogens could be used to manipulate and study isotope effects in other enzyme networks broadly, which could help researchers answer questions about geobiology and the Earth's environment today and in the past.\n\n\"This opens up a pathway where modern molecular biology is married with isotope-geochemistry to answer environmental problems,\" Stolper said. \"There are an enormous number of isotopic systems associated with biology and biochemistry that are studied in the environment; I hope we can start looking at them in the way molecular biologists now are looking at these problems in people and other organisms -- by controlling gene expression and looking at how the stable isotopes respond.\"\n\nFor Nayak, the experiments are also a big step in discovering how to alter methanogens to derail production of methane and redirect their energy to producing useful products instead of an environmentally destructive gas.\n\n\"By reducing the amount of this enzyme that makes methane and by putting in alternate pathways that the cell can use, we can essentially give them another release valve, if you will, to put those electrons, which they were otherwise putting in carbon to make methane, into something else that would be more useful,\" she said.\n\nOther co-authors of the paper are Markus Bill of Lawrence Berkeley National Laboratory and former UC Berkeley postdoc Rebekah Stein, and Max Lloyd, who is a professor at Penn State University. Gropp was supported by a fellowship from the European Molecular Biology Organization. Nayak and Stolper were funded, in part, by Alfred B. Sloan Research Fellowships. Nayak also is an investigator with the Chan-Zuckerberg Biohub.",
      "url": "https://www.sciencedaily.com/releases/2025/08/250816113528.htm",
      "source": "Latest Science News -- ScienceDaily",
      "published": "2025-08-18",
      "sentiment_score": 0.85,
      "reasoning": "The article reports a significant scientific breakthrough where researchers used CRISPR to better understand and potentially control microbial methane production, a major contributor to greenhouse gas emissions. This advancement has broad implications for improving the accuracy of methane source tracking and offers a pathway to mitigate methane emissions, which is crucial for climate action. The study is detailed, focused on a single topic, and has meaningful real-world environmental impact.",
      "category": "Environment",
      "personality_title": "Scientists use gene editing to better understand Earth's methane sources",
      "personality_presentation": "**Context** – Methane is a powerful greenhouse gas that warms the planet. Most of it comes from tiny microbes called methanogens, which live in places without oxygen like wetlands, cow stomachs, and landfills. Tracking exactly where methane comes from is hard because scientists rely on special signatures in methane atoms called isotopes.\n\n**What happened** – Researchers at the University of California, Berkeley, used a gene editing tool called CRISPR to change how a key enzyme works in methanogens. This enzyme helps produce methane. By doing this, they learned how different environmental factors affect the isotope signatures of methane these microbes produce.\n\n**Impact** – This discovery shows that methane’s isotope fingerprints depend not only on what methanogens eat but also on how they react to their environment. This means scientists can now better identify methane sources and improve estimates of how much methane different places release. It also opens new ways to control methane production by changing microbial activity.\n\n**What’s next step** – The team plans to use this gene editing approach to study other enzymes and isotope systems. They also hope to find ways to reduce methane emissions by rerouting the microbes’ energy into producing useful products instead of methane gas.\n\n**One-sentence takeaway** – Using CRISPR to study methane-producing microbes helps scientists track methane sources more accurately and suggests new methods to reduce harmful emissions.",
      "personality_title_fr": "Des scientifiques utilisent l’édition génétique pour mieux comprendre les sources de méthane sur Terre",
      "personality_presentation_fr": "**Contexte** – Le méthane est un gaz à effet de serre puissant qui réchauffe la planète. La majorité provient de microbes appelés méthanogènes, qui vivent dans des environnements sans oxygène comme les zones humides, l’estomac des vaches et les décharges. Il est difficile de suivre précisément d’où vient le méthane car les scientifiques utilisent des signatures spéciales dans les atomes de méthane appelées isotopes.\n\n**Ce qui s’est passé** – Des chercheurs de l’Université de Californie à Berkeley ont utilisé un outil d’édition génétique nommé CRISPR pour modifier une enzyme clé chez les méthanogènes. Cette enzyme aide à produire le méthane. Grâce à cela, ils ont découvert comment différents facteurs environnementaux influencent les signatures isotopiques du méthane produit par ces microbes.\n\n**Impact** – Cette découverte montre que les empreintes isotopiques du méthane dépendent non seulement de ce que mangent les méthanogènes, mais aussi de leur réaction à l’environnement. Cela permet aux scientifiques d’identifier plus précisément les sources de méthane et d’améliorer les estimations des émissions. Cela ouvre aussi de nouvelles voies pour contrôler la production de méthane.\n\n**Prochaine étape** – L’équipe prévoit d’utiliser cette méthode d’édition génétique pour étudier d’autres enzymes et systèmes isotopiques. Ils espèrent aussi réduire les émissions de méthane en orientant l’énergie des microbes vers la production de produits utiles plutôt que de méthane.\n\n**Résumé en une phrase** – L’utilisation de CRISPR pour étudier les microbes producteurs de méthane aide à mieux suivre les sources de méthane et suggère de nouvelles façons de réduire ces émissions nuisibles.",
      "personality_title_es": "Científicos usan edición genética para entender mejor las fuentes de metano en la Tierra",
      "personality_presentation_es": "**Contexto** – El metano es un gas de efecto invernadero muy potente que calienta el planeta. La mayoría proviene de microbios llamados metanógenos, que viven en lugares sin oxígeno como humedales, el estómago de las vacas y vertederos. Es difícil rastrear exactamente de dónde viene el metano porque los científicos usan firmas especiales en los átomos de metano llamadas isótopos.\n\n**Qué pasó** – Investigadores de la Universidad de California en Berkeley usaron una herramienta de edición genética llamada CRISPR para cambiar cómo funciona una enzima clave en los metanógenos. Esta enzima ayuda a producir metano. Al hacerlo, aprendieron cómo diferentes factores ambientales afectan las firmas isotópicas del metano que producen estos microbios.\n\n**Impacto** – Este descubrimiento muestra que las huellas isotópicas del metano dependen no solo de lo que comen los metanógenos, sino también de cómo reaccionan al ambiente. Esto permite a los científicos identificar mejor las fuentes de metano y mejorar las estimaciones de cuánto metano liberan diferentes lugares. También abre nuevas formas de controlar la producción de metano.\n\n**Próximo paso** – El equipo planea usar esta técnica de edición genética para estudiar otras enzimas y sistemas isotópicos. También esperan encontrar maneras de reducir las emisiones de metano redirigiendo la energía de los microbios para producir productos útiles en lugar de gas metano.\n\n**Resumen en una frase** – Usar CRISPR para estudiar microbios productores de metano ayuda a los científicos a rastrear mejor las fuentes de metano y sugiere nuevos métodos para reducir emisiones dañinas.",
      "image_url": "public/images/news_image_Scientists-just-found-a-hidden-factor-behind-Earth.png",
      "image_prompt": "A warm, detailed painting of glowing, abstract microbial cells shaped like intertwined spirals and molecular structures, gently emitting soft, colorful gas bubbles symbolizing methane, set against a calm wetland background with subtle hints of rice paddies and cow silhouettes in the distance, using natural earth tones and soft greens to evoke a harmonious connection between microbes, their enzyme activity, and the environment."
    },
    {
      "title": "Sustainability In Your Ear: Author Kelsey Timmerman’s Journey to Find Farms Regenerating Earth",
      "summary": "The scale of agriculture’s environmental impact is staggering. According to the EPA, agricultural runoff is...\nThe post Sustainability In Your Ear: Author Kelsey Timmerman’s Journey to Find Farms Regenerating Earth appeared first on Earth911.",
      "content": "The scale of agriculture’s environmental impact is staggering. According to the EPA, agricultural runoff is the leading cause of degraded water quality in rivers and streams. Today’s farming practices lead to 1.70 billion tons of U.S. topsoil annually, and agriculture produces 31% of human greenhouse gas emissions. Tune in to meet Kelsey Timmerman, author of the new book, Regenerating Earth, from Patagonia Books, who faces a heartbreaking reality shared by many rural families: he can’t let his children swim in the pond near their Indiana home because of agricultural contamination. Rather than accept environmental degradation as inevitable, Kelsey embarked on a global journey to find farmers and communities who prove there’s another way. From standing barefoot in traditional Hawaiian kalo patches to protecting cattle from lions alongside Maasai warriors in Kenya to discovering how chocolate could save Brazilian rainforests, he found regenerative agriculture practices that build soil, sequester carbon, and challenge everything we think we know about farming.\n\nKelsey’s story revolves around systems thinking that connects everything from chloroplasts to mycorrhizal fungi with how we eat. He argues that industrial agriculture leads to farmers being farmed by corporations, trapping them in debt to buy chemically treated seeds, fertilizer, herbicides, and fungicides. His journey uncovered regenerative practices rooted in Indigenous and traditional farming practices combined with cutting-edge soil science. Farming can be more profitable for farmers who heal the land. The solutions aren’t new. They’re already in hand but largely ignored or forgotten because they require attention to nature’s complexity rather than simplifying life to fit profit margins. Regenerative thinking starts by approaching problems through the same lens that nature does, by putting everything to use and accounting for all positive and negative impacts while treating nothing as waste to be discarded. For consumers, this means understanding that grocery choices ripple through complex ecological networks, with practical steps starting at farmers markets and supporting farms that regenerate rather than degrade the land which you can find using the Farm Map at https://regenerationinternational.org/. You can learn more about Kelsey’s work at kelseytimmerman.com and Regenerating Earth is available on Amazon, Powell’s Books, and local booksellers.\n\nSubscribe to Sustainability In Your Ear on iTunes\n\nFollow Sustainability In Your Ear on Spreaker, iHeartRadio, or YouTube",
      "url": "https://earth911.com/podcast/sustainability-in-your-ear-author-kelsey-timmermans-journey-to-find-farms-regenerating-earth/",
      "source": "Earth911",
      "published": "2025-08-18",
      "sentiment_score": 0.85,
      "reasoning": "The article highlights a meaningful and inspiring global effort to promote regenerative agriculture, which has broad environmental benefits such as soil restoration, carbon sequestration, and reducing agricultural pollution. It focuses on a clear, substantive topic with detailed examples and practical solutions that can impact many communities and ecosystems worldwide.",
      "category": "Environment",
      "personality_title": "Author Kelsey Timmerman explores farms that heal the Earth",
      "personality_presentation": "**Context** – Farming today causes big environmental problems like dirty water and loss of topsoil. It also creates nearly a third of human greenhouse gases. Many farms use chemicals that harm the land and water.\n\n**What happened** – Kelsey Timmerman wrote a new book called Regenerating Earth. He traveled around the world to meet farmers using special methods that restore soil and protect nature. He visited places like Hawaii, Kenya, and Brazil to see how these farms work differently. These methods include old Indigenous farming ideas combined with new science.\n\n**Impact** – Timmerman’s journey shows that farming doesn’t have to damage the planet. Instead, it can help the soil grow healthy again and capture carbon from the air, which helps fight climate change. These farms also can be more profitable for farmers. This challenges the usual way of farming that focuses on chemicals and profit.\n\n**What's next step** – People can support farms that protect the environment by choosing their food carefully. Tools like the Farm Map from Regeneration International help shoppers find farms that use these better methods. Timmerman’s book and website share more stories and ideas about how farming can change.\n\n**One-sentence takeaway** – Kelsey Timmerman’s global journey reveals how regenerative farming can restore the Earth and offer a hopeful alternative to harmful industrial agriculture.",
      "personality_title_fr": "L’auteur Kelsey Timmerman explore des fermes qui soignent la Terre",
      "personality_presentation_fr": "**Contexte** – L’agriculture actuelle cause de gros problèmes environnementaux comme la pollution de l’eau et la perte de la couche arable. Elle produit aussi près d’un tiers des gaz à effet de serre humains. Beaucoup de fermes utilisent des produits chimiques qui abîment la terre et l’eau.\n\n**Ce qui s’est passé** – Kelsey Timmerman a écrit un nouveau livre intitulé Regenerating Earth. Il a voyagé à travers le monde pour rencontrer des agriculteurs qui utilisent des méthodes spéciales pour restaurer le sol et protéger la nature. Il a visité des endroits comme Hawaï, le Kenya et le Brésil pour voir comment ces fermes fonctionnent différemment. Ces méthodes mêlent des pratiques agricoles indigènes anciennes et des sciences modernes.\n\n**Impact** – Le voyage de Timmerman montre que l’agriculture ne doit pas forcément abîmer la planète. Au contraire, elle peut aider le sol à redevenir sain et capter le carbone de l’air, ce qui aide à lutter contre le changement climatique. Ces fermes peuvent aussi être plus rentables pour les agriculteurs. Cela remet en question l’agriculture classique basée sur les produits chimiques et le profit.\n\n**Prochaine étape** – Les gens peuvent soutenir les fermes qui protègent l’environnement en choisissant bien leur nourriture. Des outils comme la carte des fermes de Regeneration International aident les consommateurs à trouver ces fermes. Le livre et le site de Timmerman partagent plus d’histoires et d’idées pour changer l’agriculture.\n\n**En une phrase** – Le voyage mondial de Kelsey Timmerman révèle comment l’agriculture régénérative peut restaurer la Terre et offrir une alternative prometteuse à l’agriculture industrielle nocive.",
      "personality_title_es": "El autor Kelsey Timmerman explora granjas que sanan la Tierra",
      "personality_presentation_es": "**Contexto** – La agricultura actual causa grandes problemas ambientales como la contaminación del agua y la pérdida de suelo fértil. También produce casi un tercio de los gases de efecto invernadero humanos. Muchas granjas usan productos químicos que dañan la tierra y el agua.\n\n**Qué pasó** – Kelsey Timmerman escribió un nuevo libro llamado Regenerating Earth. Viajó por el mundo para conocer agricultores que usan métodos especiales que restauran el suelo y protegen la naturaleza. Visitó lugares como Hawái, Kenia y Brasil para ver cómo funcionan estas granjas de manera diferente. Estos métodos combinan prácticas agrícolas indígenas antiguas con ciencia moderna.\n\n**Impacto** – El viaje de Timmerman muestra que la agricultura no tiene que dañar el planeta. En cambio, puede ayudar a que el suelo vuelva a ser saludable y capturar carbono del aire, lo que ayuda a combatir el cambio climático. Estas granjas también pueden ser más rentables para los agricultores. Esto desafía la forma común de cultivar que se centra en productos químicos y ganancias.\n\n**Próximo paso** – Las personas pueden apoyar granjas que protegen el medio ambiente eligiendo bien sus alimentos. Herramientas como el Mapa de Granjas de Regeneration International ayudan a los compradores a encontrar estas granjas. El libro y el sitio web de Timmerman comparten más historias e ideas para cambiar la agricultura.\n\n**Resumen en una frase** – El viaje global de Kelsey Timmerman muestra cómo la agricultura regenerativa puede restaurar la Tierra y ofrecer una alternativa esperanzadora a la agricultura industrial dañina.",
      "image_url": "public/images/news_image_Sustainability-In-Your-Ear-Author-Kelsey-Timmerman.png",
      "image_prompt": "A warm, detailed painting of diverse hands gently holding rich, dark soil teeming with glowing mycorrhizal fungi threads connecting to vibrant kalo plants and healthy cacao pods, set against a backdrop of a serene pond and distant Maasai warriors protecting grazing cattle under a soft, natural color palette."
    },
    {
      "title": "Kill Weeds the All-Natural Way",
      "summary": "If you’re an avid gardener, you know just how toxic weed killers can be. Sure,...\nThe post Kill Weeds the All-Natural Way appeared first on Earth911.",
      "content": "If you’re an avid gardener, you know just how toxic weed killers can be. Sure, they’ll knock out garden pests, but they may also hurt carefully tended flowers and vegetables, and may be harmful to children and pets. Organic gardening is popular for precisely this reason — people want to reduce pesticide and herbicide exposure, particularly since many of these chemicals are known carcinogens.\n\nWithout using traditional herbicidal agents, though, how can you keep your garden well-maintained? The good news is that modern research has expanded our arsenal of natural weed control methods significantly. From traditional techniques like solarization with old plastic sheeting to cutting-edge allelopathic strategies and essential oil applications, today’s organic gardeners have more effective options than ever before.\n\nThis article contains affiliate links. If you purchase an item through one of these links, we receive a small commission that helps fund our Recycling Directory.\n\nPull ‘Em Out\n\nAs any old-school gardener will tell you, the best way to get rid of weeds is to pull them out by the roots. Hand weeding can be time-consuming, but it eliminate surrounding weeds that are restricting growth of the garden plants you want. Plus, with a bit of guidance, you can get the kids to help weed. It’s a key part of learning to garden, after all. Here are a few pro tips for better weeding:\n\nThe Old Farmer’s Almanac pointed out German research that suggests that weeding at night, dawn, or dusk can reduce weed germination by up to 78% compared to daytime soil disturbance.\n\nKeep tools sharp and well-maintained for easier, less strenuous work.\n\nHoe in the morning, when the soil is dry, to create a “dust mulch” that inhibits new weed germination.\n\nVinegar Is A Solution\n\nEven if your kids have outgrown the need to put anything and everything in their mouths, it’s much harder to control outdoor pets and wildlife, which is one reason why it’s so important to eliminate chemical herbicides. At the same time, you still want an easy way to deal with weeds, and that’s where vinegar comes in.\n\nGardeners can use 20% acetic acid vinegar products instead of household vinegar (5% solution) for significantly better results. Add one tablespoon of dish soap per gallon to help the solution stick to leaves.\n\nTake your weed whacking chemistry to the next level with 15-20 drops of clove or orange essential oil per gallon for increased herbicidal effectiveness. And always apply vinegar on sunny days for best results, as UV light enhances the burning effect.\n\nHeat Things Up\n\nIn general, plants don’t like too much heat — that’s why your greens wilt when put into a steaming pan. If there are plants that you’re trying to get rid of, then why not put the power of fire to work for you? Order a weed torch, or pick one up at your local gardening store and use it to apply heat to the leaves of any invasive plants. We don’t recommend this method in areas that suffer from droughts, frequent forest and brush fires, or where burn bans are in effect, it’s an effective strategy when you take proper precautions.\n\nElectric weed control is emerging as a safer alternative to flame weeding with comparable effectiveness, though currently more suitable for commercial applications. Electric methods should only be used in spring/winter in Mediterranean climates due to fire risk.\n\nThe downside to thermal methods is that you’ll typically need to repeat the process as the weeds resprout. Since you aren’t killing the roots, the weeds won’t be eliminated.\n\nMake It Steamy\n\nFinally, in the same vein as flame-weeding, but without the potential for starting a wildfire, you can kill weeds by pouring boiling water on them. This strategy is perfect if you’re having problems with weeds around the edges of your lawn or in the cracks of the sidewalk, since you can dump a pot of water right there. It’s also a good way to clear a plot of weeds before planting since it doesn’t leave any harmful remnants — just irrigated soil.\n\nNew Natural Methods\n\nCorn gluten meal (CGM) is a natural by-product of processing corn that can be applied to lawns to prevent weed seeds from developing roots. Unlike the methods above, this works as a pre-emergent herbicide, stopping weeds before they start.\n\nHow It Works:\n\nCorn gluten is 60% protein with compounds that inhibit root formation during seed germination\n\nA lso provides 10% nitrogen by volume, acting as a slow-release fertilizer\n\nResearch shows corn gluten delivering 60% to 95% effective weed prevention, depending on application rate.\n\nIowa State University suggests applying 20 pounds per 1,000 square feet of lawn or garden in late March to mid-April, 3-5 weeks before crabgrass germination. Water lightly after application, then allow the soil to dry to kill sprouted seedlings. When shopping, look for products labeled as herbicide-grade with 60%+ protein content.\n\nAllelopathic Plant Power\n\nSome plants naturally suppress weeds through allelopathy – the release of chemicals that inhibit other plants’ growth. You can harness this natural phenomenon in several ways.\n\nWater Extracts:\n\nS orghum and sunflower water extracts can reduce weed growth by up to 70%\n\nThe application of 6 liters per hectare of combined sorghum and sunflower can provide increased crop yields while controlling weeds economically.\n\nCover Crops:\n\nEssential Oil Herbicides\n\nEssential oils provide another powerful natural option, working as contact herbicides that damage plant cell membranes. Essential oils can be toxic to cats, so use caution in areas where cats may be present.\n\nEffective Oils:\n\nDIY Essential Oil Recipe:\n\nSoulful Sister recommends one tablespoon of clove or orange essential oil, plus one cup of vinegar, or 15 drops each of clove and peppermint oils, with two liters of vinegar and one tablespoon of dish soap as an effective weed control recipe.\n\nSheet Mulching with Cardboard\n\nCardboard provides a practical, biodegradable alternative to synthetic landscape fabric, blocking sunlight while allowing water and air movement before breaking down to add organic matter to soil. Unlike synthetic landscape fabric, cardboard won’t interfere with long-term soil health, and, if you use broken-down boxes from a move or online shopping deliveries, you can practice a circular approach to gardening.\n\nGarden and Gun suggests using plain brown corrugated cardboard with minimal ink.\n\nRemove all tape and staples before using cardboard in the garden, as it can contribute to microplastics and dangerous, rusty sharps in your soil.\n\nOverlap pieces and wet cardboard to conform to the contour of your ground.\n\nAfter placement, Albopepper suggests immediately covering the cardboard with two to four inches of organic mulch.\n\nCompetitive Planting Strategies\n\nBenjamin Greenfield recommends strategic planting to create natural weed suppression through competition for light, water, and nutrients. Try these techniques:\n\nDense plantings create canopy shade that prevents weed seedling establishment\n\nGrow salad greens, radishes, or herbs in close rows to maximize coverage\n\nInterplant short, fast-growing crops between slower, taller ones\n\nThe Old Farmer’s Almanac points out that keeping lawn edges trimmed can reduce weed invasions into garden areas\n\nOptimal Application Timing\n\nPre-emergent controls: Apply corn gluten meal when soil temperature reaches 55-60°F consistently\n\nVinegar applications: Best results on sunny, dry days when temperatures are above 70°F\n\nCompetitive planting: Establish dense plantings early in the season before weed pressure peaks\n\nWeekly maintenance with string trimmers to prevent weeds from setting seed can dramatically reduce future weed pressure. Even if you can’t eliminate existing weeds, preventing seed formation stops next year’s problems.\n\nLooking to the Future\n\nModern weed science continues to develop precision management techniques using remote sensing, modeling, and robotics. However, these are currently more suited for large-scale agricultural applications. Among home gardeners, the journal Agronomy suggests that there is a trend toward integrated approaches combining multiple natural methods rather than relying on any single strategy.\n\nWith so many natural weed control options, why turn to chemical herbicides that could endanger your family, pets, and wildlife? The key to success is using an integrated approach: apply pre-emergent controls like corn gluten meal in early spring, establish competitive plantings, use targeted post-emergent treatments like enhanced vinegar solutions or essential oils for breakthrough weeds, and maintain consistent prevention practices.\n\nEditor’s Note: Originally published on May 4, 2017, this article was substantially updated in August 2025.",
      "url": "https://earth911.com/home-garden/all-natural-weed-killer/",
      "source": "Earth911",
      "published": "2025-08-18",
      "sentiment_score": 0.85,
      "reasoning": "The article presents a range of effective, natural weed control methods that reduce reliance on toxic chemical herbicides, benefiting gardeners, families, pets, and the environment. It provides detailed, practical, and scientifically supported alternatives with broad applicability for home gardeners, promoting safer and sustainable gardening practices.",
      "category": "Environment",
      "personality_title": "New natural methods offer safer ways to control garden weeds",
      "personality_presentation": "**Context** – Many gardeners want to avoid toxic weed killers because they can harm flowers, vegetables, pets, and children. Organic gardening is growing in popularity as people look for safer, chemical-free ways to keep their gardens healthy.\n\n**What happened** – Recent research and gardening experts have shared several natural methods to control weeds effectively. These include pulling weeds by hand, using vinegar mixed with essential oils, applying heat with weed torches or boiling water, and new options like corn gluten meal that stops weeds before they grow. Other strategies use special plants that naturally block weed growth, cardboard mulch to block sunlight, and smart planting to outcompete weeds.\n\n**Impact** – These natural methods reduce the need for harmful chemicals in gardens, making them safer for families and pets. They also help protect the environment by avoiding toxic substances. For example, corn gluten meal not only stops weed roots but also adds nutrients to the soil. Using cardboard as mulch recycles materials while improving soil health. These practical tips give gardeners more choices to keep their gardens weed-free without risking harm.\n\n**What's next step** – Gardeners are encouraged to combine several natural methods throughout the year for the best results. For instance, applying corn gluten meal in early spring, planting densely to block weeds, and using vinegar solutions for stubborn weeds later. Scientists are also working on advanced tools like robots and sensors to help control weeds on large farms, but home gardeners can already benefit from these easy, natural options.\n\n**One-sentence takeaway** – Using a mix of natural weed control methods lets gardeners protect their plants safely while reducing harmful chemicals in their gardens.\n",
      "personality_title_fr": "De nouvelles méthodes naturelles pour contrôler les mauvaises herbes en toute sécurité",
      "personality_presentation_fr": "**Contexte** – De nombreux jardiniers veulent éviter les désherbants toxiques car ils peuvent nuire aux fleurs, légumes, animaux domestiques et enfants. Le jardinage biologique gagne en popularité car les gens cherchent des moyens plus sûrs et sans produits chimiques pour entretenir leurs jardins.\n\n**Ce qui s’est passé** – Des recherches récentes et des experts en jardinage ont partagé plusieurs méthodes naturelles efficaces pour contrôler les mauvaises herbes. Cela inclut l’arrachage manuel, l’utilisation de vinaigre mélangé à des huiles essentielles, l’application de chaleur avec des torches à désherber ou de l’eau bouillante, et de nouvelles options comme le gluten de maïs qui empêche les mauvaises herbes de pousser. D’autres stratégies utilisent des plantes spéciales qui bloquent naturellement la croissance des mauvaises herbes, du paillis en carton pour bloquer la lumière, et un semis intelligent pour concurrencer les mauvaises herbes.\n\n**Impact** – Ces méthodes naturelles réduisent le besoin de produits chimiques nocifs dans les jardins, les rendant plus sûrs pour les familles et les animaux. Elles aident aussi à protéger l’environnement en évitant les substances toxiques. Par exemple, le gluten de maïs empêche les racines des mauvaises herbes tout en nourrissant le sol. Utiliser du carton comme paillis recycle des matériaux tout en améliorant la santé du sol. Ces conseils pratiques offrent aux jardiniers plus d’options pour garder leur jardin sans mauvaises herbes sans risque.\n\n**Étape suivante** – Il est conseillé aux jardiniers de combiner plusieurs méthodes naturelles tout au long de l’année pour obtenir les meilleurs résultats. Par exemple, appliquer le gluten de maïs au début du printemps, planter densément pour bloquer les mauvaises herbes, et utiliser des solutions de vinaigre pour les mauvaises herbes tenaces plus tard. Les scientifiques travaillent aussi sur des outils avancés comme des robots et capteurs pour les grandes exploitations, mais les jardiniers amateurs peuvent déjà profiter de ces options naturelles simples.\n\n**Résumé en une phrase** – Utiliser un mélange de méthodes naturelles pour contrôler les mauvaises herbes permet aux jardiniers de protéger leurs plantes en toute sécurité tout en réduisant les produits chimiques nocifs dans leur jardin.\n",
      "personality_title_es": "Nuevos métodos naturales ofrecen formas seguras de controlar las malas hierbas en el jardín",
      "personality_presentation_es": "**Contexto** – Muchos jardineros desean evitar los herbicidas tóxicos porque pueden dañar flores, verduras, mascotas y niños. La jardinería orgánica está creciendo en popularidad porque la gente busca formas más seguras y sin químicos para mantener sus jardines saludables.\n\n**Qué pasó** – Investigaciones recientes y expertos en jardinería han compartido varios métodos naturales para controlar las malas hierbas de manera efectiva. Estos incluyen arrancar las malas hierbas a mano, usar vinagre mezclado con aceites esenciales, aplicar calor con antorchas o agua hirviendo, y nuevas opciones como la harina de gluten de maíz que detiene las malas hierbas antes de que crezcan. Otras estrategias usan plantas especiales que bloquean naturalmente el crecimiento de malas hierbas, mantillo de cartón para bloquear la luz y plantaciones inteligentes para competir con las malas hierbas.\n\n**Impacto** – Estos métodos naturales reducen la necesidad de químicos dañinos en los jardines, haciéndolos más seguros para familias y mascotas. También ayudan a proteger el medio ambiente al evitar sustancias tóxicas. Por ejemplo, el gluten de maíz no solo detiene las raíces de las malas hierbas, sino que también aporta nutrientes al suelo. Usar cartón como mantillo recicla materiales y mejora la salud del suelo. Estos consejos prácticos ofrecen a los jardineros más opciones para mantener sus jardines libres de malas hierbas sin riesgos.\n\n**Próximos pasos** – Se recomienda a los jardineros combinar varios métodos naturales durante el año para obtener los mejores resultados. Por ejemplo, aplicar harina de gluten de maíz a principios de primavera, plantar densamente para bloquear las malas hierbas y usar soluciones de vinagre para las malas hierbas difíciles más tarde. Los científicos también trabajan en herramientas avanzadas como robots y sensores para grandes granjas, pero los jardineros caseros ya pueden beneficiarse de estas opciones naturales fáciles.\n\n**Frase clave** – Usar una mezcla de métodos naturales para controlar las malas hierbas permite a los jardineros proteger sus plantas de forma segura mientras reducen los químicos dañinos en sus jardines.\n",
      "image_url": "public/images/news_image_Kill-Weeds-the-All-Natural-Way.png",
      "image_prompt": "A cozy garden scene featuring hands gently pulling weeds by their roots beside flourishing vegetables and flowers, with a steaming kettle pouring boiling water on nearby weeds, and a small bottle of vinegar with essential oil droplets beside a rustic wooden table, all rendered in soft, natural earth tones and warm sunlight."
    }
  ]
}