{
  "personality": null,
  "timestamp": "2025-08-01T10:20:45.614331",
  "category": "Other",
  "news_summary": "Today's news highlights breakthroughs in scientific understanding, from the direct observation of elusive particle interactions to uncovering the genetic and historical origins of potatoes and ancient ink.",
  "news_summary_fr": "Les nouvelles d'aujourd'hui mettent en lumière des avancées dans la compréhension scientifique, de l'observation directe des interactions de particules insaisissables à la découverte des origines génétiques et historiques des pommes de terre et de l'encre ancienne.",
  "news_summary_es": "Las noticias de hoy destacan los grandes avances en el conocimiento científico, desde la observación directa de las elusivas interacciones entre partículas hasta el descubrimiento de los orígenes genéticos e históricos de las patatas y la tinta antigua.",
  "articles": [
    {
      "title": "Direct observation of coherent elastic antineutrino–nucleus scattering",
      "summary": "Nature, Published online: 30 July 2025; doi:10.1038/s41586-025-09322-2Direct observation of coherent elastic neutrino–nucleus scattering is reported using the data from the CONUS+ experiment in which the antineutrinos with energy less than 10 MeV are produced in a nuclear reactor.",
      "content": "Data taking\n\nData from the CONUS+ run 1 analysis presented in this study correspond to the period from November 2023 to July 2024. Three of the four detectors, named C2, C3 and C5, are considered for analysis with a total active mass of 2.83 ± 0.02 kg (ref. 2). After selection cuts to remove time periods with unstable noise conditions, deficient radon flushing and a few days with a strong contribution of microphonic events, the exposure considering the active mass is 327 kg days with reactor on and 60 kg days with the reactor off.\n\nThe evolution of the main environmental parameters during reactor on and off is shown in Extended Data Fig. 1 for the three detectors. The shape of the noise peak reconstructed in the lowest channels of the data acquisition system (DAQ) was found to follow a Gaussian distribution1 and its full-width at half maximum (FWHM) was monitored over time with variations below 2 eV ee (electron equivalent energy). The dataset was selected to ensure that the noise rate variations are below 20%.\n\nIn a dedicated study, we confirmed the correlation between noise rate and cryocooler power. Stability was improved compared with the CONUS setup in Brokdorf (KBR) by replacing the two-fan ventilation system with a water-cooled chiller system for the pulse tube cryocoolers1. Even at cryocooler power variations of up to 30 W, no correlation was observed with the count rate in the region of interest above 160 eV ee .\n\nDetector response and energy scale\n\nThe trigger efficiency was determined by injecting artificial signals produced by a pulse generator with the same rise time as the physical signals. The pulses are injected through a specific circuit implemented in the HPGe preamplifier. A detailed scan allowed us to measure the detector response as a function of the energy1. The trigger efficiency remains more than 90% down to 140 eV ee for all detectors. The evolution of the trigger efficiency curve parameters during run 1 was studied with different measurements, remaining stable with differences of less than 2% throughout the run.\n\nThe energy was calibrated using the binding energies of the K-shell (10.37 keV) and L-shell (1.30 keV) from the decays of 68Ge/71Ge inside the HPGe diodes, considering a linear behaviour in this energy range. At shallow depth, the 68Ge/71Ge radioisotopes are continuously produced by cosmic and muon-induced neutrons1. Thus, it is possible to monitor the stability of the energy scale during the whole measurement of this in situ activation, observing variations below 2%. A specific 252Cf irradiation was performed at the end of run 1, collecting in 45 days of the measurement more than 5,000 events from the K-shell and 700 events from the L-shell in each detector. In this way, an energy calibration uncertainty below 5 eV ee is achieved. The HPGe diode also produces 158 eV X-rays from the binding energy of the M-shell of the 68Ge/71Ge decays. Using the ratio of the K- and L-shells, a total of 100 events per detector was expected after irradiation with 252Cf. Although an indication of such events is seen, no conclusive signal was observed because of the proximity to the noise edge and the lack of statistics.\n\nThe linearity of the DAQ chain in the sub-keV ee region was investigated using the pulse generator signals. The results are shown in Extended Data Fig. 2. Deviations from a pure linear behaviour are observed below 250 eV ee , at which a few eV ee variations have a strong impact on the CEνNS signal. They were attributed to two DAQ-related effects34. The energy non-linearity was corrected in the CEνNS analysis and was taken into account during the event energy reconstruction.\n\nThe energy resolution of the detectors at low energies was also evaluated with the pulse generator signals. For the C2 detector, a resolution of (48 ± 1) eV ee (FWHM) was found, whereas the C5 and C3 detectors have a resolution of (47 ± 1) eV ee (FWHM). Further contribution to the total energy resolution comes from the statistical fluctuation of the number of electron–hole pairs produced in the Ge crystals in the case of an event, which is\n\n$$\\Delta {E}_{{\\rm{S}}}=2.35\\sqrt{F{\\epsilon }E}$$ (1)\n\nwith ϵ = 2.96 eV, the average energy needed to create a single electron–hole pair in Ge, and the Fano factor F = 0.11.\n\nSelection cuts\n\nSelection cuts are applied to reduce background events while keeping the CEνNS signal. Four different selection cuts are applied to the data. First, the muon-veto system allows for efficient suppression of the impact of cosmic radiation, using a 450-μs anti-coincidence window between the veto and HPGe signals. The average rate detected in the muon veto during reactor on is (274 ± 1) Hz and decreases to (214 ± 1) Hz in reactor off periods. The corresponding average dead times in both periods are 12.3% (reactor on) and 9.6% (reactor off). Second, inhibit signals are generated when the increasing baseline has reached saturation of the dynamic range of the transistor reset preamplifier for each HPGe detector1. An anti-coincidence window of 1–2.5 ms (depending on the detector) is applied to veto unwanted spurious HPGe detector signals generated shortly after the resets. This cut suppressed 30% events after the muon veto anti-coincidence at low energy, becoming negligible above 5 keV ee . The dead time induced by this cut is calculated, combined with the previously mentioned muon-veto dead time, to avoid the overlapping of both veto windows. An additional dead time of 0.5–2.1% (depending on the detector) is estimated. Third, the time difference distribution of events is studied in each channel as proposed in ref. 2. Finally, an anti-coincidence cut is applied between different HPGe detectors with a 5-ms time window. The probability of a neutrino interacting with different detectors is negligible, whereas for other backgrounds, such as muon-induced neutrons created in the shield, simultaneous hits in several detectors at once can be expected.\n\nThe rejection efficiencies of these selection cuts are summarized in Extended Data Table 1 for the three detectors in different energy regions. The total dead time induced by the selection cuts is between 12.8% and 14.4% in the reactor on periods.\n\nBackground model\n\nThe background model used in the analysis of the CONUS+ data is based on Monte Carlo simulations using the Geant4-based framework MaGe39, following the approach in ref. 29. A complete decomposition of the background in both reactor on and off data was done for all detectors used in the analysis. In the following, the main sources of background are described.\n\nCosmogenic neutrons\n\nAs described in ref. 30, the impact of cosmogenic neutrons with energies up to 100 MeV was investigated by first propagating the expected neutron spectrum at the KKL location (based on refs. 40,41) with a flux of (1.4 ± 0.2) × 10−2 neutrons s−1 cm−2 through a reactor building model. Then the resulting flux is tracked inside the CONUS+ room. This flux was used as the basis for the next simulation, in which neutrons were started isotropically from a half-sphere around the CONUS+ shield, and their contribution to the CONUS+ background was measured. The simulations show a contribution of (21.6 ± 3.1) counts day−1 kg−1 in each detector in the energy range between 0.4 keV ee and 1 keV ee , which corresponds to approximately half of the background counts in this region.\n\nCosmogenic muons\n\nFor the muon simulations29, the expected flux and muon spectrum at an overburden of 7.4 m water equivalent (w.e.) were calculated from those at the surface of Earth42,43 and propagated through the shield. The resulting spectrum was validated by comparing it with the CONUS+ data without the applied muon-veto cut, which showed good agreement. The muon-veto cut was then applied by multiplying the simulation output by a factor of 0.01 for all energies greater than 2 keV ee , corresponding to a muon-veto efficiency of 99%.\n\nFor energies below 2 keV ee , a different approach was taken. Here, simulations show an inefficiency in the tagging ability of the muon-veto system because of the setup of the shield. The outer muon veto is located under a layer of lead in the CONUS+ shield. As such, it is possible for muons to pass through this outermost lead layer without hitting one of the muon-veto layers. These muons can induce electromagnetic showers in the outer lead layer, which propagate through the shield and are registered in the Ge detectors. However, because no muon passes through any muon-veto layer in such an event, the energy deposition in the plastic scintillator plates will be much lower, resulting in a greatly reduced tagging efficiency of these events. Simulations show that at energies below 0.4 keV ee , up to 80% of all muon-induced background comes from these events. Based on this simulation output, this inefficiency was modelled with a polynomial and accounted for in the final muon-veto efficiency. The resulting efficiency drops towards lower energies, with its minimum being 97% below 0.4 keV ee . Using this approach, the overall background contribution of the cosmic ray muons was found to be (17.4 ± 0.3) counts day−1 kg−1 in each detector in the energy range between 0.4 keV ee and 1 keV ee , which corresponds to approximately a third of the background counts in this region.\n\nLeakage test component\n\nDuring the final run of the CONUS experiment at KBR, an additional background component had to be introduced in the background model28. This component was present after ventilation of the cryostats with argon gas to avoid mechanical deformation during a regular leakage test at KBR in July 2019 (ref. 29). Of the four detectors used in the CONUS experiment, two (C2 and C3) are used for the analysis presented in this work and are affected by this additional background. The simulations and the background model show that an additional component with the same shape is still present in the background of these two detectors, but is absent in C5, which was not at KBR at the time. This additional background is constant during reactor on and off periods. Therefore, the leakage test component was again included in the background model of C2 and C3 by modelling it using a function with two parameters, as in ref. 28. The resulting impact is below 10% in the energy region between 0.4 keV ee and 1 keV ee .\n\nOther background components\n\nThe remaining background in each detector is made up of many different components, similar to the situation in KBR29. There are no hints that the detector upgrades or the movement of the setup were introducing any contamination. The background model includes cosmogenically induced isotopes in the copper parts (57Co, 60Co and 54Mn) of the cryostat and the Ge crystals (57Co, 68Ge, 68Ga, 65Zn and 3H), Radon inside the detector chamber, 210Pb inside the cryostat and shield, metastable Ge states (71mGe, 73mGe and 75mGe) and inert gases coming from the reactor (85Kr, 135Xe and 3H). The results of the simulation of these components were scaled to be in accordance either with the rates of gamma lines produced by the decay of these isotopes in the spectrum (for example, for radon) or with screening measurements performed before the installation. The listed contributions are typically very subdominant in the region of interest, with the decay of radon inside the detector chamber being the only exception. This contribution results in a background rate of (1.9 ± 0.1) counts day−1 kg−1 between 0.4 keV ee and 1 keV ee for the C5 detector (C2: (2.8 ± 0.1) counts day−1 kg−1; C3: (2.6 ± 0.1) counts day−1 kg−1). These values correspond to approximately 5% of the background in this energy region. Radon decays have a high impact on energies above 100 keV ee , at which they can contribute up to 60% of the measured background. Slow pulses arising from decays on the surface of the diode and in the transition layer are included in the model29. Energy depositions from these events can be stopped within the transition layer, and the released charge diffuses slowly into the active volume, resulting in long rise times and incomplete charge collection. Their impact is accounted for by registering the exact coordinates of an interaction in the Ge crystal. If the coordinates place it within the transition layer of the crystal, the energy of the event is shifted towards lower energies using a sigmoid-like function. Details on this procedure can be found in ref. 2.\n\nModel differences in reactor off data\n\nThe background model accounts for the experimental differences during data collection with the reactor off. The first of these differences is induced by the fact that during a reactor outage, the drywell head from the containment structure surrounding the reactor core is placed directly above the CONUS+ room. This drywell head is made of 3.8 cm steel and, therefore, increases the overburden of the experiment by approximately 0.3 m w.e., which results in a reduction of 19% in the flux of cosmogenic neutrons and a reduction of 3% in the flux of cosmic ray muons. As a result, these two background contributions are reduced accordingly. The second difference in the background model of the reactor off period comes from a more effective removal of radon in the detector chamber. During the course of run 1, shield tightness and radon-free air flushing were improved. As a result, the radon contribution in reactor off time is reduced by approximately a factor of 4–6 compared with that for reactor on. The radon contributions are scaled to match the count rates in the gamma lines induced by the radon decay. Moreover, reactor-correlated background components, such as reactor neutrons and high-energy gammas, for example, from 16N, were investigated. Their impact was found to be negligible in all energy regions, including the region of interest. The resulting background model for all three detectors can be seen in Fig. 2 and Extended Data Fig. 3. The time-dependent contributions of the M-shell line of the 68Ge/71Ge decays are included in the background model. The difference between the M-shell contribution in reactor on and off periods was estimated based on the measured K-shell count rates. This difference was found to be below 1% of the observed neutrino signal.\n\nIn Extended Data Fig. 4, the reactor on and off datasets are compared with the background models. If the calculated difference between on and off phases is added to the reactor off data, good agreement with the measured on data is found above the signal region. For all detectors, background models and data are fully consistent above 0.4 keV ee . As the data in the reactor off phase are statistically limited, the background model still plays an important part in the analysis. Extended Data Fig. 5 shows the fractional contribution of the main components to the total background rate as predicted in the model.\n\nQuenching\n\nThe ratio of the ionization energy released by nuclear recoil in a CEνNS event and the ionization energy of electrons of the same energy is given by the quenching factor. In the CONUS+ analysis, the energy-dependent signal quenching is described by the Lindhard model32 with a quenching parameter k = (0.162 ± 0.004) as determined in ref. 34. Alternative quenching descriptions are also tested as described in the supplementary material of ref. 28, including a linear and cubic functional form to describe the increased quenching factor compared with the Lindhard theory found in ref. 33. It was shown that the Migdal effect is subdominant with respect to the CEνNS signal in our region of interest36.\n\nThe signal predictions for the different quenching descriptions are shown in Extended Data Fig. 6, together with the difference between the data in the reactor on phase and the background model. A signal rate of (2,600 ± 300) events is expected for the linear function, whereas for the cubic function, (550 ± 50) events are predicted. Both numbers are significantly higher than the neutrino rate extracted from the CONUS+ data. The standard Lindhard model provides the best description of the reactor-correlated excess at low energy. In Extended Data Fig. 6, we have included an additional data point at 200 eV ee , which is obtained using the information shown in fig. 4 of ref. 19. There, a CEνNS signal was approximated with an exponential using two parameters, the amplitude at 200 eV ee (A 0.2 ) and a decay constant. The favoured value for A 0.2 is shown within a 2σ contour in a two-dimensional plot of the two parameters. We scaled this A 0.2 value to our exposure and corrected for the difference in neutrino flux. As expected, it matches the description of Lindhard with a linear increase added at low energies, but it is in clear conflict with the CONUS+ data. The lower error bar corresponds to the smallest value of A 0.2 in the 2σ contour. This value is also ruled out by the CONUS+ data points.\n\nLikelihood fit and systematic treatment\n\nA likelihood function is used to determine the CEνNS signal in the CONUS+ run 1 data.\n\n$$\\begin{array}{l}-2\\log {\\mathcal{L}}=-2\\log {{\\mathcal{L}}}_{{\\rm{ON}}}-2\\log {{\\mathcal{L}}}_{{\\rm{OFF}}}\\\\ \\,\\,\\,\\,\\,+\\sum _{ij}{({{\\boldsymbol{\\theta }}}_{i}-{\\bar{{\\boldsymbol{\\theta }}}}_{i})}^{{\\rm{T}}}\\,{{\\rm{Cov}}}_{ij}^{-1}\\,({{\\boldsymbol{\\theta }}}_{j}-{\\bar{{\\boldsymbol{\\theta }}}}_{j})\\\\ \\,\\,\\,\\,\\,+\\sum _{i}\\frac{{({\\theta }_{i}-{\\bar{\\theta }}_{i})}^{2}}{{\\sigma }_{{\\theta }_{i}}},\\end{array}$$ (2)\n\nwhere \\({{\\mathcal{L}}}_{{\\rm{O}}{\\rm{N}}}\\) and \\({{\\mathcal{L}}}_{{\\rm{O}}{\\rm{F}}{\\rm{F}}}\\) are the binned likelihood functions for reactor on and off periods. Gaussian pull terms for the systematic uncertainties are also included. Here, the first term represents the pull terms for correlated parameters, namely, the trigger efficiency parameters, and the second term represents pull terms for uncorrelated parameters, such as the active mass of the detectors, the reactor neutrino flux and the uncertainty on the energy scale calibration of the spectra. Parameters that were experimentally determined are pulled to their measured values. The background scaling factor b, an additional fit parameter for the overall normalization of the background model, is also included and pulled to 1. The binned likelihood functions assume a Poisson distribution and have the form\n\n$$-\\log {\\mathcal{L}}=\\mathop{\\sum }\\limits_{i=1}^{n}-{n}_{i}\\log ({\\mu }_{i})+{\\mu }_{i}+\\log ({n}_{i}!),$$ (3)\n\nwhere N is the number of bins in the region of interest, n i is the bin content in the histograms of the measured data and μ i is the bin content of the model. For a single detector, the model μ for reactor on data is calculated from the sum of the background model nb (scaled with b) and the predicted CEνNS spectrum ns (scaled with the signal parameter s) by taking into account the live time of the experiment (t ON and t OFF ), the active volume of the detector (m act ), the dead-time correction (c dt ), the fission flux (θ 2 ) and a multiplication factor (θ 3 ), summarizing uncertainties of the detector response. In total,\n\n$$\\begin{array}{l}{\\mu }_{i}^{{\\rm{ON}}}=\\left(s\\times {t}_{{\\rm{ON}}}\\times {\\theta }_{2}\\times {n}_{i}^{s}+b\\times {n}_{i}^{b}\\times \\frac{{t}_{{\\rm{ON}}}}{{t}_{{\\rm{OFF}}}}\\right)\\times {c}_{{\\rm{dt}}}\\times \\frac{{\\theta }_{3}}{{m}_{{\\rm{act}}}},\\\\ {\\mu }_{i}^{{\\rm{OFF}}}=b\\times {n}_{i}^{b}\\times {c}_{{\\rm{dt}}}\\times \\frac{{\\theta }_{3}}{{m}_{{\\rm{act}}}}.\\end{array}$$ (4)\n\nThe combined fit minimizes \\(-\\log {{\\mathcal{L}}}_{{\\rm{ON}}}\\) and \\(-\\log {{\\mathcal{L}}}_{{\\rm{OFF}}}\\) for all three detectors simultaneously, whereas the signal parameter s, which indicates the number of CEνNS counts, is shared among the detectors.\n\nFits using just single detectors independently give consistent results as shown in Extended Data Table 2. To cross-check the result, fits were performed by two independent likelihoods with different approaches concerning the uncertainty on the quenching model. Likelihood A applied a predicted CEνNS spectrum with a fixed k parameter (k = 0.162), while introducing a fourth-order polynomial to vary the shape of the signal spectrum, applying Gaussian pull terms on each parameter. In likelihood B, the k value of the Lindhard model is a fit parameter with a pull term. Moreover, there are some differences in the treatment of the non-linearity corrections and the minimization algorithms between the two likelihood fits. The results of both likelihood implementations agree within 2%.\n\nFor the signal prediction, we choose the Helm parameterization of the nuclear form factor44,45 and a reactor antineutrino spectrum based on the data-driven approach in ref. 31. The given antineutrino spectra are adjusted to the fission fraction of the Leibstadt reactor and augmented with measured antineutrino spectra at energies above 8 MeV (ref. 46) and simulation data below 1.8 MeV (the threshold of inverse beta decay)47. We assume no uncertainty on the nuclear form factor, but account for a 2% uncertainty on the weak mixing angle48, leading to an overall uncertainty of 3.2% on the CEνNS cross-section. The shape of the applied antineutrino spectra, the thermal power of the reactor, fission fractions and energy releases per fission of the relevant fission isotopes contribute a combined 4.6% error to the expected event rate. Further uncertainties on quenching, detector active mass, trigger efficiency and the energy threshold are taken into account and listed in Extended Data Table 3. All contributions lead to an overall uncertainty of 17% on the signal prediction. To be conservative, we assume prediction uncertainties are fully correlated between single detectors. Currently, the dominant uncertainty is from the energy calibration. Future extended calibrations will allow us to reduce this uncertainty from 5 eV ee to 3 eV ee .\n\nThe likelihood fit itself gives a result of (395 ± 86) CEνNS counts in the combined fit of the three detectors. Additional systematic uncertainties not implemented as pull terms are evaluated in a second step and added in quadrature, giving the final uncertainty of ±106 signal counts, as shown in the Extended Data Table 3. The non-linearity term was obtained by varying the correction parameters and checking the impact on the likelihood result. The uncertainties of the calibration points in Extended Data Fig. 2 were used to generate the parameter variations. A Gaussian fit was performed on the distribution of the central values of the new likelihood results, where its 1σ value was taken as additional systematic uncertainty. The term related to the background model was studied in the same way by varying muon flux, neutron flux and the leakage component. The variations were 14% (taken from ref. 40), 6% (based on ref. 43) and 10%, respectively. Moreover, the systematic uncertainty of the fit method was estimated by the difference between likelihood A and B.\n\nThe fractional contribution from antineutrinos of different energies to the signal expectation is quantified in Extended Data Fig. 7. At the current detector threshold, we are sensitive to antineutrino energies above 5 MeV. With lower detection thresholds, the steep rise in antineutrino flux towards low energies will result in markedly higher signal expectations1.",
      "embedding": null,
      "url": "https://www.nature.com/articles/s41586-025-09322-2",
      "source": "Nature",
      "published": "2025-08-01",
      "sentiment_score": 0.75,
      "reasoning": "The article reports a significant scientific breakthrough in the observation of coherent elastic antineutrino–nucleus scattering, which advances fundamental physics knowledge and could have future technological or medical applications. While the topic is highly technical and may not emotionally engage a broad audience deeply, it is an important positive development in science that inspires curiosity and hope for future innovations.",
      "category": "Other",
      "personality_title": "Scientists record clear evidence of antineutrinos interacting with atomic nuclei",
      "personality_presentation": "**Context** – Neutrinos and antineutrinos are tiny particles that rarely interact with matter, making them difficult to study. Coherent elastic neutrino–nucleus scattering (CEvNS) is a subtle effect predicted decades ago, where neutrinos gently bounce off whole atomic nuclei.\n\n**What happened** – Researchers from the CONUS+ experiment observed CEvNS with antineutrinos produced by a nuclear reactor. They collected data from November 2023 to July 2024 using advanced germanium detectors to measure tiny energy signals caused by these rare interactions.\n\n**Impact** – This marks one of the first direct observations of CEvNS with reactor-produced antineutrinos under 10 MeV energy. It confirms a key physics prediction and opens new paths to study neutrino properties with practical reactor sources. The improved detector stability and sensitivity achieved are crucial for precise measurements.\n\n**What's next step** – Researchers plan to refine their measurements and explore applications such as monitoring reactors for safety and investigating neutrino behavior further. Continued improvements in detector technology could also enable new discoveries in particle physics and related fields.\n\n**One-sentence takeaway** – The CONUS+ experiment has successfully observed coherent elastic scattering of reactor antineutrinos on atomic nuclei, advancing neutrino science with precise, low-energy measurements.",
      "personality_title_fr": "Première observation directe de l'interaction des antineutrinos avec les noyaux atomiques",
      "personality_presentation_fr": "**Contexte** – Les neutrinos et antineutrinos sont des particules très petites qui interagissent rarement avec la matière, ce qui rend leur étude difficile. La diffusion élastique cohérente des neutrinos sur les noyaux atomiques (CEvNS) est un phénomène subtil prédit il y a plusieurs décennies, où les neutrinos rebondissent doucement sur le noyau entier.\n\n**Ce qui s'est passé** – Les chercheurs de l'expérience CONUS+ ont observé la CEvNS avec des antineutrinos produits par un réacteur nucléaire. Ils ont recueilli des données entre novembre 2023 et juillet 2024 en utilisant des détecteurs de germanium avancés pour mesurer de très faibles signaux d'énergie causés par ces interactions rares.\n\n**Impact** – Il s'agit de l'une des premières observations directes de la CEvNS avec des antineutrinos de réacteur d'énergie inférieure à 10 MeV. Cela confirme une prédiction clé de la physique et ouvre de nouvelles voies pour étudier les propriétés des neutrinos avec des sources pratiques de réacteur. La stabilité et la sensibilité améliorées des détecteurs sont essentielles pour ces mesures précises.\n\n**Prochaine étape** – Les chercheurs prévoient d'affiner leurs mesures et d'explorer des applications comme la surveillance des réacteurs pour la sécurité et l'étude approfondie du comportement des neutrinos. Les progrès continus dans la technologie des détecteurs pourraient aussi permettre de nouvelles découvertes en physique des particules et domaines associés.\n\n**Résumé en une phrase** – L'expérience CONUS+ a observé avec succès la diffusion élastique cohérente d'antineutrinos de réacteur sur les noyaux atomiques, faisant progresser la science des neutrinos grâce à des mesures précises à basse énergie.",
      "personality_title_es": "Primera observación directa de antineutrinos interactuando con núcleos atómicos",
      "personality_presentation_es": "**Contexto** – Los neutrinos y antineutrinos son partículas muy pequeñas que rara vez interactúan con la materia, lo que dificulta su estudio. La dispersión elástica coherente de neutrinos sobre núcleos atómicos (CEvNS) es un efecto sutil predicho hace décadas, donde los neutrinos rebotan suavemente sobre núcleos enteros.\n\n**Qué pasó** – Investigadores del experimento CONUS+ observaron CEvNS con antineutrinos producidos en un reactor nuclear. Recopilaron datos entre noviembre de 2023 y julio de 2024 usando detectores avanzados de germanio para medir señales minúsculas de energía causadas por estas interacciones raras.\n\n**Impacto** – Esta es una de las primeras observaciones directas de CEvNS con antineutrinos de reactor de menos de 10 MeV. Confirma una predicción clave de la física y abre nuevas vías para estudiar las propiedades de los neutrinos con fuentes prácticas de reactor. La estabilidad y sensibilidad mejoradas de los detectores son fundamentales para mediciones precisas.\n\n**Próximo paso** – Los investigadores planean perfeccionar sus mediciones y explorar aplicaciones como el monitoreo de reactores para seguridad y un estudio más profundo del comportamiento de los neutrinos. Las mejoras continuas en tecnologías de detectores podrían permitir nuevos descubrimientos en física de partículas y campos relacionados.\n\n**Resumen en una frase** – El experimento CONUS+ ha observado con éxito la dispersión elástica coherente de antineutrinos de reactor sobre núcleos atómicos, avanzando en la ciencia de neutrinos con medidas precisas de baja energía.",
      "image_url": "public/images/news_image_Direct-observation-of-coherent-elastic-antineutrin.png",
      "image_prompt": "A detailed drawing of a trio of intricately designed crystal-like germanium detectors glowing softly inside a protective shield, surrounded by subtle, flowing waves of invisible antineutrino particles represented as gentle, shimmering streams weaving through the detectors, all rendered in warm, natural tones of soft blues, gentle greens, and earthy browns, evoking a serene and precise scientific environment without any human figures."
    },
    {
      "title": "Potato, tomahto: the roots of the modern tater",
      "summary": "Nature, Published online: 31 July 2025; doi:10.1038/d41586-025-02329-9A meet-cute millions of years ago gave rise to the tubers of today’s potatoes.",
      "content": "Thank you for visiting nature.com. You are using a browser version with limited support for CSS. To obtain the best experience, we recommend you use a more up to date browser (or turn off compatibility mode in Internet Explorer). In the meantime, to ensure continued support, we are displaying the site without styles and JavaScript.",
      "embedding": null,
      "url": "https://www.nature.com/articles/d41586-025-02329-9",
      "source": "Nature",
      "published": "2025-08-01",
      "sentiment_score": 0.65,
      "reasoning": "The article discusses the evolutionary origins of modern potatoes, which is a scientific insight that can inspire curiosity and appreciation for nature's complexity. While not directly about a breakthrough or a major achievement, it highlights an interesting aspect of natural history that can uplift and engage readers interested in science and nature.",
      "category": "Other",
      "personality_title": "Tracing the ancient roots of the modern potato",
      "personality_presentation": "**Context** – The potato is a staple food worldwide, but its evolutionary history extends back millions of years, shaping the tubers we know today.\n\n**What happened** – Recent scientific research has uncovered how an ancient interaction, described as a \"meet-cute\" between plant ancestors millions of years ago, led to the development and diversity of modern potato tubers.\n\n**Impact** – This insight deepens our understanding of plant evolution and the natural processes behind a key food source. It highlights how long-term natural relationships can influence crops essential to human diets.\n\n**What's next step** – Researchers may use this evolutionary knowledge to explore potato genetics further, potentially guiding breeding programs and improving crop resilience.\n\n**One-sentence takeaway** – Scientists have traced how ancient plant interactions millions of years ago gave rise to the potatoes we rely on today.",
      "personality_title_fr": "À la découverte des origines anciennes de la pomme de terre moderne",
      "personality_presentation_fr": "**Contexte** – La pomme de terre est un aliment de base dans le monde entier, mais son histoire évolutive remonte à des millions d’années, façonnant les tubercules que nous connaissons aujourd’hui.\n\n**Ce qui s’est passé** – Des recherches scientifiques récentes ont révélé comment une interaction ancienne, qualifiée de « rencontre fortuite » entre des ancêtres végétaux il y a des millions d’années, a conduit au développement et à la diversité des tubercules modernes de pomme de terre.\n\n**Impact** – Cette découverte approfondit notre compréhension de l’évolution des plantes et des processus naturels derrière une source alimentaire clé. Elle montre comment des relations naturelles de longue durée peuvent influencer des cultures essentielles à l’alimentation humaine.\n\n**Étape suivante** – Les chercheurs pourraient utiliser ces connaissances évolutives pour explorer davantage la génétique de la pomme de terre, en orientant potentiellement les programmes de sélection et en améliorant la résistance des cultures.\n\n**Résumé en une phrase** – Les scientifiques ont retracé comment des interactions végétales anciennes, survenues il y a des millions d’années, ont donné naissance aux pommes de terre que nous consommons aujourd’hui.",
      "personality_title_es": "Rastreando los orígenes antiguos de la papa moderna",
      "personality_presentation_es": "**Contexto** – La papa es un alimento básico en todo el mundo, pero su historia evolutiva se remonta a millones de años, dando forma a los tubérculos que conocemos hoy.\n\n**Qué pasó** – Investigaciones científicas recientes han descubierto cómo una antigua interacción, descrita como un \"encuentro fortuito\" entre ancestros vegetales hace millones de años, llevó al desarrollo y diversidad de los tubérculos modernos de papa.\n\n**Impacto** – Este hallazgo profundiza nuestra comprensión de la evolución vegetal y los procesos naturales detrás de una fuente alimenticia clave. Destaca cómo las relaciones naturales a largo plazo pueden influir en cultivos esenciales para la dieta humana.\n\n**Próximo paso** – Los investigadores podrían usar este conocimiento evolutivo para explorar más la genética de la papa, posiblemente guiando programas de cultivo y mejorando la resiliencia del cultivo.\n\n**Resumen en una frase** – Los científicos han rastreado cómo interacciones vegetales antiguas hace millones de años dieron origen a las papas que consumimos hoy.",
      "image_url": "public/images/news_image_Potato-tomahto-the-roots-of-the-modern-tater.png",
      "image_prompt": "A warm, detailed painting of intertwined potato and tomato plants with their roots visibly merging underground, surrounded by soft earth tones and natural greens, symbolizing their shared botanical heritage and the origins of the modern potato."
    },
    {
      "title": "Intricate origins of ice mummy’s ink revealed",
      "summary": "Nature, Published online: 31 July 2025; doi:10.1038/d41586-025-02327-xImaging suggests that more than one tattooist applied pigment to the hands and forearms of a woman who lived more than two millennia ago.",
      "content": "Thank you for visiting nature.com. You are using a browser version with limited support for CSS. To obtain the best experience, we recommend you use a more up to date browser (or turn off compatibility mode in Internet Explorer). In the meantime, to ensure continued support, we are displaying the site without styles and JavaScript.",
      "embedding": null,
      "url": "https://www.nature.com/articles/d41586-025-02327-x",
      "source": "Nature",
      "published": "2025-08-01",
      "sentiment_score": 0.65,
      "reasoning": "The article reveals scientific insights into ancient tattooing practices, showcasing human history and cultural heritage. While not directly about acts of kindness or breakthroughs with immediate practical benefits, it is a positive story about human creativity and historical understanding that can inspire curiosity and appreciation for our shared past.",
      "category": "Other",
      "personality_title": "Study reveals multiple artists behind ancient ice mummy’s tattoos",
      "personality_presentation": "**Context** – A woman who lived over 2,000 years ago was found preserved in ice, with visible tattoos on her hands and forearms. These tattoos provide a rare glimpse into ancient body art practices.\n\n**What happened** – Researchers used imaging technology to analyze the tattoos on the ice mummy. Their findings suggest that more than one tattoo artist applied the ink, indicating collaboration or multiple sessions of tattooing.\n\n**Impact** – This discovery sheds new light on cultural practices from more than two millennia ago, revealing that tattooing was a complex process possibly involving several specialists. It challenges previous assumptions that ancient tattoos were done by a single person and offers a deeper understanding of social or artistic traditions of the time.\n\n**What’s next step** – Scientists plan to study other ancient mummies and artifacts to see if this multi-artist tattooing pattern appears elsewhere. Further research might also explore the tools and inks used to better understand the techniques and meanings behind these tattoos.\n\n**One-sentence takeaway** – Advanced imaging shows that an ancient ice mummy’s tattoos were applied by multiple artists, revealing complexity in early tattooing traditions.",
      "personality_title_fr": "Une étude révèle plusieurs artistes derrière les tatouages d’une momie de glace ancienne",
      "personality_presentation_fr": "**Contexte** – Une femme ayant vécu il y a plus de 2 000 ans a été retrouvée conservée dans la glace, avec des tatouages visibles sur les mains et les avant-bras. Ces tatouages offrent un aperçu rare des pratiques anciennes du tatouage.\n\n**Ce qui s’est passé** – Des chercheurs ont utilisé la technologie d’imagerie pour analyser les tatouages de la momie de glace. Leurs résultats suggèrent que plus d’un artiste tatoueur a appliqué l’encre, indiquant une collaboration ou plusieurs séances de tatouage.\n\n**Impact** – Cette découverte apporte un nouvel éclairage sur les pratiques culturelles il y a plus de deux millénaires, révélant que le tatouage était un processus complexe impliquant probablement plusieurs spécialistes. Elle remet en question l’idée que les tatouages anciens étaient réalisés par une seule personne et offre une meilleure compréhension des traditions sociales ou artistiques de l’époque.\n\n**Prochaine étape** – Les scientifiques prévoient d’étudier d’autres momies anciennes et artefacts pour vérifier si ce modèle de tatouage réalisé par plusieurs artistes se retrouve ailleurs. Des recherches supplémentaires pourraient aussi explorer les outils et encres utilisés afin de mieux comprendre les techniques et les significations de ces tatouages.\n\n**Résumé en une phrase** – Une imagerie avancée révèle que les tatouages d’une ancienne momie de glace ont été réalisés par plusieurs artistes, montrant la complexité des traditions anciennes du tatouage.",
      "personality_title_es": "Estudio revela que varios artistas realizaron los tatuajes de una momia de hielo antigua",
      "personality_presentation_es": "**Contexto** – Se encontró a una mujer que vivió hace más de 2,000 años conservada en hielo, con tatuajes visibles en las manos y los antebrazos. Estos tatuajes ofrecen una rara mirada a las prácticas antiguas del arte corporal.\n\n**Qué pasó** – Investigadores utilizaron tecnología de imágenes para analizar los tatuajes de la momia de hielo. Sus hallazgos sugieren que más de un artista tatuador aplicó la tinta, lo que indica colaboración o múltiples sesiones de tatuaje.\n\n**Impacto** – Este descubrimiento arroja nueva luz sobre las prácticas culturales de hace más de dos milenios, revelando que tatuar era un proceso complejo que posiblemente involucraba a varios especialistas. Desafía la suposición previa de que los tatuajes antiguos eran hechos por una sola persona y ofrece una comprensión más profunda de las tradiciones sociales o artísticas de la época.\n\n**Próximo paso** – Los científicos planean estudiar otras momias antiguas y artefactos para ver si este patrón de tatuajes realizados por varios artistas aparece en otros casos. Más investigaciones también podrían explorar las herramientas y tintas utilizadas para entender mejor las técnicas y significados detrás de estos tatuajes.\n\n**Conclusión en una frase** – Imágenes avanzadas muestran que los tatuajes de una antigua momia de hielo fueron realizados por varios artistas, revelando la complejidad de las tradiciones tempranas del tatuaje.",
      "image_url": "public/images/news_image_Intricate-origins-of-ice-mummys-ink-revealed.png",
      "image_prompt": "A softly glowing ancient quill made from an eagle feather dips into a pool of shimmering ink formed from frozen mountain ice, surrounded by delicate frost crystals and swirling wisps of mist, all rendered in warm earth tones and muted blues in a detailed, painterly style."
    },
    {
      "title": "Mystery of the potato's origins solved by genetics",
      "summary": "Around 8 million years ago, an ancestor of modern tomatoes in South America hydridised with a plant called Etuberosum, and this reshuffling of genes gave rise to the potato",
      "content": "Around 8 million years ago, an ancestor of modern tomatoes in South America hydridised with a plant called Etuberosum, and this reshuffling of genes gave rise to the potato\n\nPotato tubers are the result of an ancient hybridisation event Jackie Bale/Getty Images\n\nThe humble potato, it turns out, is the product of a tryst between an ancient tomato plant and a lesser-known South American lineage named Etuberosum.\n\nEtuberosum plants are often described as looking like a potato plant, except for one crucial difference – they don’t produce the starch-rich tubers that have made cultivated potatoes one of the world’s most important food staples.\n\nAdvertisement\n\nSandra Knapp at the Natural History Museum in London and her colleagues studied the genetics of three groups of plants in the genus Solanum: Petota, with 107 species including cultivated potatoes (Solanum tuberosum); the tomato group, with 17 species; and Etuberosum, with three species. The three lineages shared a common ancestor around 14 million years ago.\n\nThe team looked at 450 genomes from cultivated potatoes and 56 wild potato species and found there was, in every one of them, a steady mix of tomato and Etuberosum genes.\n\nThe results suggest that the potato lineage stems from a hybridisation event between the ancestors of the tomato and Etuberosum groups, probably around 8 million years ago in what is now Chile.\n\nFree newsletter Sign up to The Earth Edition Unmissable news about our planet, delivered straight to your inbox each month. Sign up to newsletter\n\nKnapp says the hybridisation event allowed for new gene combinations to occur, creating innovations like the growth of tubers. “This event led to a reshuffling of genes such that the new lineage produced tubers, allowing these plants to expand into the newly created cold, dry habitats in the rising Andes,” she says.\n\nThis shows that hybridisation is a “powerful force in the evolution of diversity”, says Knapp.\n\n“Actually the parts of the tomato and potato we eat look different but the plants themselves are quite similar,” she says. “If you by luck get a potato plant that produces fruit, it’s a green, tomato-like berry – but don’t eat it, it tastes terrible.”\n\nBrett Summerell at the Botanic Gardens of Sydney, Australia, who wasn’t involved in the study, says the new work provides comprehensive evidence of hybridisation and subsequent species radiation – something that has been lacking for this group of plant relatives.\n\n“The study also highlights the importance of protecting wild crop relative species in order to better understand how important crops have evolved and are likely to adapt to challenges in the future,” says Summerell.\n\n“Many of the relatives of species like potatoes are threatened with habitat destruction and the impact of climate change.”",
      "embedding": null,
      "url": "https://www.newscientist.com/article/2490403-mystery-of-the-potatos-origins-solved-by-genetics/?utm_campaign=RSS%7CNSNS&utm_source=NSNS&utm_medium=RSS&utm_content=home",
      "source": "New Scientist - Home",
      "published": "2025-07-31",
      "sentiment_score": 0.65,
      "reasoning": "The article reveals a scientific breakthrough in understanding the genetic origins of the potato, which is a staple food worldwide. This knowledge can inspire curiosity and appreciation for biodiversity and plant genetics, contributing to agricultural science.",
      "category": "Other",
      "personality_title": "Genetic study reveals how ancient hybrid created the potato",
      "personality_presentation": "**Context** – The potato is one of the world’s most important food crops, but its origins have long been unclear. It belongs to the Solanum genus, which also includes tomatoes and other related plants.\n\n**What happened** – Scientists analyzed genomes from cultivated and wild potatoes, tomatoes, and a lesser-known plant group called Etuberosum. They discovered that around 8 million years ago, an ancestor of modern tomatoes hybridized with Etuberosum, creating a new lineage that eventually became the potato.\n\n**Impact** – This hybridization produced new gene combinations that allowed potatoes to develop tubers, the starchy underground parts we eat. It also helped these plants adapt to cold, dry environments in the Andes. The finding highlights how hybridization drives plant evolution and diversity.\n\n**What's next step** – Researchers can use this genetic insight to better understand potato biology and potentially improve cultivation. It may also inspire further study of hybridization’s role in crop development and biodiversity.\n\n**One-sentence takeaway** – The potato originated from an ancient hybrid between tomato ancestors and Etuberosum plants, leading to the tuber-producing crop we rely on today.",
      "personality_title_fr": "Une étude génétique révèle comment un ancien hybride a créé la pomme de terre",
      "personality_presentation_fr": "**Contexte** – La pomme de terre est l’une des cultures alimentaires les plus importantes au monde, mais ses origines sont longtemps restées mystérieuses. Elle appartient au genre Solanum, qui comprend aussi les tomates et d’autres plantes apparentées.\n\n**Ce qui s’est passé** – Des scientifiques ont analysé les génomes de pommes de terre cultivées et sauvages, de tomates et d’un groupe de plantes moins connu appelé Etuberosum. Ils ont découvert qu’il y a environ 8 millions d’années, un ancêtre des tomates modernes s’est hybridé avec Etuberosum, créant une nouvelle lignée qui a donné naissance à la pomme de terre.\n\n**Impact** – Cette hybridation a produit de nouvelles combinaisons de gènes permettant aux pommes de terre de développer des tubercules, les parties souterraines riches en amidon que nous consommons. Elle a aussi aidé ces plantes à s’adapter aux environnements froids et secs des Andes. Cette découverte montre comment l’hybridation stimule l’évolution et la diversité des plantes.\n\n**Prochaine étape** – Les chercheurs peuvent utiliser ces connaissances génétiques pour mieux comprendre la biologie de la pomme de terre et améliorer sa culture. Cela pourrait aussi encourager des études supplémentaires sur le rôle de l’hybridation dans le développement des cultures et la biodiversité.\n\n**Conclusion en une phrase** – La pomme de terre est issue d’un ancien hybride entre des ancêtres de la tomate et des plantes Etuberosum, donnant naissance à la culture tuberculeuse que nous utilisons aujourd’hui.",
      "personality_title_es": "Un estudio genético revela cómo un antiguo híbrido creó la papa",
      "personality_presentation_es": "**Contexto** – La papa es uno de los cultivos alimentarios más importantes del mundo, pero sus orígenes han sido un misterio durante mucho tiempo. Pertenece al género Solanum, que también incluye tomates y otras plantas relacionadas.\n\n**Qué ocurrió** – Científicos analizaron los genomas de papas cultivadas y silvestres, tomates y un grupo de plantas poco conocido llamado Etuberosum. Descubrieron que hace unos 8 millones de años, un ancestro de los tomates modernos se hibridó con Etuberosum, creando una nueva línea que se convirtió en la papa.\n\n**Impacto** – Esta hibridación produjo nuevas combinaciones genéticas que permitieron a las papas desarrollar tubérculos, las partes subterráneas ricas en almidón que consumimos. También ayudó a estas plantas a adaptarse a ambientes fríos y secos en los Andes. El hallazgo muestra cómo la hibridación impulsa la evolución y diversidad vegetal.\n\n**Próximo paso** – Los investigadores podrán usar esta información genética para entender mejor la biología de la papa y mejorar su cultivo. También podría motivar estudios adicionales sobre el papel de la hibridación en el desarrollo de cultivos y la biodiversidad.\n\n**Resumen en una frase** – La papa se originó a partir de un antiguo híbrido entre ancestros del tomate y plantas Etuberosum, dando lugar al cultivo tuberculoso que conocemos hoy.",
      "image_url": "public/images/news_image_Mystery-of-the-potatos-origins-solved-by-genetics.png",
      "image_prompt": "A warm, detailed painting of two intertwined plant stems—one with small green tomato-like berries and the other resembling a potato plant—with roots merging underground into glowing, golden potato tubers, set against a softly lit Andean mountain landscape in natural earthy tones."
    }
  ]
}