{
  "personality": null,
  "timestamp": "2025-09-26T04:40:08.787265",
  "category": "Other",
  "news_summary": "Today's positive news highlights practical strategies for balancing unexpected life challenges with scientific careers and enjoying a fulfilling family digital detox.",
  "news_summary_fr": "Les nouvelles positives d'aujourd'hui mettent en lumière des stratégies pratiques permettant de concilier les défis inattendus de la vie avec une carrière scientifique et de profiter d'une désintoxication numérique familiale épanouissante.",
  "news_summary_es": "Las noticias positivas de hoy destacan estrategias prácticas para equilibrar los retos inesperados de la vida con carreras científicas y disfrutar de una desintoxicación digital familiar satisfactoria.",
  "articles": [
    {
      "title": "When life gets in the way of your meticulously-planned career in science",
      "summary": "Nature, Published online: 25 September 2025; doi:10.1038/d41586-025-02897-wJulie Gould asks two mid-career researchers to reflect on how closely their professional paths have followed their original goals and ambitions.",
      "content": "Julie Gould 00:09\n\nHello, and welcome to Working Scientist, a Nature Careers podcast. I’m Julie Gould. This is the third episode of the career planning series, supported by the International Science Council.\n\nJulie Gould 00:28\n\nThere are many different ways to approach career planning, and one of them is to create a plan and follow it.\n\nDecide where you’d like to be in two, five, ten years’ time, create some smart (SMART) goals, (which, we learned in episode two, are goals that are specific, measurable, action oriented, realistic and time bound), and then follow the steps to getting there.\n\nPeople sometimes follow plans like this with laser focus, often because they’re driven by a clear passion. And staying on a fixed, focused path helps them build expertise and credibility.\n\nIn competitive fields like science, focus also increases chances of securing funding, recognition and career milestones. And for some it simply matches their personality, thriving on structure, consistency and steady progress.\n\nIn this episode, we’ll hear career stories from two people who have had this focus. They have known from early in their careers where they wanted to end up, and we’ll hear how they did it.\n\nAnd as with the other episodes in this series, at the end we have a sponsored slot from the International Science Council, with the support of the China Association for Science and Technology.\n\nThe ISC is exploring how early and mid-career researchers can navigate their careers in a constantly evolving scientific landscape through conversations with emerging and established scientists.\n\nJulie Gould 01:51\n\nThe first person we’ll hear from is Professor Sam Smith, a behavioral oncologist at the University of Leeds in the UK.\n\nI spoke to Sam to find out more about how he followed his passion with a drive and determination similar to what I’ve seen in athletes. To push themselves to the limit, to see how far they’ll go.\n\nHe discovered his passion in the final year of his undergraduate degree in psychology, when he was offered an opportunity to understand how someone is feeling in the context of cancer,\n\nSam Smith 02:18\n\nIt seemed the logical thing to do, to try and push myself towards. I’ve been given this opportunity to work in an amazing research group with an amazing team. And I wanted to make the most of that opportunity, and I still do to see how far I can, I can go and push myself.\n\nJulie Gould 02:39\n\nWhen you have that kind of drive to want to do that, I imagine you then start putting goals in place, or stepping stones?\n\nYou like, look ahead to the future a little bit, and you start thinking: Okay, well, if that is where I want to be, I’ve gotta focus my energies on making sure that I achieve that goal.\n\nDid you have that mentality? Did you think about that in that way? And did you start setting those kinds of goals.\n\nSam Smith 03:01\n\nI never set goals around job titles. I set ambitions around applying for certain funding streams. I had an ambition that I wanted to go and work in the States.\n\nI’d always wanted to study in in the States as a child. ANd it didn’t kind of work out at a university level, but I was able to secure a postdoc position in the States.\n\nSo that was always a long-held ambition.\n\nI wanted to apply to do my own research. I had my own ideas about things that I wanted to investigate, so I set ambitions to apply for an early postdoc award, at which point I knew that there were opportunities to apply for mid-career awards and more senior awards as well.\n\nSo it wasn’t with a view to: If I do this, I would become a professor.\n\nIt was about: If I do this, then I would win funding that would enable me to do some cool science, do something interesting, solve a problem with regard to cancer prevention or cancer control.\n\nSo although I said: I want to become a professor. I want it, I didn’t really take actions to try and achieve that. It was more about those, the actions that I did take led me down the pathway of becoming a professor.\n\nJulie Gould 04:24\n\nAs Sam got older, however, his ambitions changed slightly. He started a family, which meant...\n\nSam Smith 04:30\n\n...things around career ambition became more important.\n\nSo titles equal a higher salary, obviously.\n\nAnd I I did apply for promotions around when my first child was born, and when my second child was born.\n\nBut there was an ambition there to, at some point, achieve those, those goals of job titles, of associate professor and professor.\n\nJulie Gould 04:55\n\nHow important is it to have a strategy in place in order to achieve and plan for that goal?\n\nSam Smith 05:03\n\nI appear from the outside, and I probably am, very strategically focused. I have a plan for lots of things around my career and around my research group. That doesn’t mean to say that there isn’t flexibility there.\n\nAnd I think that’s the the kind of nuance that I kind of, I sometimes struggle to convey.\n\nSo I have ambitions to apply for a particular funding stream.\n\nBut if that doesn’t come off, then that’s fine. You know, like, there are alternative routes around that. But it’s, it’s the work that I’d like to get done, the research and the topic that I’m kind of interested in, rather than the award of that particular fellowship, or whatever.\n\nSo yes, I do have a strategy, and I think things through logically. I think as I’ve got more senior in my role, it becomes cliche, but the ability to say no to stuff is becomes much more important, and sometimes it’s saying no to yourself as well.\n\nSo if an opportunity arises, I have to kind of have some sort of structure around my career to say: Is this something that I really want to take on? Just because it seems interesting for the next half an hour? That’s going to derail everything that I’m interested in for the next five years?\n\nJulie Gould 06:36\n\nBut for Sam, a plan is not going to work unless you’ve got a support system in place to help you navigate it.\n\nSam Smith 06:42\n\nYou can plan as much as you want, unless you’re giving that support, that kind of sponsorship along the way, it’s really difficult to get through an academic part.\n\nIt’s so challenging, and it’s even more challenging now than it has been before.\n\nJulie Gould 06:59\n\nAnd do you think that because it’s now so much harder and than it ever has been for as you just said.\n\nDo you think that having some kind of strategy and some kind of focus career plan in place is more important than ever?\n\nSam Smith 07:15\n\nI think if you know that you want to go down the academic path or at least give yourself a fighting chance of getting an academic position, whether that be post-PhD or mid-career, etc, a strategy is always going to help. I guess.\n\nWhat I’m trying to convey is that even with the best strategy, the environment is such at the moment that it can be difficult for even the strongest people to succeed in academia.\n\nAnd what I don’t want to convey is that that there shouldn’t be this binary around, Oh, you succeeded in the academic path. Oh, you succeeded in an industry path, or whatever it is that you pursued.\n\nAll of those should be counted equally as successes. And so again, it comes back to this, I guess, flexibility discussion around if, if you want to go down an academic path, then, of course, yeah, great, and go for it.\n\nBut I would advise, even within that, a kind of career strategy around that, that you do things that will strengthen your case for moving into a different role that was perhaps outside of academia in the future.\n\nAnd that’s something that I don’t think that I did particularly well as an early career researcher. But certainly something that I’m trying to instill within my colleagues here in Leeds.\n\nJulie Gould 08:38\n\nSometimes people know exactly what career they want from an early age, and they can put goals and steps in place to make sure they get there.\n\nThis is how our second career story starts. Milicia Radisic is now a professor of applied science and engineering at the University of Toronto in Canada. But she started in Serbia, where access to resources was challenging.\n\nMilicia Radisic 08:58\n\nI knew pretty early, I would say very young, you know, maybe even in high school, that I wanted to have a scientific career, right?\n\nI was really excited about mysteries and wonders of the natural world. I just didn’t know exactly what that meant or how I could do it, right? So, I had to leave my country.\n\nJulie Gould 09:16\n\nYou left your home country. Was that out of choice, or was that out of necessity? Can you tell me a little bit where you came from and why you moved?\n\nMilicia Radisic 09:26\n\nYeah, so it was definitely out of choice. I had to leave Serbia in the 90s, because back then, it was a very difficult time.\n\nIn Serbia it was really difficult not just to get journals, like journal papers, even to get books. You know, people who don’t remember the pre-internet time, we had to read papers in hard copy journals.\n\nSo you have got to have a subscription.\n\nAnd if your country is under an embargo, not only is it not getting journals, but not getting food, you know.\n\nSo that was, that’s something that we have to think about also how, you know, in everything that’s happening in the world, how a regular person gets affected by, you know, politics, that’s about them.\n\nAnd and so, yeah, I had to leave even if I wanted that knowledge, the current knowledge, and to read papers and to get the best textbooks and to have access to the latest equipment I had to leave Serbia because we were not able to get that in the 90s.\n\nAnd then I came to Canada, to McMaster, to do my undergrad, and it was really wonderful.\n\nAnd Canada is a really wonderful, welcoming country, and McMaster really enabled me to grow as as a student,\n\nJulie Gould 10:58\n\nBecause Milicia knew and understood how scarcity could impact her life, she was determined to work in places and with people that would help her succeed in her dream to becoming a successful scientist.\n\nAnd after spending time at McMaster in Canada, Milicia took on a position in Robert Langer’s laboratory at MIT in the USA.\n\nAnd both these decisions were incredibly strategic for her. Milicia likened her, or any career path, to a large cargo ship sailing across an ocean.\n\nMilicia Radisic 11:25\n\nIf you just let the ship sail, it’s gonna end up somewhere else.\n\nYou gotta make sure you navigate properly, but keep in mind that it’s really hard to make that turn.\n\nSo it’s very, turning in a huge ship it’s really slow. So you gotta like, always keep that eye on the target.\n\nJulie Gould 11:43\n\nOne way to keep your eye on the target and to help you get there is to make sure you have a vision, a big picture view of your research and how it fits in with the wider research environment.\n\nAnd this is something Milicia has spent a lot of time thinking about.\n\nMilicia Radisic 11:56\n\nHow am I going to develop my vision as a scientist? This is something that you cannot cram.\n\nYou cannot be like, Oh, I’m going to work on it for two weeks in January, and then it’s going to be done.\n\nThis is something that really requires a lot of thinking, a lot of reading, going to conferences, talking to other scientists. Really, seeing where is that gap of knowledge, and how can my skill set push that boundary further?\n\nAnd that’s what we do all the time in writing proposals, right? And winning the money. You’re always thinking about kind of, what’s that next gap?\n\nAnd that is really deep thinking that requires a lot of time. And as I said previously, you won’t be able to do that 9-5 at your desk. It’s not that kind of job. This is something that, and you know, thinking about that kind of percolating those ideas, that strategy is always, always in your head.\n\nJulie Gould 12:48\n\nToday, as a supervisor, Milicia tries to encourage her team to make sure their ships are sailing in the right direction and are easy to manoeuvre.\n\nAnd one of the ways she helps her researchers is by making sure she works on a publication strategy with them.\n\nMilicia Radisic 13:01\n\nHow am I going to go about what makes sense to publish, when and how, right?\n\nSo that you can have on your CV that track record of, both, you know, you really have some high impact, transformative papers, and you also have papers that are worth publishing, but they may not be in Nature, right? So that way you will show your productivity.\n\nWhoever is your PhD or postdoc supervisor, they can strategize with you about the publication plan, right?\n\nI usually try to put my people on both kind of lower risk and higher risk projects, because you don’t know if the higher risk project will work out.\n\nSo I want to make sure they have something. And that’s where you’re really your supervisor can help. And working in teams, so you also can contribute to many different publications is very important.\n\nAnd when we were assistant professors at the University of Toronto, we would start, we will have these like workshops, just like, How do you succeed as an assistant professor?. There was this one point that was made by Scott neighbor, and he said, quality is important, but never underestimate the importance of quantity, right?\n\nSo you don’t want to put all of your eggs into one basket, and if that Nature paper doesn’t work out, you have nothing, right?\n\nSo you gotta, like, have your project, your question that you’re working on, and then think about what makes sense to publish, when and how, right?\n\nSo that you can have on your CV that track record of both you know, you really have some high impact, transformative papers. And you also have papers that a worthy publishing but they may not be in nature, right?\n\nJulie Gould 14:44\n\nBut how do you make sure you’ve got all the papers ready for when it comes to applying for tenure, for example?\n\nLike Milica said before, don’t put all your eggs in one basket\n\nMilicia Radisic 14:55\n\nWhen you’re an assistant professor. If you do that and you take your three students that you have and you put them all on working on he Science paper or Nature paper, you may end up with literally nothing because you don’t have that big infrastructure that your professor had was established.\n\nAnd just being able to put all of those resources and people in, and the time it takes to do that, you literally may have nothing.\n\nAnd to get tenure, you need to attach five papers to dossier, usually five papers. So you really have to be strategic, like I have these students. These are my projects. These are my questions. I’m going to parse it out, and I’m going to this smaller question answer in this paper. I’m going to submit it to this journal that I know is fast in reviewing papers.\n\nSo you really have to think about your big vision, your big project, that you only have a few trainees, and how you’re going to parse that out so that you get publications that you can attach to your tenure package.\n\nAnd these publications shouldn’t Look like random collection of papers. They should all present a coherent vision. So you really have to think deeply about how to break that out,\n\nJulie Gould 16:06\n\nAs we heard from Sam Smith earlier in this episode, knowing when to say no is important when it comes to thinking about what you can spend your time on.\n\nMilicia Radisic 16:14\n\nSo then you’re keeping your eye on that prize, like: How do I get tenure, right? And the best thing you got to ask people, this is all prescribed, right?\n\nThe beauty of getting tenure is that you should know exactly what you need to do to get tenure. If you don’t know, then your department is doing something wrong.\n\nIt’s not you, it’s your department is literally not doing their job.\n\nSo because this is all prescribed in guidelines, it’s all written, and your department chair is supposed to be able to communicate to you how, what do you need to achieve to get that.\n\nAnd so it’s very clear, right?\n\nYou need some papers. You need to have your own grants. So you’re just focusing on that exclusively. In my mind, that’s like, the best strategy. Don’t get diluted, and don’t be like, Oh, I’m going to start a company.\n\nDon’t start a company then You can start a company after you get tenure, and so, or if you’re just thinking, oh, There is time I’m going to do that next year, and then you may not get tenure. You gotta do it now.\n\nJulie Gould 17:25\n\nSam and Milicia are both very focused academics with clear paths, plans and strategies. But this kind of strategizing doesn’t suit everyone.\n\nSome people prefer to roll with the punches, go with the flow, see what life throws at them, and take opportunities as they come.\n\nAnd this is what we’ll hear about in the fourth episode of this series on career planning.\n\nBut before you go, here’s our sponsored slot from the International Science Council on career development for early and mid career researchers in an ever-evolving scientific landscape.\n\nThanks for listening. I’m Julie Gould.\n\nIzzie Clarke 18:12\n\nHello and welcome. I’m science journalist Izzie Clarke and in this podcast presented in partnership with the International Science Council, with the support of the China Association for Science and Technology, we’ll be discussing the power of the digital aid and artificial intelligence known as AI, its importance to careers in science, as well as its potential threat to the scientific enterprise.\n\nToday, I’m joined by Mercè Crosas, Director of Computational Social Science and Humanities at the Barcelona Supercomputing Center and President of the Committee on Data of the International Science Council, known as CODATA.\n\nMercè Crosas 18:52\n\nHello.\n\nIzzie Clarke 18:53\n\nAnd Mohammad Hosseini, Assistant Professor of Ethics at Northwestern University in Chicago, and member of the Global Young Academy.\n\nMohammad Hosseini 19:01\n\nHi, how are you?\n\nIzzie Clarke 19:03\n\nVery well, thank you. I think a question to both of you, to start things off, is why is now a critical moment to reflect on how digitalization and AI are shaping scientific careers?\n\nMohammad Hosseini 19:16\n\nI think we are seeing more and more data-driven decision-making by researchers, which sometimes also trickles down to national or local decision-making, which is good, but in terms of scientific careers, this means that we need to train researchers in new skills.\n\nAnd this has always been the case. But because of the tipping point, things are moving so fast that we can hardly catch up. Machines are becoming so capable that they can displace or replace human workforce in science. We are now in a sort of critical moment to discuss digitalization and explore who benefits from these technologies, who may be left behind and how we can ensure transparency and equity in their use.\n\nIzzie Clarke 20:03\n\nMercè, what are your thoughts?\n\nMercè Crosas 20:06\n\nOne of the things first is that AI also has been used in science already for quite a long time, and the change has been happening progressively. It is true that now there is an exponential use of AI used as for methods in a lot of the scientific production.\n\nSo, from the exploration of the literature review to trying to figure out the research question, to data processing and data collection, and then the analysis itself, but also then the publication of the scientific results. I mean, I guess that tipping point that Mohammad was talking about, it has a much broader impact than ever before.\n\nIzzie Clarke 20:43\n\nThere’s a lot of things to consider here. You mentioned publication there and we will get onto that in a moment. But in terms of opportunities, what are the opportunities that you see emerging from this for early- and mid-career researchers and how that is changing that AI-driven scientific landscape?\n\nMohammad Hosseini 21:07\n\nI guess opportunities are mostly around making new discoveries and doing things that would be even a dream five years ago. Any area that could benefit from modelling, we are moving much faster now. This is an opportunity, especially for early- and mid-career researchers who may be more adept in using AI, but it comes with certain trade-offs. Finding opportunity in this new dynamic requires a new kind of curiosity that we are not trained in. But I think we should try to find tasks in research contexts that cannot be automated and try to excel in such tasks.\n\nFor example, my area of research, I’m an ethics researcher. Writing a well-argued paper is already automated. But mentoring, teaching an in-person class, which is also interactive and engaging, or conducting interviews to collect data and get new insights from people’s lived experiences — these are tasks that cannot be easily automated. And I think we need to find these group of tasks in our own research context and try to excel in that.\n\nIzzie Clarke 22:15\n\nAnd Mercè?\n\nMercè Crosas 22:49\n\nI don’t see much the risk of scientists or early-career scientists, mid-career scientists, to be substituted. What I see is opportunities to new research questions that a lot of scientists from previous generations couldn’t even think of asking, right? So, no, it’s not so much just that, well, now we can apply these tools, but that we can think about some fields in a whole different way. In biomedicine, in climate change, in physics and biology for genetics, that can change with the use of AI and new types of data.\n\nIzzie Clarke 23:08\n\nI think we are seeing that there are a lot of different ways that we can turn to AI and tackle different tasks, and we’ve talked about re-skilling. So, what do you think early- and mid-career researchers in the scientific fields need to be mindful of, and where can they get support?\n\nMercè Crosas 23:43\n\nIt’s more important than ever to be very rigorous in science and to understand that, at the end, whether we use AI or we use other tools, science is what we do, and science is inference and science has to be public. The methods, the data and the way we do it has to be verified by others.\n\nIt means that, again, we don’t just use the AI tools to give us answers, but we need to become more specialists in how we validate those answers. And for that, we need to still be more prepared about the theory of the fields where that we do research and the rigorosity of the outputs.\n\nIzzie Clarke: 23:49\n\nYeah, I mean, Mohammad, I’d love your thoughts on this as well because I know that this is something that you pay a lot of attention to.\n\nMohammad Hosseini: 25:05\n\nYeah, absolutely. And I also want to go back to what Mercè said here. Yes, it is important to think about theory, and at the same time, there’s a lot of people who now argue that because of this rise of data-driven science, we are seeing the end of social theory. Theory is not really as important because people can just collect data and do data mining to see what is relevant without even having had a hypothesis prior to their data collection.\n\nAnd I think that’s a remarkable development that requires a lot of careful consideration and attention. I think one of the challenges I also want to highlight is the fact that we have access to different resources, depending on location. We also have disparities in terms of what institutions provide. I have the privilege to be based in an affluent private university in the US that offers free access to various AI models, but this is not the case for millions of other researchers.\n\nAnd this disparity puts many other people in a disadvantaged position. Many universities don’t even have a general policy for the use of AI models. If I was in such university, I would really try to speak with the university administration or library to ask them to provide guidance and training.\n\nMercè Crosas: 25:46\n\nTo follow up on the danger of becoming too data-driven. I don’t accept that that’s the way that we need to go, right? The results is the intersection between the theoretical model and this data-driven approach. But in terms of using generative AI or new types of AI tools, I think that Europe has pretty different approach than other places.\n\nAnd there is now undergoing the development of a new strategy of AI in science and science for AI. We need to be careful about what kind of AI tools we use, whether they have clear definition of what data has been used, whether they are open source, whether they focus on trustworthy AI, and I think that’s very important.\n\nIzzie Clarke: 26:04\n\nI wanted to pick on something there as well. We talk about how we are using AI in work and publishing, as well. So Mohammad, what are the things that you think early- and mid-career researchers should be mindful of when it comes to publishing and the use of AI?\n\nMohammad Hosseini: 27:14\n\nYeah, I think one of the things that we should be really mindful of is what is the task that we are offloading to AI? What is the task we are asking AI to do? When this AI boom began, AI was mostly being used at the end of your research process, like at the point of copy-editing and improving readability and so on.\n\nBut now we are offloading these important tasks to AI, and next time when you want to think about your next research question, instead of thinking deeper about the textbooks you read or the new articles you read, you’re like, ah, let me ask what AI has to say about it. It becomes very addictive, and I would encourage researchers to be aware of the tasks that they are delegating and ask themselves, is it worth it?\n\nMy suggestion is don’t just publish something for the sake of publishing something unless you have something really important to say. Think about who are you citing. If you’re using AI to find literature, make sure that you read the content that you are citing, because many times these citations are irrelevant.\n\nIzzie Clarke: 27:39\n\nAnd I think that’s a good point. Yes, there are ways that we can use AI that might be helpful in some points, but keep some of those skills active and to make sure that you are doing due diligence in other ways, as well.\n\nAnd I think that probably brings us onto a discussion on credibility. So, within your field and to the wider public, what does it take to maintain credibility in this digital age? Mercè?\n\nMercè Crosas 28:16\n\nWell, I think it’s very easy. I mean, you had credibility when you can communicate it, when you fully understand it and what you’re working on and it’s not been generated by something else that you don’t understand. Going back to the values of science and open science, that it is as transparent as possible, that anybody else can verify what you’ve done from how you have applied the AI model, the method, the data that you’ve used, the workflows, fair principles for findable, accessible, inter[operable], reusable data. But also software so that what you’re using is shareable, is findable by others and can be verified.\n\nIzzie Clarke 28:30\n\nBut there are lots of exciting ways that this can be a tool for transforming science and digitalization, as well. So, Mercè, how do you see the role of science communication growing as technology grows, as well?\n\nMercè Crosas 28:52\n\nWell, so, science communication, we still need to do a lot of work on that for society. And there are already expectations that are possibilities or opportunities for AI to play a role also in helping summarizing a lot of the science output and make it more accessible to broader audience. So, I think that can be interesting.\n\nIzzie Clarke 28:57\n\nAnd finally, what gives you both hope for the future of science in this digital world? Mohammad?\n\nMohammad Hosseini 29:23\n\nI think what gives me hope is a new generation of researchers who speak up. We are observing a new generation who dares to say what it thinks and is willing to pay a price for it. I’m in the US and I see all kinds of big companies and how they can influence the research landscape and universities and all of that. So, it’s very important for me to see that.\n\nIzzie Clarke 29: 35\n\nAnd Mercè?\n\nMercè Crosas 29:36\n\nSo, I think that we have more tools to understand how we work, how we collaborate, what new questions we can ask in science. And I think that gives hope for better science if we don’t lose what science is and we don’t lose these values of open science, but also taking advantage of this new type of AI methods.\n\nIzzie Clarke 29:44\n\nThank you both so much for joining me.\n\nIf you’re an early- or mid-career researcher and you want to be part of the conversation on the future of AI, join the International Science Council Forum for emerging scientists.\n\nVisit the website council.science/forum to find out more. I’m Izzie Clarke, and next time we’ll be discussing how early- and mid-career researchers can help protect our ocean and the power of a transdisciplinary approach to do so. Until then.",
      "url": "https://www.nature.com/articles/d41586-025-02897-w",
      "source": "Nature",
      "published": "2025-09-26",
      "sentiment_score": 0.75,
      "reasoning": "The article presents inspiring, substantive stories of mid-career scientists navigating their careers with strategic planning, resilience, and adaptability, highlighting real-world positive impacts on scientific progress and career development. It also discusses the evolving role of AI in science, emphasizing opportunities and ethical considerations for early- and mid-career researchers globally. The content is detailed, meaningful, and broadly relevant to the scientific community and society by fostering hope and curiosity about the future of science careers.",
      "category": "Other",
      "personality_title": "Scientists share how clear plans and flexibility shape successful careers",
      "personality_presentation": "**Context**\nMany scientists plan their careers carefully, setting goals to guide their progress. But life can change these plans, and new tools like artificial intelligence (AI) are also affecting how scientists work and grow.\n\n**What happened**\nTwo scientists, Sam Smith from the UK and Milicia Radisic from Canada, shared their career stories in a podcast by Nature Careers. Sam focused on cancer research and set goals around funding and research projects rather than job titles. Milicia grew up in Serbia, moved to Canada for better opportunities, and carefully planned her research and publishing strategies to succeed. They both stressed the importance of having a clear vision but also being flexible. The podcast also featured experts discussing how AI is changing scientific work, offering new chances but also challenges, especially for early- and mid-career researchers worldwide.\n\n**Impact**\nThese stories show that successful science careers often combine clear goals with the ability to adapt. Sam and Milicia’s experiences highlight how planning helps navigate challenges like family life or limited resources. The discussion about AI points out that while technology can speed up discoveries, scientists must still understand their work deeply and remain careful about how they use AI. This balance supports strong, credible science and helps researchers prepare for a changing world.\n\n**What's next step**\nScientists and institutions are encouraged to support career planning and training in new skills, including how to use AI responsibly. Early- and mid-career researchers are invited to join conversations and forums to share experiences and learn about opportunities. These efforts aim to help scientists stay flexible, ethical, and effective as science evolves.\n\n**One-sentence takeaway**\nClear career plans combined with adaptability and thoughtful use of new technologies help scientists build meaningful and lasting careers.\n",
      "personality_title_fr": "Des scientifiques expliquent comment plans clairs et flexibilité façonnent des carrières réussies",
      "personality_presentation_fr": "**Contexte**\nBeaucoup de scientifiques planifient soigneusement leur carrière en se fixant des objectifs. Mais la vie peut modifier ces plans, et de nouveaux outils comme l’intelligence artificielle (IA) influencent aussi la manière dont les chercheurs travaillent et évoluent.\n\n**Ce qui s’est passé**\nDeux scientifiques, Sam Smith du Royaume-Uni et Milicia Radisic du Canada, ont partagé leurs parcours dans un podcast de Nature Careers. Sam s’est concentré sur la recherche sur le cancer et a fixé des objectifs liés au financement et aux projets plutôt qu’aux titres de poste. Milicia, originaire de Serbie, a déménagé au Canada pour de meilleures opportunités et a planifié soigneusement ses recherches et sa stratégie de publication. Tous deux ont souligné l’importance d’avoir une vision claire tout en restant flexibles. Le podcast a aussi présenté des experts discutant de l’impact de l’IA sur le travail scientifique, avec ses opportunités et défis pour les chercheurs en début et milieu de carrière dans le monde.\n\n**Impact**\nCes histoires montrent que les carrières scientifiques réussies allient souvent objectifs clairs et capacité d’adaptation. Les expériences de Sam et Milicia illustrent comment la planification aide à surmonter des défis comme la vie de famille ou le manque de ressources. La discussion sur l’IA souligne que si la technologie peut accélérer les découvertes, les chercheurs doivent bien comprendre leur travail et utiliser l’IA avec prudence. Cet équilibre soutient une science solide et crédible et prépare les chercheurs à un monde en changement.\n\n**Prochaine étape**\nLes scientifiques et institutions sont encouragés à soutenir la planification de carrière et la formation aux nouvelles compétences, y compris l’utilisation responsable de l’IA. Les chercheurs en début et milieu de carrière sont invités à participer à des forums pour partager leurs expériences et découvrir des opportunités. Ces efforts visent à aider les scientifiques à rester flexibles, éthiques et efficaces dans l’évolution de la science.\n\n**Une phrase clé**\nDes plans de carrière clairs, associés à la flexibilité et à une utilisation réfléchie des nouvelles technologies, aident les scientifiques à bâtir des carrières durables et significatives.\n",
      "personality_title_es": "Científicos comparten cómo planes claros y flexibilidad forman carreras exitosas",
      "personality_presentation_es": "**Contexto**\nMuchos científicos planifican cuidadosamente sus carreras fijando metas. Pero la vida puede cambiar esos planes, y nuevas herramientas como la inteligencia artificial (IA) también afectan cómo trabajan y crecen los investigadores.\n\n**Qué pasó**\nDos científicos, Sam Smith del Reino Unido y Milicia Radisic de Canadá, compartieron sus historias en un podcast de Nature Careers. Sam se centró en la investigación del cáncer y estableció objetivos relacionados con financiamiento y proyectos, no con títulos laborales. Milicia, que creció en Serbia, se mudó a Canadá para tener mejores oportunidades y planificó con cuidado sus investigaciones y estrategias de publicación. Ambos destacaron la importancia de tener una visión clara pero ser flexibles. El podcast también incluyó expertos que hablaron de cómo la IA está cambiando el trabajo científico, ofreciendo nuevas oportunidades y desafíos especialmente para investigadores en etapas tempranas y medias de su carrera.\n\n**Impacto**\nEstas historias muestran que las carreras científicas exitosas combinan metas claras con la capacidad de adaptarse. Las experiencias de Sam y Milicia muestran cómo la planificación ayuda a superar desafíos como la familia o la falta de recursos. La conversación sobre IA señala que, aunque la tecnología puede acelerar los descubrimientos, los científicos deben entender bien su trabajo y usar la IA con cuidado. Este equilibrio ayuda a mantener una ciencia fuerte y creíble y prepara a los investigadores para un mundo en cambio.\n\n**Próximo paso**\nSe anima a científicos e instituciones a apoyar la planificación de carreras y la formación en nuevas habilidades, incluyendo el uso responsable de la IA. Se invita a investigadores en etapas tempranas y medias a participar en foros para compartir experiencias y aprender sobre oportunidades. Estos esfuerzos buscan ayudar a los científicos a mantenerse flexibles, éticos y efectivos mientras la ciencia evoluciona.\n\n**Una frase clave**\nPlanes claros de carrera junto con adaptabilidad y uso cuidadoso de nuevas tecnologías ayudan a los científicos a construir carreras significativas y duraderas.\n",
      "image_url": "public/images/news_image_When-life-gets-in-the-way-of-your-meticulously-pla.png",
      "image_prompt": "A detailed, warm painting of two large, slow-moving cargo ships navigating a vast ocean under a soft sunrise, each ship symbolizing a scientist’s career journey; one ship carries glowing books and scientific instruments representing knowledge and perseverance through challenges, while the other is guided by a constellation of stars shaped like abstract funding awards and research icons, illustrating strategic planning and adaptability in a complex, evolving scientific landscape."
    },
    {
      "title": "How to plan a realistic digital detox the whole family will enjoy",
      "summary": "BY THE OPTIMIST DAILY EDITORIAL TEAM These days, screens are everywhere. From work and school to entertainment and downtime, it can feel like they are inescapable. While technology helps us stay connected, it’s becoming more and more apparent that too much of it can have the opposite effect. The endless scroll, constant pings, and screen-focused […]\nThe post How to plan a realistic digital detox the whole family will enjoy first appeared on The Optimist Daily: Making Solutions the News.",
      "content": "BY THE OPTIMIST DAILY EDITORIAL TEAM\n\nThese days, screens are everywhere. From work and school to entertainment and downtime, it can feel like they are inescapable. While technology helps us stay connected, it’s becoming more and more apparent that too much of it can have the opposite effect. The endless scroll, constant pings, and screen-focused habits can leave us feeling overwhelmed, distracted, and distant from the people right in front of us.\n\nA family digital detox offers a chance to unplug together and reconnect with what really matters. The goal isn’t to ditch technology forever, but to take a thoughtful break from it. Think of it as a way to reclaim space for deeper conversations, better sleep, and more creativity along the way.\n\nWhat is a family digital detox?\n\nA digital detox is a temporary pause from screens. That means phones, tablets, laptops, and and TV to foster presence and shared time. It can lead to a cascade of benefits: improved mental health, more intentional communication, deeper sleep, and closer bonds between family members.\n\nBut for a detox to be sustainable, it needs two things: a clear intention and a flexible approach. Think of it less as a strict “no screens ever” policy and more as an invitation to reset your routines with purpose.\n\nHow to start your family’s digital detox\n\n1. Get everyone on board\n\nKids aren’t likely to be the ones requesting a break from screens, so it’s important to explain the purpose behind your plan in a way that resonates with them. That might look like promising more time to play, explore, or just hang out together. Framing the detox as a way to get more of what they enjoy (not just less screen time) makes it easier for everyone to say yes.\n\n2. Choose your timeline together\n\nDecide as a family how long you want to unplug. This could be a single evening, a weekend experiment, or a multi-week challenge. The point is to choose something realistic and to leave room to revisit what’s working. You can always extend your detox or build in screen-free days as a regular rhythm.\n\n3. Set screen-free boundaries\n\nCreating structure will make the process smoother. Some ideas:\n\nNo phones or tablets at meals\n\nRemoving social media apps temporarily\n\nTurning on Airplane Mode during family time\n\nDeclaring bedrooms or bathrooms as screen-free zones\n\nStart with a few that feel doable. You can always add more as your family adjusts.\n\n4. Model the behavior you want to see\n\nIt’s tough to ask kids to put their devices away if we’re checking our phones during dinner. Lead by example, and let your children see you prioritizing presence too. If you do need to use technology for something like checking the weather, declare it aloud. This helps shift tech use from default to intentional.\n\n5. Make it fun and engaging\n\nUnplugging doesn’t have to mean boredom. Plan screen-free activities that bring joy: a weekend hike, cooking together, puzzles, crafts, or family game nights. You can even make it a challenge: who can read the most books in a week or learn a new hobby first?\n\n6. Let boredom have a moment\n\nThere’s value in downtime. Kids (and adults) need space to be bored. Boredom is the fertile ground for creativity and imagination. Give yourselves permission to be quiet and still, even to the point of becoming slightly uncomfortable. You might be surprised what ideas surface when screens are out of the picture.\n\n7. Track your progress together\n\nCreate a visual tracker or family calendar to mark each day you stick to your digital detox goals. Celebrate milestones and acknowledge the effort it takes to break habits, even temporarily.\n\n8. Get outside as often as you can\n\nNature is one of the best antidotes to screen fatigue. Take walks, visit local parks, try a picnic in your backyard, or explore a nearby trail. Even small bursts of fresh air and sunlight can lift your mood and energize your body.\n\n9. Rediscover hands-on hobbies\n\nFilling your hands with something other than a phone can ease the transition. Try reading paper books, doing puzzles, learning to knit, sketch, or paint. Invite your kids to join or find something new you can learn side-by-side.\n\n10. Reconnect with others in real life\n\nUse this time to strengthen relationships beyond your household. Host a tech-free potluck, plan a playdate at the park, or visit extended family. Even simple things like writing notes to neighbors can deepen your sense of community.\n\n11. Stay flexible\n\nThere’s no one-size-fits-all detox. Life happens, so adapt your plan if needed. The goal isn’t perfection, but presence.\n\n12. Reflect on the impact\n\nAt the end of your detox, talk as a family about what you noticed. Were mealtimes more relaxed? Did your kids get more creative? Did anyone sleep better? These reflections will help you decide which changes to keep long-term.\n\nCelebrate what you accomplished\n\nEven small shifts like one unplugged dinner or an hour-long screen-free playtime can create lasting memories. Celebrate the wins, however big or small. A digital detox isn’t about deprivation. It’s about choosing a life that prioritizes connection, presence, and joy.",
      "url": "https://www.optimistdaily.com/2025/09/how-to-plan-a-realistic-digital-detox-the-whole-family-will-enjoy/?utm_source=rss&utm_medium=rss&utm_campaign=how-to-plan-a-realistic-digital-detox-the-whole-family-will-enjoy",
      "source": "The Optimist Daily: Making Solutions the News",
      "published": "2025-09-25",
      "sentiment_score": 0.75,
      "reasoning": "The article promotes a family digital detox, encouraging healthier screen habits that can improve mental health, communication, sleep, and family bonds. It offers practical, detailed steps for a positive lifestyle change with broad relevance to many families, fostering emotional well-being and connection.",
      "category": "Other",
      "personality_title": "How families can enjoy a realistic digital detox together",
      "personality_presentation": "**Context** – Today, screens like phones, tablets, and TVs are part of almost every moment in our lives. While they help us stay connected, too much screen time can make people feel distracted and less close to each other.\n\n**What happened** – A guide was shared to help families take a temporary break from screens, called a digital detox. It explains how to plan this break in a way that everyone enjoys. The plan includes steps like agreeing on screen-free times, doing fun activities together, and being flexible with the rules.\n\n**Impact** – This kind of family digital detox can improve mental health, help people sleep better, and make family relationships stronger. It also encourages creativity and better communication by giving space for real conversations and activities without screens.\n\n**What's next step** – Families can start by choosing a short time to unplug, like a weekend, and try screen-free meals or games. They can track how it goes and decide if they want to make screen breaks a regular part of their life.\n\n**One-sentence takeaway** – A family digital detox is a simple, flexible way to reduce screen time and enjoy more meaningful moments together.\n\n",
      "personality_title_fr": "Comment les familles peuvent profiter d'une détox numérique réaliste ensemble",
      "personality_presentation_fr": "**Contexte** – Aujourd'hui, les écrans comme les téléphones, tablettes et télévisions font partie de presque tous nos moments. Bien qu'ils nous aident à rester connectés, un usage excessif peut nous faire sentir distraits et moins proches les uns des autres.\n\n**Ce qui s'est passé** – Un guide a été partagé pour aider les familles à faire une pause temporaire des écrans, appelée détox numérique. Il explique comment organiser cette pause de façon à ce que tout le monde en profite. Le plan comprend des étapes comme s'accorder sur des moments sans écran, faire des activités amusantes ensemble et rester flexible sur les règles.\n\n**Impact** – Ce type de détox numérique familiale peut améliorer la santé mentale, aider à mieux dormir et renforcer les liens familiaux. Il encourage aussi la créativité et une meilleure communication en laissant de la place aux vraies conversations et activités sans écran.\n\n**Prochaine étape** – Les familles peuvent commencer par choisir une courte période sans écran, comme un week-end, et essayer des repas ou des jeux sans écran. Elles peuvent suivre les résultats et décider si elles veulent intégrer ces pauses régulièrement.\n\n**Conclusion en une phrase** – Une détox numérique en famille est une façon simple et flexible de réduire le temps d'écran et de profiter de moments plus vrais ensemble.\n\n",
      "personality_title_es": "Cómo las familias pueden disfrutar juntas de una desintoxicación digital realista",
      "personality_presentation_es": "**Contexto** – Hoy en día, las pantallas como teléfonos, tabletas y televisores están presentes en casi todos los momentos de nuestra vida. Aunque nos ayudan a estar conectados, el uso excesivo puede hacer que nos sintamos distraídos y menos unidos.\n\n**Qué pasó** – Se compartió una guía para ayudar a las familias a tomarse un descanso temporal de las pantallas, llamado desintoxicación digital. Explica cómo planear esta pausa de manera que todos la disfruten. El plan incluye pasos como acordar momentos sin pantallas, hacer actividades divertidas juntos y ser flexibles con las reglas.\n\n**Impacto** – Este tipo de desintoxicación digital familiar puede mejorar la salud mental, ayudar a dormir mejor y fortalecer las relaciones familiares. También fomenta la creatividad y una mejor comunicación al dar espacio para conversaciones y actividades reales sin pantallas.\n\n**Próximo paso** – Las familias pueden empezar eligiendo un tiempo corto sin pantallas, como un fin de semana, e intentar comidas o juegos sin pantallas. Pueden seguir cómo les va y decidir si quieren hacer pausas regulares.\n\n**Frase clave** – Una desintoxicación digital familiar es una forma simple y flexible de reducir el tiempo frente a pantallas y disfrutar más momentos significativos juntos.\n\n",
      "image_url": "public/images/news_image_How-to-plan-a-realistic-digital-detox-the-whole-fa.png",
      "image_prompt": "A warm, detailed painting of a cozy family picnic scene in a sunlit park at golden hour, with a circle of empty chairs around a wooden table holding books, puzzles, art supplies, and a basket of snacks, while nearby, a softly glowing vintage hourglass gently flows, symbolizing mindful, shared time unplugged from screens."
    }
  ]
}