{
  "personality": null,
  "timestamp": "2025-10-03T04:36:18.701431",
  "category": "Other",
  "news_summary": "Today's positive news highlights strategic career planning in science and strengthened economic collaboration through the inaugural EU-Western Balkans Investment Forum.",
  "news_summary_fr": "Les nouvelles positives d'aujourd'hui mettent en lumière la planification stratégique des carrières scientifiques et le renforcement de la collaboration économique par le biais du premier forum d'investissement UE-Balkans occidentaux.",
  "news_summary_es": "Las noticias positivas de hoy destacan la planificación estratégica de la carrera científica y el refuerzo de la colaboración económica a través del primer Foro de Inversión UE-Balcanes Occidentales.",
  "articles": [
    {
      "title": "Keep, lose, add: a checklist for plotting your next career move in science",
      "summary": "Nature, Published online: 02 October 2025; doi:10.1038/d41586-025-02898-9Julie Gould learns of a career-planning framework that can help pinpoint what you love about your current role, and how that can influence future job moves.",
      "content": "Julie Gould 00:09\n\nHello and welcome to Working Scientist, a Nature Careers podcast.\n\nI’m Julie Gould. This is the fourth episode of our 2025 Career Planning series supported by the International Science Council.\n\nJulie Gould 00:28\n\nOne of my favourite career theories, because it very much fits how I have experienced my worklife, is planned happenstance.\n\nIt flips the what I call “This is what everyone thinks of career planning” idea on its head.\n\nAs we’ve heard in previous episodes in this series, conventional career planning theory suggests doing some self reflection, setting a goal, making a plan and marching towards it.\n\nBut the truth is careers rarely play out in straight lines these days.\n\nPlanned happenstance theory says stop treating luck as random. Instead, build the skills to take advantage of it.\n\nThe theory highlights five qualities that turn chance into opportunity. A curiosity to explore, persistence, to keep going when things stall, flexibility to adapt, optimism to see possibilities. And risk-taking, to step forward, even when it feels uncertain, which, let’s be honest, these days, working life can be a bit uncertain.\n\nIn other words, you can’t predict the future, but you can prepare yourself to catch opportunities when they fly past.\n\nSo instead of trying to plan everything to perfection, let’s expect to welcome the unexpected and be ready for it.\n\nBut before we dive into this more, don’t forget that at the end of this episode, we have a sponsored slot from the International Science Council, with the support from the China Association for Science and Technology.\n\nThe ISC is exploring how early and mid-career researchers can navigate their careers in a constantly evolving scientific landscape through conversations with emerging and established scientists.\n\nJulie Gould 02:00\n\nPlanned happenstance is the theory that underpins Holly Prescott’s work. She’s a career guidance practitioner, and the careers advisor for postgraduate researchers at the University of Birmingham in the UK, and she’s developed a way to prepare yourself for the unexpected, which she’s highlighted in her forthcoming book Navigating Careers Beyond Academia For Doctoral and Postdoctoral Researchers.\n\nHolly Prescott 02:20\n\nI often talk about a framework called “keep, lose, add,” which I think is really useful for what I would describe as career planning.\n\nAnd it’s a framework that anyone can use to reflect on their experiences, evaluate those, and then understand what that tells them about what you need to do next.\n\nSo what the model does is it says, “If you were going to turn whatever you’re doing now into your ideal job, what aspects of it would you want to keep, what aspects of it you would you want to lose, and what would you want to add to it that you don’t get the chance to do at the moment.”\n\nNow those things could be things you do in your work day to day activities. It could be aspects of your working environment. It could be the kinds of people you’re working with. It could even be more personal, things like work life balance and things like that.\n\nBut if you go through and regularly ask yourself those questions, that’ll help you to process the information you’re getting from whatever you’re doing at the moment, and understand what that’s telling you about what you want more of and what you want less of.\n\nJulie Gould 03:28\n\nRetrospectively, Holly realized that this is what she was doing subconsciously while she was doing her PhD in English literature at the University of Birmingham in the UK.\n\nHolly Prescott 03:37\n\nAnd all the things I wanted more of were the teaching, the public speaking, the people-facing stuff.\n\nStuff I wanted less of, was the data analysis and the working on my own a lot. And it was through working those things out that I was able to incrementally move towards a career path that would let me keep what I wanted to keep, lose what I wanted to lose, and add what I wanted to add.\n\nJulie Gould 04:01\n\nHaving a system like this, where you analyze your career experiences is important, says Holly, because if you don’t, you might find yourself making decisions reactively rather than proactively.\n\nHolly Prescott 04:12\n\nIf you don’t have this systematic way of processing the information from the experiences you have, (I see a lot of people who make career decisions based on wanting to escape something rather than wanting to intentionally move towards something).\n\nNow that’s important for two different reasons.\n\nThe first, I think, is when I see people do that, when I see people making reactive career decisions, choosing to move into something, to get away from something else, that especially if they are researchers, if they have higher degrees, if they spent a long time in a particular research field, they’re moving into something to kind of get away from academia, for example, that I do see that lead to people then feeling a little bit lost and feeling a little bit kind of feeling out of place, not really knowing who or what they are anymore, because they’ve not taken time to think about “Well, what was it about academia that defined my identity? What was it that I really enjoyed about that, and what parts of that can I take and carry with me to what I do next?”\n\nIf you don’t do that, I think it can lead to an almost identity crisis of thinking, “Well, if I’m not doing research anymore, who or what am I?”\n\nI think it’s also important when the time comes to do the practical stuff as well, like actually applying for jobs.\n\nBecause if you can’t, if you can’t construct a convincing narrative as to why, after you’ve done what you’ve done so far, you now want to do whatever it is you’re applying for, then the employer is kind of going to pick that up and not really understand why you’re there or why you’re you’re applying for What you’re applying for.\n\nSo really, kind of having a convincing narrative for that and being able to say, “Well, here’s what I’ve done so far, here’s what that’s taught me about how I thrive and what I enjoy, and here’s how that is relevant to why I’m going for this job with you now.”\n\nThat’s much more convincing and will help you in the long run.\n\nJulie Gould 06:44\n\nAs I was speaking to Holly, I found more and more that her attitude towards career planning seemed to be in line with the planned happenstance theory that I mentioned at the top of the episode.\n\nBut I wanted to know what she thought about the idea of career planning, where you ask yourself the question, “I want to be x, y, z, in two to five years time. How do I get there?”\n\nWhich I originally thought was the idea behind career planning, before I dove into this topic,\n\nHolly Prescott 07:06\n\nI call that dangerous. I think we’ve seen enough instability over the past five years, COVID, political instability, economic instability, and the world of work is changing so rapidly.\n\nIf you were to choose a job title now and work towards that in 10 years, it might not be a thing anymore, and I think we’ve really got to take that into consideration.\n\nSo what I’m saying with career planning is, if you base so rather than kind of naming a job title, naming a role and saying, in 5-10, years time, that’s what I’m going to be.\n\nThat sets you up. I think that can set you up for a lot of difficulties, because your priorities might change in that time.\n\nThe world might change in that time, the sector you’re aiming at may change during that time, right?\n\nSo the model of career planning I’m talking about is more about developing the career management skills you need to adapt and change your plans in accordance with what happens in the world.\n\nI just, I think, I think at one time, 50 years ago, when it was normal to get a job in a company, work your way up and you’d be there for life, then maybe linear plans, naming job titles and saying where you would be in 5- 10 years. Maybe that works, but I don’t think we can rely on that anymore.\n\nAnd that’s why I think we’ve gotta train ourselves to have this enterprising mindset, to develop a toolkit of skills we can use to say, “Okay, well, we have a good idea about where we perhaps want to be aiming…”\n\n….but that we don’t miss being opportunities that could arise on the way that could be even better for us.\n\nDoes that make sense? It’s a mindset.\n\nWhat I’m talking about is training yourself in a mindset. And if you train yourself in that mindset, and I’ve seen this, I’ve seen this work with researchers I’ve worked with, it means that you can actually happen upon career paths and options that you don’t even know is a thing that could be even better for you than the thing you’re aiming at, because to aim at a thing you need to know what it’s called, and you need to know it exists.\n\nAnd some of the researchers I’ve seen be the happiest in their careers were never in that position. They found things along the way.\n\nAnd it just so happened that they knew how to evaluate those things in line with their priorities, and they knew how to capitalize on those unplanned opportunities.\n\nJulie Gould 09:51\n\nThis sounds very much like it’s more along the lines of sort of planned happenstance theory of careers. Am I along the right path?\n\nHolly Prescott 10:00\n\nYeah, yeah, definitely.\n\nSo planned happenstance, the famous quote from John Kumboltz to was a big career theorist in plan happenstance said that trying to fit a changing person in a changing job market is like trying to hit a butterfly with a boomerang.\n\nIt shows you that a career is incremental. You increment you move through your career, and you incrementally tweak your professional activities to be more in aligned with what you want them to be aligned with.\n\nAnd that’s a lot less daunting than coming out of school University, coming out of a PhD in postdoc and thinking I need to make a decision now that will irrevocably influence the rest of my life.\n\nAnd what Krumboltz says is that we need to get comfortable actually with the with things like uncertainty and not that.\n\nNot treat those as things we need to eradicate, but actually embrace them and think about how they can be productive and positive forces on our career planning, rather than thinking, we need to kind of do away with them.\n\nJulie Gould 11:07\n\nThomas Oxland, a professor of orthopaedics and mechanical engineering at the University of British Columbia in Canada, is an example of someone who embodies the planned happenstance theory.\n\nWhen he was younger he was getting ready to finish his undergraduate degree and he was planning a career in industry, as is common for engineers. But he reconsidered his options when he was offered a chance to do a Master’s.\n\nThomas Oxland 11:28\n\nAnd so I had this opportunity. I talked to a prof that was in our department, this is at the University of Waterloo in Canada, and he said, “Sure, I’ll supervise your Masters.”\n\nAnd so that was a very short-term thing. I was, I wasn’t thinking that in 10 years I’d be working in biomechanics, but I got interested in it, and then I had this opportunity.\n\nSo I saw I so I took it.\n\nAnd then I guess it became very surprising to me. I loved research.\n\nI really just, when I got involved with doing a Masters, I’d had some exposure to research during my undergraduate degree at University of Waterloo. They have us do a co-op program.\n\nSo I worked for Ford Motor Company and their scientific research lab. So I saw research there. I did it in my masters, and I just loved research.\n\nSo then I decided to do my PhD. I never would have expected to do my PhD five years earlier.\n\nThere was no way I was going to go to industry. So did I plan those steps? I would say I didn’t. And in I guess in some ways, it was following my passion, following areas of interest, that I newly discovered\n\nJulie Gould 12:43\n\nIt feels like you take a bit of a risk every time you follow an opportunity like that.\n\nYou know, when you say you follow your passion, you know it may or may not have worked out well for you.\n\nAt the time, did you did you analyze things like that, like when the opportunity came along to do the PhD?\n\nDid you think, “Okay, well, here are the pros, here are the cons. Let’s weigh them up and do it.”\n\nOr did you just go, Yeah, well, whatever, let’s give it a go.\n\nThomas Oxland 13:04\n\nI did weigh the pros and cons. So I got to, got to the point where I was working as a research engineer. So after I finished my masters, I got an opportunity. I went down to Yale University, and I got a position as a research engineer, and then I took a year before I started my PhD.\n\nAnd I had an opportunity at different universities to do the PhD, and I explored those. I had the head of mechanical engineering at McGill University in Montreal.\n\nHe said to me, he says, “Why are you going into this field? There are no jobs in Canada, and this was in biomechanics.”\n\nThat gave me a reason to pause. I thought, “Okay, this is, this is a senior person saying there are no jobs.” So, of course, you don’t hear something like that and say, “Okay, I’m just going to disregard what, what you said.”\n\nBut I talked to other people, and other people said, “Well, you know, but, but there are jobs out there.”\n\nAnd that’s when I just said, based upon everything I’d seen, I was very interested in this area, and I said, it just makes sense that there’s going to be jobs, whether it’s in academics or whether it’s in industry, who knows?\n\nBut there’s going to be jobs\n\nJulie Gould 14:15\n\nSo he took on a PhD position at Yale University in the USA, during which he considered becoming a professor.\n\nBut when the time came to make a decision about his next steps, he still wanted to work in industry.\n\nSo he took on a role in a small company in Minneapolis.\n\nThomas Oxland 14:30\n\nBecause I wanted to, I’m an engineer working in the medical area. I wanted to get out there in the medical implant business, or some other area that was using my skills and in a more practical, in a more practical way, I guess.\n\nAnd so I went against the advice of a lot of people who said, “Oh no, you can’t leave. You can’t leave the academic world and go to industry. You’ll never be able to come back.”\n\nIt just didn’t make any sense to me.\n\nYou know, I felt that my skills, my experience in industry, would be valued. And it would help me understand more about the world and the problems that I was working on in my PhD, and potentially afterwards, in working with surgeons, working with medical doctors.\n\nAnd I thought, if I’m an industry, then I’m going to get more experience in that.\n\nAnd so the advice of, “Oh, if you go one direction, then there’s no recourse. You can’t get back.”\n\nThat didn’t make sense to me. So I was kind of RE, you know, evaluating some of the feedback I was getting.\n\nJulie Gould 15:37\n\nTom continued to constantly evaluate his skills and the feedback he received from speaking to people in and around the environments he was thinking of working in.\n\nHe spent three and a half years in industry before ultimately moving back to an academic position. But in order to make that a possibility, he did make sure he remained connected with academia whilst he was in industry.\n\nThomas Oxland 15:56\n\nSo I was doing research within the company, and I was also collaborating with some of the other universities that our company was working with.\n\nThey also let me go and help teach a course at the University of Minnesota, which was, which was really good, because I was just honest with the company. I said, I “don’t know where I want to go in my career, and if I got involved with teaching, that would be a good thing.”\n\nIt gives me an idea. Do I like teaching? And they supported me.\n\nThey said, “Great, that’s what you want to do, do it.”\n\nSo I didn’t plan to leave after three and a half years. It was just I could see where the company was going. The company was doing well. Company went public, and then soon after that, I left.\n\nSo the company was busy hiring people, making more money, but there were just things that I said, I don’t know that, that this is where I want to be.\n\nAnd then I got a good opportunity to go run a research group in Switzerland.\n\nAnd so, so we decided, you know, my wife and I decided to go and do that.\n\nJulie Gould 16:56\n\nBy constantly evaluating himself and his working environments, Thomas has been able to make career decisions that worked for him, moving to jobs that suited his values and skills. But sometimes, even when we do this, plans don’t work out, and that’s what we’ll explore in the fifth episode of this series on career planning.\n\nBut before you go, here’s our sponsored slot from the International Science Council on career development for early and mid career researchers in an ever evolving scientific landscape. Thanks for listening. I’m Julie Gould.\n\nIzzie Clarke: 17:42\n\nHello and welcome. I’m science journalist Izzie Clarke and in this podcast, presented in partnership with the International Science Council, with the support of the China Association for Science and Technology, we’ll be discussing the power of interdisciplinary research to protect our ocean, and how early- and mid-career researchers can bring about crucial change.\n\nToday, I’m joined by Rashid Sumaila, Canada Research Chair in Interdisciplinary Ocean and Fisheries Economics, and Professor at the University of British Columbia in Canada.\n\nRashid Sumaila: 18:17\n\nHello. Thank you for having me.\n\nIzzie Clarke: 18:20\n\nAnd Dr Mia Strand, an Ocean Nexus Postdoctoral Research Fellow at the Institute for Coastal Marine Research at Nelson Mandela University in South Africa.\n\nMia Strand: 18:29\n\nHi, Izzie. Thank you so much for having me.\n\nIzzie Clarke: 18:33\n\nThank you both for joining me. I think we’re living in a time where we are starting to understand that by protecting our ocean, that means we are protecting our planet. We are an ocean world. So, why is a transdisciplinary approach essential for tackling ocean challenges today?\n\nRashid Sumaila: 18:49\n\nYeah, actually, we have one global ocean. We’re all interconnected. So, to me, that is one place where interdisciplinarity is important, truly. Not only scientists, but working with government, with NGOs, with communities, Indigenous people, to try to find a solution that works.\n\nI’m an economist by training but I decided to be interdisciplinary because I never believed that economics alone can solve our big problems — you need to work together. No single group or discipline can deal with the ocean issues. We need to understand everything, from the ecology right to the chemistry, the physics, to the people, the communities, so this is a laboratory for interdisciplinarity.\n\nIzzie Clarke: 19:34\n\nAnd Mia?\n\nMia Strand: 19:35\n\nMore locally, I think it’s also really essential to respond to real challenges and realities of, particularly, coastal communities that are facing a lot of the great impacts of climate change and of ocean degradation and ocean acidification, for example, and making sure that our research and our work is really connected to the realities on the ground. And also, that it’s connected to policy and policy needs.\n\nIzzie Clarke: 20:04\n\nYeah, absolutely. And it’s so clear that this needs so many people involved in it to help. So, when it comes to early- and mid-career researchers, where are they helping and how, and what skills are needed at the heart of that?\n\nMia Strand: 20:19\n\nI definitely think that early- and mid-career researchers are already quite an amazing driving force in that. I think we’re seeing a next generation or a current generation of researchers who really want to pursue more, what we often call, bottom-up approaches, or more relational and ethical research that is involving, like Rashid was saying, NGOs, Indigenous peoples, government officials, in the work that they do. We’re seeing a lot of early- and mid-career researchers wanting to challenge status quo, and I think that is needed to pursue more ethical and equitable research and approaches.\n\nRashid Sumaila: 21:00\n\nThe point you make, Mia, about just pushing the envelope and shaking up the system, that is one thing I love about young people coming into this business. Diverse people, right? And we need all this perspective if we’re going to move forward.\n\nJust to give you a quick example, our project, OceanCanada Partnership, it’s called a partnership, and the Social Sciences and Research... Humanities Research Council of Canada, called SSHRC, actually has a partnership grant. And they insist that not only different professors, but also the students and the community, government, come together. And 50% of the budget was to develop early careers.\n\nIzzie Clarke: 21:43\n\nIt’s great to see that that’s already starting, that things like that exist. Would you say there are any standout skills that you think are key to working in this field for anyone that might be listening?\n\nRashid Sumaila: 22:00\n\nOh yeah. In terms of skills, we are moving into some really technology kind of skills, we’re talking about AI and programming and so on. Things are moving so fast, and the younger people clearly are with the trend and they bring this into groups and we see that it has a lot of value. So, that’s one aspect I would like to highlight here.\n\nIzzie Clarke: 22:18\n\nMia, is there anything you’d like to add?\n\nMia Strand: 22:20\n\nYeah. Facilitation skills are key. And we’re seeing that stakeholder engagement across different viewpoints and different ways of relating to or knowing the ocean is quite key and can contribute a lot to meaningful engagements.\n\nI feel like I personally really benefitted from has been training in ethics, in what’s often called everyday ethics. So, beyond the very institutional ethics procedures, which I’m actually busy with at the moment, it’s more about how can we apply different approaches to everyday ethics and building relationships, and addressing power asymmetries and power relations that are already embedded in the relationships that we form or that are already there, and taking time to build trust and form relationships. That’s also a key thing.\n\nIzzie Clarke: 23:12\n\nYeah. Given that this is such a big subject to tackle, you are going to need to work with people alongside the power of transdisciplinary research in that approach. So, can you tell me about a project that you’ve been involved in that brings different disciplines together within ocean research, and what was that issue trying to tackle?\n\nRashid Sumaila: 23:34\n\nYeah. We have a live project now, another Canada Partnership grant, we have case studies in five continents. We have the Canadian case study, which is about Indigenous management of the ocean and fisheries, which they have centuries of experience in. Then we go to the Netherlands, talking about circular economy. Then we are in West Africa, looking at IUU fishing, gender issues and sustainability, food security.\n\nThen we go to China, and there we’re looking at agriculture because they are the masters of agriculture. So, what can we learn from China, and what don’t we want to touch with a long pole from their experience? Finally, in Costa Rica, is the land–ocean relationship.\n\nAnd in all of these case studies, our goal is how to deal with the sustainability challenges at the nexus of food security. How do you feed billions of people in the face of climate change without destroying biodiversity?\n\nIzzie Clarke: 24:39\n\nThere are so many topics and countries and different corners of the world all involved in that. How do you even begin to plan something like that, because it has so many moving parts?\n\nRashid Sumaila: 24:52\n\nIndeed, and that is a challenge, that is really the fun part! I think one of the things we’ve had experience really working with large groups. But still it’s not easy, it’s very challenging. There are different languages, disciplinary ones, continental ones, and so on. But you know the value of this, so far, is remarkable.\n\nIzzie Clarke: 25:15\n\nAnd Mia, can you tell me about a project that you’re involved in as well and, again, talk about how that brings all those different disciplines together?\n\nMia Strand: 25:24\n\nYes. One of the projects I’m currently involved in is a WIOMSA working group called Blue Tenure Transitions. And that’s actually bringing together marine and social scientists of different disciplines, but also people in government, decision-makers, and also community-based knowledge holders.\n\nAnd it’s really to try and understand and research how the rights of small-scale and artisanal fishers and Indigenous and local coastal communities can better be recognized but also realized of their rights in the Western Indian Ocean, particularly, in the context of increasing blue economy investments and efforts, but also increasing ocean conservation processes such as the goal for 30x30 in marine spatial planning that’s happening.\n\nIzzie Clarke: 26:14\n\nAnd you advocate for equitable collaboration with ocean communities, as well, and in previous episodes of this series, we’ve talked about how important it is to involve the Global South, as well, in discussion. So, what does that look like in practice working with ocean communities, and why is that such an important piece of the puzzle for now and for the future?\n\nMia Strand: 26:37\n\nI do still think that we really need to centre the experiences and the realities of coastal communities, particularly, in the Global South and on the African continent, that are facing a lot of these challenges today. And I do think that the only way that scientists or researchers, or even decision-makers, can ensure that they are hearing and listening deeply is to really work through equitable approaches.\n\nSo, what does that look like? The transformative opportunity of transdisciplinary research is that even from the start, the design of the project and the way we do our research can be co-produced with community members. And I think for early- and mid-career researchers, I think it’s also about understanding who and what you’re doing your research for, what you want to do and why. We’re seeing a lot of early- and mid-career researchers already doing that, that’s very great to see.\n\nIzzie Clarke: 27:38\n\nYeah. And Rashid, what do you think are the biggest barriers to making transdisciplinary and community-based research more common, and are there ways in which we can begin to overcome them?\n\nRashid Sumaila: 27:52\n\nYeah. The barriers, it’s language, also. The other one is — Mia, I like that you stress the power imbalance and the inequities, because that is so important. By really ignoring the communities, we are losing something overall.\n\nI think our world and our economy is run a lot by so-called Western principles, and we can debate that. I tell people looking for profit is not just a Western thing. My own grandfather knew that he couldn’t continue running losses in his little business. But it seems profit, short-term profit, is running the world, and I really think if we open up the space for Indigenous knowledge — what I call granny wisdom — to soften this hardcore ‘money, money, money’ thing, that will really make the world better, we’ll know how to deal with the environment.\n\nIzzie Clarke: 28:50\n\nWhat advice, and this is to both of you, would you give to early- and mid-career researchers who want to embark on a career in transdisciplinary research?\n\nMia Strand: 29:01\n\nI think just do it. I think have fun and learn, and the benefits outweigh the costs, I would say, even though it might give you some grey hairs and it might get sleepless nights, I do think that it will make your research and your work more relevant, more applicable, and you will learn a lot.\n\nAnd be ready to be humble and unlearn things. Like Rashid was saying, what is so core is to question some of the forces that might be louder than others in the world right now.\n\nRashid Sumaila: 29:41\n\nThis is fantastic advice. It’s not going to be easy. And, actually, people might even call you names for pushing the envelope. Just ignore them. Eyes on the ball, persevere, persistence, keep pushing. You’re going to be happy you did that because the world is recognizing this more and more. So, come on board, guys and girls! Let’s do it and push the world in the way we want it to be to improve here.\n\nIzzie Clarke: 30:08\n\nA lovely note to end on. Thank you both so much for joining me.\n\nIf you’re an early- or mid-career researcher and you want to be part of that transdisciplinary community, join the International Science Council forum for emerging scientists.\n\nVisit the website council.science/forum to find out more. I’m Izzie Clarke and next time, we’ll be discussing the importance of well-being and mental-health support for early and mid-career researchers. Until then.",
      "url": "https://www.nature.com/articles/d41586-025-02898-9",
      "source": "Nature",
      "published": "2025-10-03",
      "sentiment_score": 0.85,
      "reasoning": "The article highlights innovative career-planning frameworks that empower early- and mid-career scientists to navigate uncertainty and embrace opportunities, promoting adaptability and personal growth. It also showcases inspiring interdisciplinary ocean research projects addressing global environmental challenges through equitable collaboration, which has broad societal significance. The detailed discussion provides substantial context on career development and transdisciplinary research impact, making it an uplifting and informative story with real-world benefits.",
      "category": "Other",
      "personality_title": "New career planning ideas help scientists adapt and grow in changing fields",
      "personality_presentation": "**Context** – Many scientists face uncertain career paths today. Traditional plans that set fixed goals don’t always work because the world and jobs change fast. Researchers need new ways to prepare for unexpected opportunities.\n\n**What happened** – Career advisor Holly Prescott introduced a simple “keep, lose, add” method to help scientists think about what parts of their current job they want to keep, which parts to lose, and what new things to add. This helps people understand what kind of work suits them best. The idea fits with a theory called planned happenstance, which encourages being curious, flexible, and ready to take risks when chances come up. \n\nProfessor Thomas Oxland shared how he used this approach by following opportunities as they appeared, changing from industry to academia and back, making choices based on his interests and skills rather than a strict plan.\n\nIn another part of the story, early and mid-career researchers working on ocean science are using teamwork across different fields like economics, ecology, and social science to solve big problems like climate change and ocean health. They involve local communities and Indigenous peoples to make sure their work fits real needs and respects different viewpoints.\n\n**Impact** – The “keep, lose, add” framework and planned happenstance theory give scientists tools to handle career uncertainty thoughtfully instead of reacting to problems. This helps them find jobs that fit their strengths and values better. The ocean research projects show how combining many skills and voices leads to stronger solutions for global challenges. These examples show how being open to change and collaboration can create meaningful progress both personally and for society.\n\n**What's next step** – Scientists are encouraged to use these career-planning ideas regularly to stay aware of what they enjoy and want to change. The International Science Council offers resources for researchers to connect and learn. Ocean researchers plan to keep building partnerships worldwide to protect marine environments while supporting communities.\n\n**One-sentence takeaway** – New career planning methods and teamwork across fields help scientists adapt to change and make a positive impact on their work and the world.\n",
      "personality_title_fr": "De nouvelles méthodes pour aider les scientifiques à s’adapter et évoluer dans des carrières changeantes",
      "personality_presentation_fr": "**Contexte** – De nombreux scientifiques font face à des parcours professionnels incertains. Les plans traditionnels avec des objectifs fixes ne fonctionnent pas toujours car le monde et les emplois évoluent rapidement. Les chercheurs ont besoin de nouvelles façons de se préparer aux opportunités inattendues.\n\n**Ce qui s'est passé** – La conseillère en carrière Holly Prescott a présenté une méthode simple « garder, perdre, ajouter » pour aider les scientifiques à réfléchir aux aspects de leur travail actuel qu’ils veulent conserver, ceux qu’ils veulent perdre, et ce qu’ils aimeraient ajouter. Cela aide à mieux comprendre le type de travail qui leur convient. Cette idée correspond à la théorie de la « coïncidence planifiée », qui encourage la curiosité, la flexibilité et la prise de risques quand des opportunités se présentent.\n\nLe professeur Thomas Oxland a partagé comment il a suivi cette approche en saisissant les opportunités qui sont apparues, changeant de l’industrie au monde académique et inversement, en faisant des choix basés sur ses intérêts et compétences plutôt que sur un plan rigide.\n\nDans une autre partie de l’histoire, des chercheurs en début et milieu de carrière travaillant sur l’océan utilisent la collaboration entre plusieurs disciplines comme l’économie, l’écologie et les sciences sociales pour résoudre de grands problèmes comme le changement climatique et la santé des océans. Ils impliquent les communautés locales et les peuples autochtones pour que leurs travaux répondent aux besoins réels et respectent différentes perspectives.\n\n**Impact** – Le cadre « garder, perdre, ajouter » et la théorie de la coïncidence planifiée offrent aux scientifiques des outils pour gérer l’incertitude de leur carrière de manière réfléchie plutôt que réactive. Cela les aide à trouver des emplois qui correspondent mieux à leurs forces et valeurs. Les projets de recherche océanique montrent comment la combinaison de plusieurs compétences et voix mène à des solutions plus solides pour les défis mondiaux. Ces exemples démontrent que l’ouverture au changement et à la collaboration peut créer des progrès importants, tant personnels que sociétaux.\n\n**Prochaine étape** – Il est conseillé aux scientifiques d’utiliser régulièrement ces idées pour rester conscients de ce qu’ils apprécient et souhaitent changer. Le Conseil international de la science offre des ressources pour que les chercheurs se connectent et apprennent. Les chercheurs en océanographie prévoient de continuer à développer des partenariats mondiaux pour protéger les milieux marins tout en soutenant les communautés.\n\n**Phrase clé** – De nouvelles méthodes de planification de carrière et la collaboration interdisciplinaire aident les scientifiques à s’adapter au changement et à avoir un impact positif sur leur travail et le monde.\n",
      "personality_title_es": "Nuevas ideas para ayudar a los científicos a adaptarse y crecer en carreras cambiantes",
      "personality_presentation_es": "**Contexto** – Muchos científicos enfrentan caminos profesionales inciertos hoy. Los planes tradicionales con metas fijas no siempre funcionan porque el mundo y los empleos cambian rápido. Los investigadores necesitan nuevas formas de prepararse para oportunidades inesperadas.\n\n**Qué pasó** – La asesora de carrera Holly Prescott presentó un método sencillo llamado “mantener, perder, añadir” para ayudar a los científicos a pensar qué partes de su trabajo actual quieren conservar, cuáles quieren dejar y qué cosas nuevas quisieran agregar. Esto ayuda a entender qué tipo de trabajo les queda mejor. La idea encaja con una teoría llamada casualidad planificada, que anima a ser curioso, flexible y a tomar riesgos cuando surjan oportunidades.\n\nEl profesor Thomas Oxland contó cómo usó este enfoque siguiendo oportunidades que aparecieron, cambiando entre industria y academia, tomando decisiones basadas en sus intereses y habilidades en lugar de un plan estricto.\n\nEn otra parte de la historia, investigadores en etapas tempranas y medias de su carrera trabajan en ciencia oceánica usando la colaboración entre diferentes campos como economía, ecología y ciencias sociales para resolver problemas grandes como el cambio climático y la salud del océano. Involucran a comunidades locales y pueblos indígenas para que su trabajo se ajuste a necesidades reales y respete diferentes puntos de vista.\n\n**Impacto** – El marco “mantener, perder, añadir” y la teoría de casualidad planificada ofrecen a los científicos herramientas para manejar la incertidumbre profesional de forma pensada en lugar de reaccionar sin plan. Esto les ayuda a encontrar trabajos que encajan mejor con sus fortalezas y valores. Los proyectos de investigación oceánica muestran cómo combinar muchas habilidades y voces lleva a soluciones más fuertes para retos globales. Estos ejemplos muestran que estar abierto al cambio y la colaboración puede crear avances importantes tanto personales como sociales.\n\n**Próximo paso** – Se anima a los científicos a usar estas ideas de planificación regularmente para estar conscientes de lo que disfrutan y quieren cambiar. El Consejo Internacional de la Ciencia ofrece recursos para que los investigadores se conecten y aprendan. Los investigadores oceánicos planean seguir construyendo alianzas mundiales para proteger los ambientes marinos mientras apoyan a las comunidades.\n\n**Frase clave** – Nuevos métodos de planificación de carrera y trabajo en equipo interdisciplinario ayudan a los científicos a adaptarse a los cambios y a tener un impacto positivo en su trabajo y en el mundo.\n",
      "image_url": "public/images/news_image_Keep-lose-add-a-checklist-for-plotting-your-next-c.png",
      "image_prompt": "A warm, detailed painting of a winding river flowing through diverse landscapes representing evolving scientific careers—sections of the river are dotted with open books, interconnected gears, and glowing pathways symbolizing curiosity, adaptability, and planned happenstance; alongside, abstract figures of collaborative hands and intertwined roots illustrate transdisciplinary ocean research and community engagement, all rendered in soft, natural earth tones and gentle blues."
    },
    {
      "title": "The First EU-Western Balkans Investment Forum in Tirana on October 13-14, supported by the European Commission",
      "summary": "Investors and decision-makers will gather at the Palace of Congresses in Tirana with several aims: to advance regional integration, create opportunities for sustainable growth, and promote innovation in the Western Balkans.",
      "content": "Investors and decision-makers will gather at the Palace of Congresses in Tirana with several aims: to advance regional integration, create opportunities for sustainable growth, and promote innovation in the Western Balkans.\n\nTirana will host the first EU-Western Balkans Investment Forum on October 13 and 14, supported by the European Commission.\n\nThe forum aims to strengthen economic cooperation and investment opportunities among the countries of the Western Balkans (Albania, Bosnia and Herzegovina, Kosovo, Montenegro, North Macedonia, and Serbia) and the member states of the European Union (EU).\n\nInvestors and decision-makers will gather at the Palace of Congresses in Tirana with several goals: to advance regional integration, create opportunities for sustainable growth, and promote innovation in the Western Balkans.\n\nThe development of the Forum represents a strategic moment in the economic integration of the region with the European Union. It offers opportunities to attract foreign direct investments, promote innovation, and accelerate the economic integration of the Western Balkans, thereby fostering sustainable economic development in the region.\n\nSupported by the European Commission, this summit is part of the broader EU strategy to promote regional integration and socio-economic convergence, encouraging sustainable economic development throughout the region.\n\nThe European Union and the six countries of the Western Balkans (WB6) are at a crucial moment in their joint economic and political journey. While the EU seeks to revitalize its economic dynamism and ensure its global competitiveness, the Western Balkans emerges as a new promising frontier for investment.\n\nThis investment forum serves as a strategic platform to strengthen economic cooperation, attract foreign direct investments (FDI), and accelerate the integration of the WB6 economies into the European single market, benefiting both the WB6 countries, EU member states, and European companies.\n\nBy fostering dialogue among investors, policymakers, and business leaders, this forum in Tirana will highlight how key investment opportunities can catalyze growth, deepen market integration, and secure the future of Europe as a competitive, resilient, and united bloc. It will also address critical challenges such as regulatory barriers, financing constraints, and geopolitical uncertainties that may impact regional economic development. (October 2)",
      "url": "https://europeannewsroom.com/the-first-eu-western-balkans-investment-forum-in-tirana-on-october-13-14-supported-by-the-european-commission-2/",
      "source": "European Newsroom",
      "published": "2025-10-02",
      "sentiment_score": 0.8,
      "reasoning": "The article describes a significant event aimed at fostering regional economic integration, sustainable growth, and innovation in the Western Balkans with EU support. This has broad positive real-world impact by promoting cooperation, investment, and development across multiple countries, benefiting a large population and enhancing regional stability and prosperity. The article provides sufficient context about the forum's goals, participants, and strategic importance, making it a substantive and meaningful story.",
      "category": "Other",
      "personality_title": "First EU-Western Balkans Investment Forum to Boost Regional Growth and Cooperation",
      "personality_presentation": "**Context** – The Western Balkans includes six countries: Albania, Bosnia and Herzegovina, Kosovo, Montenegro, North Macedonia, and Serbia. These countries are working closely with the European Union (EU) to improve their economies and strengthen ties. The EU supports this process to encourage growth and cooperation across the region.\n\n**What happened** – On October 13 and 14, the city of Tirana in Albania hosted the first EU-Western Balkans Investment Forum. This event brought together investors, government leaders, and business experts from the Western Balkans and EU countries. They met at the Palace of Congresses to discuss ways to increase investment, promote innovation, and support sustainable economic growth in the region.\n\n**Impact** – This forum is important because it creates a shared space for countries to work together on economic projects. It helps attract money from outside the region, which can lead to new jobs and better businesses. By focusing on innovation and removing obstacles like complicated rules, the forum hopes to make the Western Balkans more connected with the EU’s single market. This means goods, services, and ideas can move more easily, helping the whole region grow stronger.\n\n**What's next step** – Following this forum, the countries involved will continue to work on specific projects and policies that encourage investment and cooperation. The European Commission will support these efforts, aiming to deepen economic ties and make the region more competitive globally. Future meetings will likely track progress and find new ways to solve challenges such as funding and regulations.\n\n**One-sentence takeaway** – The EU-Western Balkans Investment Forum in Tirana marks a key step toward stronger economic ties and growth opportunities between the Western Balkans and the European Union.",
      "personality_title_fr": "Premier forum d’investissement UE-Balkans occidentaux pour stimuler la croissance régionale et la coopération",
      "personality_presentation_fr": "**Contexte** – Les Balkans occidentaux comprennent six pays : Albanie, Bosnie-Herzégovine, Kosovo, Monténégro, Macédoine du Nord et Serbie. Ces pays collaborent étroitement avec l’Union européenne (UE) pour améliorer leurs économies et renforcer leurs liens. L’UE soutient ce processus pour encourager la croissance et la coopération dans la région.\n\n**Ce qui s’est passé** – Les 13 et 14 octobre, la ville de Tirana en Albanie a accueilli le premier Forum d’investissement UE-Balkans occidentaux. Cet événement a réuni des investisseurs, des dirigeants gouvernementaux et des experts en affaires des Balkans occidentaux et des pays de l’UE. Ils se sont rencontrés au Palais des Congrès pour discuter de moyens d’augmenter les investissements, de promouvoir l’innovation et de soutenir une croissance économique durable dans la région.\n\n**Impact** – Ce forum est important car il crée un espace commun pour que les pays travaillent ensemble sur des projets économiques. Il aide à attirer des fonds extérieurs, ce qui peut entraîner de nouveaux emplois et de meilleures entreprises. En se concentrant sur l’innovation et la suppression des obstacles comme les règles complexes, le forum espère rapprocher les Balkans occidentaux du marché unique de l’UE. Cela signifie que les biens, services et idées peuvent circuler plus facilement, aidant toute la région à devenir plus forte.\n\n**Prochaine étape** – Après ce forum, les pays impliqués continueront à travailler sur des projets et des politiques spécifiques favorisant l’investissement et la coopération. La Commission européenne soutiendra ces efforts, visant à approfondir les liens économiques et à rendre la région plus compétitive au niveau mondial. De futures réunions suivront les progrès et chercheront de nouvelles solutions aux défis comme le financement et la réglementation.\n\n**Phrase clé** – Le Forum d’investissement UE-Balkans occidentaux à Tirana marque une étape importante vers des liens économiques plus forts et des opportunités de croissance entre les Balkans occidentaux et l’Union européenne.",
      "personality_title_es": "Primer foro de inversión UE-Balcanes occidentales para impulsar el crecimiento y la cooperación regional",
      "personality_presentation_es": "**Contexto** – Los Balcanes occidentales incluyen seis países: Albania, Bosnia y Herzegovina, Kosovo, Montenegro, Macedonia del Norte y Serbia. Estos países trabajan estrechamente con la Unión Europea (UE) para mejorar sus economías y fortalecer sus vínculos. La UE apoya este proceso para fomentar el crecimiento y la cooperación en la región.\n\n**Qué pasó** – El 13 y 14 de octubre, la ciudad de Tirana, en Albania, fue sede del primer Foro de Inversión UE-Balcanes Occidentales. Este evento reunió a inversores, líderes gubernamentales y expertos empresariales de los Balcanes occidentales y países de la UE. Se encontraron en el Palacio de Congresos para hablar sobre cómo aumentar inversiones, promover la innovación y apoyar el crecimiento económico sostenible en la región.\n\n**Impacto** – Este foro es importante porque crea un espacio compartido para que los países colaboren en proyectos económicos. Ayuda a atraer dinero del exterior, lo que puede generar nuevos empleos y mejores negocios. Al enfocarse en la innovación y eliminar obstáculos como reglas complicadas, el foro busca conectar más a los Balcanes occidentales con el mercado único de la UE. Esto permite que bienes, servicios e ideas se muevan con mayor facilidad, ayudando a que toda la región crezca y se fortalezca.\n\n**Próximo paso** – Después de este foro, los países seguirán trabajando en proyectos y políticas para fomentar la inversión y la cooperación. La Comisión Europea apoyará estos esfuerzos para profundizar los lazos económicos y hacer que la región sea más competitiva a nivel global. Probablemente habrá futuras reuniones para revisar avances y encontrar nuevas formas de superar desafíos como financiación y regulaciones.\n\n**Frase clave** – El Foro de Inversión UE-Balcanes Occidentales en Tirana marca un paso clave hacia vínculos económicos más fuertes y oportunidades de crecimiento entre los Balcanes occidentales y la Unión Europea.",
      "image_url": "public/images/news_image_The-First-EU-Western-Balkans-Investment-Forum-in-T.png",
      "image_prompt": "A detailed, warm painting of six stylized bridges made of intertwined gears and light beams, arching gracefully over a calm river that flows through a vibrant cityscape inspired by Tirana’s Palace of Congresses, with soft natural tones symbolizing connection, cooperation, and sustainable growth between the Western Balkans and the European Union."
    }
  ]
}