{
  "personality": null,
  "timestamp": "2025-07-24T04:52:20.336233",
  "category": "Technology",
  "news_summary": "Today's technology news highlights breakthroughs in AI-driven advancements across biotechnology, archaeology, and earth sciences, alongside cutting-edge laser research pushing material limits.",
  "news_summary_fr": "L'actualité technologique d'aujourd'hui met en lumière les avancées de l'IA dans les domaines de la biotechnologie, de l'archéologie et des sciences de la terre, ainsi que la recherche de pointe sur les lasers, qui repousse les limites de la matière.",
  "news_summary_es": "Las noticias tecnológicas de hoy destacan los grandes avances en biotecnología, arqueología y ciencias de la tierra impulsados por la inteligencia artificial, así como la investigación láser de vanguardia que supera los límites de los materiales.",
  "articles": [
    {
      "title": "Integrated biotechnological and AI innovations for crop improvement",
      "summary": "Nature, Published online: 23 July 2025; doi:10.1038/s41586-025-09122-8The integration of omics technologies, genome editing and protein design with artificial intelligence (AI) promises rapid advances in the field of crop improvement that will improve global food security.",
      "content": "van Dijk, M. et al. A meta-analysis of projected global food demand and population at risk of hunger for the period 2010–2050. Nat. Food 2, 494–501 (2021).\n\nHasegawa, T. et al. Extreme climate events increase risk of global food insecurity and adaptation needs. Nat. Food 2, 587–595 (2021).\n\nZhang, H. et al. A Gγ protein regulates alkaline sensitivity in crops. Science 379, eade8416 (2023).\n\nSingh, B. K. et al. Climate change impacts on plant pathogens, food security and paths forward. Nat. Rev. Microbiol. 21, 640–656 (2023).\n\nPotapov, P. et al. Global maps of cropland extent and change show accelerated cropland expansion in the twenty-first century. Nat. Food 3, 19–28 (2022).\n\nCrow, J. F. 90 years ago: the beginning of hybrid maize. Genetics 148, 923–928 (1998).\n\nPingali, P. L. Green revolution: impacts, limits, and the path ahead. Proc Natl Acad. Sci. USA 109, 12302–12308 (2012).\n\nGreen, J. M. The benefits of herbicide-resistant crops. Pest. Manag. Sci. 68, 1323–1331 (2012).\n\nLu, Y. et al. Widespread adoption of Bt cotton and insecticide decrease promotes biocontrol services. Nature 487, 362–365 (2012).\n\nMascher, M. et al. Promises and challenges of crop translational genomics. Nature 636, 585–593 (2024).\n\nYu, X. et al. Single-cell and spatial multi-omics in the plant sciences: technical advances, applications, and perspectives. Plant Commun. 4, 100508 (2023).\n\nYu, H. et al. A route to de novo domestication of wild allotetraploid rice. Cell 184, 1156–1170 (2021). This study demonstrates the rapid neo-domestication of wild rice relatives, a new paradigm in enriching crop genetic resources and accelerating crop improvement.\n\nLi, T. et al. Domestication of wild tomato is accelerated by genome editing. Nat. Biotechnol. 36, 1160–1163 (2018).\n\nAbramson, J. et al. Accurate structure prediction of biomolecular interactions with AlphaFold 3. Nature 630, 493–500 (2024).\n\nKortemme, T. De novo protein design—from new structures to programmable functions. Cell 187, 526–544 (2024).\n\nSilver, D. et al. Mastering the game of Go with deep neural networks and tree search. Nature 529, 484–489 (2016).\n\nListov, D. et al. Opportunities and challenges in design and optimization of protein function. Nat. Rev. Mol. Cell Biol. 25, 639–653 (2024).\n\nYang, W. et al. Crop phenomics and high-throughput phenotyping: past decades, current challenges, and future perspectives. Mol. Plant 13, 187–214 (2020).\n\nShen, S. et al. Metabolomics-centered mining of plant metabolic diversity and function: Past decade and future perspectives. Mol. Plant 16, 43–63 (2023).\n\nLi, B. et al. Targeted genome-modification tools and their advanced applications in crop breeding. Nat. Rev. Genet. 25, 603–622 (2024).\n\nScossa, F. et al. Integrating multi-omics data for crop improvement. J. Plant Physiol. 257, 153352 (2021).\n\nTorres-Rodríguez, J. V. et al. Evolving best practices for transcriptome-wide association studies accelerate discovery of gene-phenotype links. Curr. Opin. Plant Biol. 83, 102670 (2025).\n\nGoff, S. A. et al. A draft sequence of the rice genome (Oryza sativa L. ssp. japonica). Science 296, 92–100 (2002).\n\nLi, H. & Durbin, R. Genome assembly in the telomere-to-telomere era. Nat. Rev. Genet. 25, 658–670 (2024).\n\nChen, J. et al. A complete telomere-to-telomere assembly of the maize genome. Nat. Genet. 55, 1221–1231 (2023).\n\nQin, P. et al. Pan-genome analysis of 33 genetically diverse rice accessions reveals hidden genomic variations. Cell 184, 3542–3558 (2021).\n\nTang, D. et al. Genome evolution and diversity of wild and cultivated potatoes. Nature 606, 535–541 (2022). Sequencing and analysis of genomes from wild and cultivated potatoes enables identification of candidate genes for many traits, including a transcription factor for tuber formation.\n\nLiu, Y. et al. Pan-genome of wild and cultivated soybeans. Cell 182, 162–176 (2020).\n\nHufford, M. B. et al. De novo assembly, annotation, and comparative analysis of 26 diverse maize genomes. Science 373, 655–662 (2021).\n\nJayakodi, M. et al. Structural variation in the pangenome of wild and domesticated barley. Nature 636, 654–662 (2024).\n\nJiao, C. et al. Pan-genome bridges wheat structural variations with habitat and breeding. Nature 637, 384–393 (2024).\n\nSun, W. et al. Genetic modification of Gγ subunit AT1 enhances salt-alkali tolerance in main graminaceous crops. Natl Sci. Rev. 10, nwad075 (2023). This study demonstrates that elite alleles cloned from one crop can be rapidly translated into other crops, facilitated by crop genomics, mutant collections and genome editing.\n\nVarshney, R. K. et al. A chickpea genetic variation map based on the sequencing of 3,366 genomes. Nature 599, 622–627 (2021). This study demonstrates some valuable breeding strategies from sequencing and analysis of cultivated and wild chickpea accessions.\n\nWei, X. et al. Genomic investigation of 18,421 lines reveals the genetic architecture of rice. Science 385, eadm8762 (2024).\n\nCheng, S. et al. Harnessing landrace diversity empowers wheat breeding. Nature 632, 823–831 (2024). This study provides a framework for fully utilizing genetic diversity in more than 1,000 wheat landraces and cultivars for wheat improvement through sequencing and in-depth field phenotyping.\n\nZhang, J. et al. Releasing a sugar brake generates sweeter tomato without yield penalty. Nature 635, 647–656 (2024).\n\nZhang, Y. et al. Structural variation reshapes population gene expression and trait variation in 2,105 Brassica napus accessions. Nat. Genet. 56, 2538–2550 (2024).\n\nWang, W. et al. Genomic variation in 3,010 diverse accessions of Asian cultivated rice. Nature 557, 43–49 (2018).\n\nYang, N. et al. Two teosintes made modern maize. Science 382, eadg8940 (2023).\n\nGu, Z. et al. Structure and function of rice hybrid genomes reveal genetic basis and optimal performance of heterosis. Nat. Genet. 55, 1745–1756 (2023).\n\nWu, Y. et al. Phylogenomic discovery of deleterious mutations facilitates hybrid potato breeding. Cell 186, 2313–2328 (2023).\n\nAlemu, A. et al. Genomic selection in plant breeding: key factors shaping two decades of progress. Mol. Plant 17, 552–578 (2024).\n\nMueller, U. G. & Linksvayer, T. A. Microbiome breeding: conceptual and practical issues. Trends Microbiol. 30, 997–1011 (2022).\n\nSchmitz, L. et al. Synthetic bacterial community derived from a desert rhizosphere confers salt stress resilience to tomato in the presence of a soil microbiome. ISME J. 16, 1907–1920 (2022).\n\nYue, H. et al. Host genotype-specific rhizosphere fungus enhances drought resistance in wheat. Microbiome 12, 44 (2024).\n\nKwak, M.-J. et al. Rhizosphere microbiome structure alters to enable wilt resistance in tomato. Nat. Biotechnol. 36, 1100–1109 (2018).\n\nZhang, L. et al. A highly conserved core bacterial microbiota with nitrogen-fixation capacity inhabits the xylem sap in maize plants. Nat. Commun. 13, 3361 (2022).\n\nHuang, R. et al. Natural variation at OsCERK1 regulates arbuscular mycorrhizal symbiosis in rice. New Phytol. 225, 1762–1776 (2020).\n\nZhang, J. et al. NRT1.1B is associated with root microbiota composition and nitrogen use in field-grown rice. Nat. Biotechnol. 37, 676–684 (2019).\n\nSu, P. et al. Microbiome homeostasis on rice leaves is regulated by a precursor molecule of lignin biosynthesis. Nat. Commun. 15, 23 (2024).\n\nWeisberg, A. J. et al. Genomic approaches to plant-pathogen epidemiology and diagnostics. Annu. Rev. Phytopathol. 59, 311–332 (2021).\n\nThilliez, G. J. A. et al. Pathogen enrichment sequencing (PenSeq) enables population genomic studies in oomycetes. New Phytol. 221, 1634–1648 (2019).\n\nBrooks, E. G. et al. Plant promoters and terminators for high-precision bioengineering. Biodes. Res. 5, 0013 (2023).\n\nGabriel, L. et al. BRAKER3: fully automated genome annotation using RNA-seq and protein evidence with GeneMark-ETP, AUGUSTUS, and TSEBRA. Genome Res. 34, 769–777 (2024).\n\nYang, C. et al. Rice metabolic regulatory network spanning the entire life cycle. Mol. Plant 15, 258–275 (2022).\n\nZhu, G. et al. Rewiring of the fruit metabolome in tomato breeding. Cell 172, 249–261 (2018). This study uses metabolomics to demonstrate how breeding has made tomato more edible.\n\nSreenivasulu, N. et al. Metabolic signatures from genebank collections: an underexploited resource for human health? Annu. Rev. Food Sci. Technol. 14, 183–202 (2023).\n\nBai, Y. et al. Natural history-guided omics reveals plant defensive chemistry against leafhopper pests. Science 375, eabm2948 (2022).\n\nSha, G. et al. Genome editing of a rice CDP-DAG synthase confers multipathogen resistance. Nature 618, 1017–1023 (2023). Saturated targeted mutagenesis enabled by multiplexed genome editing optimizes the RBL1 allele in balancing immunity and growth, making the unusable allele valuable in rice breeding.\n\nMichaelis, A. C. et al. The social and structural architecture of the yeast protein interactome. Nature 624, 192–200 (2023).\n\nBilbao, A. et al. PeakDecoder enables machine learning-based metabolite annotation and accurate profiling in multidimensional mass spectrometry measurements. Nat. Commun. 14, 2461 (2023).\n\nAlseekh, S. & Fernie, A. R. Metabolomics 20 years on: what have we learned and what hurdles remain? Plant J. 94, 933–942 (2018).\n\nMarand, A. P. et al. A cis-regulatory atlas in maize at single-cell resolution. Cell 184, 3041–3055 (2021).\n\nSwift, J. et al. Exaptation of ancestral cell-identity networks enables C 4 photosynthesis. Nature 636, 143–150 (2024).\n\nOrtiz-Ramírez, C. et al. Ground tissue circuitry regulates organ complexity in maize and Setaria. Science 374, 1247–1252 (2021).\n\nOmary, M. et al. A conserved superlocus regulates above- and belowground root initiation. Science 375, eabf4368 (2022).\n\nZhang, T. Q. et al. Single-cell transcriptome atlas and chromatin accessibility landscape reveal differentiation trajectories in the rice root. Nat. Commun. 12, 2053 (2021).\n\nWang, Q. et al. Single-cell transcriptome atlas reveals developmental trajectories and a novel metabolic pathway of catechin esters in tea leaves. Plant Biotechnol. J. 20, 2089–2106 (2022).\n\nWang, H. et al. Molecular regulation of oil gland development and biosynthesis of essential oils in Citrus spp. Science 383, 659–666 (2024).\n\nLi, C. et al. Single-cell multi-omics in the medicinal plant Catharanthus roseus. Nat. Chem. Biol. 19, 1031–1041 (2023).\n\nXu, X. et al. Single-cell RNA sequencing of developing maize ears facilitates functional analysis and trait candidate gene discovery. Dev. Cell 56, 557–568 (2021). This study integrates single-cell omics with GWASs in crops to identify genes associated with yield.\n\nNobori, T. et al. A rare PRIMER cell state in plant immunity. Nature 638, 197–205 (2025).\n\nSerrano, K. et al. Spatial co-transcriptomics reveals discrete stages of the arbuscular mycorrhizal symbiosis. Nat. Plants 10, 673–688 (2024).\n\nLiu, Z. et al. Single-nucleus transcriptomes reveal spatiotemporal symbiotic perception and early response in Medicago. Nat. Plants 9, 1734–1748 (2023).\n\nRhaman, M. S. et al. Opportunities and challenges in advancing plant research with single-cell omics. Genomics Proteomics Bioinformatics 22, qzae026 (2024).\n\nQin, Y. et al. Single-cell RNA-seq reveals fate determination control of an individual fibre cell initiation in cotton (Gossypium hirsutum). Plant Biotechnol. J. 20, 2372–2388 (2022).\n\nWang, Y. et al. A spatial transcriptome map of the developing maize ear. Nat. Plants 10, 815–827 (2024).\n\nChau, T. N. et al. Advancing plant single-cell genomics with foundation models. Curr. Opin. Plant Biol. 82, 102666 (2024).\n\nZhang, X. et al. A spatially resolved multi-omic single-cell atlas of soybean development. Cell 188, 550–567 (2024).\n\nTosches, M. A. & Lee, H. J. Cellular atlases of the entire mouse brain. Nature 624, 253–255 (2023).\n\nTuncel, A., Pan, C., Clem, J. S., Liu, D. & Qi, Y. CRISPR–Cas applications in agriculture and plant research. Nat. Rev. Mol. Cell Biol. 26, 419–441 (2025).\n\nLiu, H. J. et al. High-throughput CRISPR/Cas9 mutagenesis streamlines trait gene identification in maize. Plant Cell 32, 1397–1413 (2020).\n\nBai, M. et al. Generation of a multiplex mutagenesis population via pooled CRISPR–Cas9 in soya bean. Plant Biotechnol. J. 18, 721–731 (2020).\n\nMeng, X. et al. Construction of a genome-wide mutant library in rice using CRISPR/Cas9. Mol. Plant 10, 1238–1241 (2017).\n\nBi, M. et al. Construction of transcription factor mutagenesis population in tomato using a pooled CRISPR/Cas9 plasmid library. Plant Physiol. Biochem. 205, 108094 (2023).\n\nHe, J. et al. Genome-scale targeted mutagenesis in Brassica napus using a pooled CRISPR library. Genome Res. 33, 798–809 (2023).\n\nLi, C. et al. Targeted, random mutagenesis of plant genes with dual cytosine and adenine base editors. Nat. Biotechnol. 38, 875–882 (2020).\n\nXu, R. et al. Identification of herbicide resistance OsACC1 mutations via in planta prime-editing-library screening in rice. Nat. Plants 7, 888–892 (2021).\n\nBeying, N. et al. CRISPR–Cas9-mediated induction of heritable chromosomal translocations in Arabidopsis. Nat. Plants 6, 638–645 (2020).\n\nRönspies, M. et al. CRISPR–Cas-mediated chromosome engineering for crop improvement and synthetic biology. Nat. Plants 7, 566–573 (2021).\n\nSun, C. et al. Precise integration of large DNA sequences in plant genomes using PrimeRoot editors. Nat. Biotechnol. 42, 316–327 (2024).\n\nDong, O. X. et al. Marker-free carotenoid-enriched rice generated through targeted gene insertion using CRISPR-Cas9. Nat. Commun. 11, 1178 (2020).\n\nLu, Y. et al. A donor-DNA-free CRISPR/Cas-based approach to gene knock-up in rice. Nat. Plants 7, 1445–1452 (2021).\n\nLi, S. et al. Genome-edited powdery mildew resistance in wheat without growth penalties. Nature 602, 455–460 (2022). This study demonstrates the ability to use multiplex genome editing to breed elite wheat germplasm with enhanced disease resistance and increased yields through altering chromatin structure.\n\nSchwartz, C. et al. CRISPR–Cas9-mediated 75.5-Mb inversion in maize. Nat. Plants 6, 1427–1431 (2020).\n\nRönspies, M. et al. CRISPR/Cas-mediated chromosome engineering: opening up a new avenue for plant breeding. J. Exp. Bot. 72, 177–183 (2021).\n\nRodríguez-Leal, D. et al. Engineering quantitative trait variation for crop improvement by genome editing. Cell 171, 470–480 (2017). This study presents a new approach to regulate gene transcription and explore the biology of quantitative trait loci using CRISPR–Cas9.\n\nXue, C. et al. Tuning plant phenotypes by precise, graded downregulation of gene expression. Nat. Biotechnol. 41, 1758–1764 (2023). This study introduces a new strategy to downregulate protein translation and precisely modulate plant phenotypes by engineering uORFs.\n\nZhang, H. et al. Genome editing of upstream open reading frames enables translational control in plants. Nat. Biotechnol. 36, 894–898 (2018).\n\nXing, S. et al. Fine-tuning sugar content in strawberry. Genome Biol. 21, 230 (2020).\n\nSong, X. et al. Targeting a gene regulatory element enhances rice grain yield by decoupling panicle number and size. Nat. Biotechnol. 40, 1403–1411 (2022).\n\nTian, J. et al. Engineering disease-resistant plants with alternative translation efficiency by switching uORF types through CRISPR. Sci. China Life Sci. 67, 1715–1726 (2024).\n\nKim, N. et al. Deep learning models to predict the editing efficiencies and outcomes of diverse base editors. Nat. Biotechnol. 42, 484–497 (2024).\n\nYu, G. et al. Prediction of efficiencies for diverse prime editing systems in multiple cell types. Cell 186, 2256–2272 (2023).\n\nReplogle, J. M. et al. Mapping information-rich genotype-phenotype landscapes with genome-scale Perturb-seq. Cell 185, 2559–2575 (2022).\n\nJiang, K. et al. Rapid in silico directed evolution by a protein language model with EVOLVEpro. Science 387, eadr6006 (2024).\n\nHe, Y. et al. Protein language models-assisted optimization of a uracil-N-glycosylase variant enables programmable T-to-G and T-to-C base editing. Mol. Cell 84, 1257–1270 (2024).\n\nHuang, J. et al. Discovery of deaminase functions by structure-based protein clustering. Cell 186, 3182–3195 (2023).\n\nPacesa, M. et al. Past, present, and future of CRISPR genome editing technologies. Cell 187, 1076–1100 (2024).\n\nWang, J. et al. Scaffolding protein functional sites using deep learning. Science 377, 387–394 (2022).\n\nQu, Y. et al. CRISPR-GPT: an LLM agent for automated design of gene-editing experiments. Preprint at bioRxiv https://doi.org/10.1101/2024.04.25.591003 (2024).\n\nHuang, P. S. et al. The coming of age of de novo protein design. Nature 537, 320–327 (2016).\n\nBennett, N. R. et al. Atomically accurate de novo design of antibodies with RFdiffusion. Preprint at bioRxiv https://doi.org/10.1101/2024.03.14.585103 (2024). This research proposed a computational design algorithm that can design antibodies to bind user-specified epitopes.\n\nSesterhenn, F. et al. De novo protein design enables the precise induction of RSV-neutralizing antibodies. Science 368, eaay5051 (2020).\n\nNotin, P. et al. Machine learning for functional protein design. Nat. Biotechnol. 42, 216–228 (2024).\n\nZambaldi, V. et al. De novo design of high-affinity protein binders with AlphaProteo. Preprint at https://doi.org/10.48550/arXiv.2409.08022 (2024).\n\nBaker, D. & Church, G. Protein design meets biosecurity. Science 383, 349 (2024).\n\nYeh, A. H. et al. De novo design of luciferases using deep learning. Nature 614, 774–780 (2023).\n\nWang, J. et al. Protein design using structure-prediction networks: AlphaFold and RoseTTAFold as protein structure foundation models. Cold Spring Harbor Perspect. Biol. 16, a041472 (2024).\n\nCao, L. et al. Design of protein-binding proteins from the target structure alone. Nature 605, 551–560 (2022). This study provides a general approach to design protein binders.\n\nWatson, J. L. et al. De novo design of protein structure and function with RFdiffusion. Nature 620, 1089–1100 (2023).\n\nWu, K. et al. Sequence-specific targeting of intrinsically disordered protein regions. Preprint at bioRxiv https://doi.org/10.1101/2024.07.15.603480 (2024).\n\nKourelis, J. et al. NLR immune receptor–nanobody fusions confer plant disease resistance. Science 379, 934–939 (2023).\n\nOrtiz, D. et al. Recognition of the Magnaporthe oryzae effector AVR-Pia by the decoy domain of the rice NLR immune receptor RGA5. Plant Cell 29, 156–168 (2017).\n\nYang, J. et al. Enzymatic degradation of deoxynivalenol with the engineered detoxification enzyme Fhb7. JACS Au 4, 619–634 (2024).\n\nFrank, C. et al. Scalable protein design using optimization in a relaxed sequence space. Science 386, 439–445 (2024).\n\nHerud-Sikimić, O. et al. A biosensor for the direct visualization of auxin. Nature 592, 768–772 (2021).\n\nLi, W. et al. Tissue-specific accumulation of pH-sensing phosphatidic acid determines plant stress tolerance. Nat. Plants 5, 1012–1021 (2019).\n\nAn, L. et al. Binding and sensing diverse small molecules using shape-complementary pseudocycles. Science 385, 276–282 (2024).\n\nKrishna, R. et al. Generalized biomolecular modeling and design with RoseTTAFold All-Atom. Science 384, eadl2528 (2024). This study develops RoseTTAFold All-Atom and RoseTTAFold diffusion All-Atom, which allow researchers to predict protein–biomolecule complexes and design small molecule binders, respectively.\n\nLu, L. et al. De novo design of drug-binding proteins with predictable binding energy and specificity. Science 384, 106–112 (2024).\n\nHoraruang, W. et al. Engineering a K+ channel ‘sensory antenna’ enhances stomatal kinetics, water use efficiency and photosynthesis. Nat. Plants 8, 1262–1274 (2022).\n\nWang, X. et al. Structural insights into ion selectivity and transport mechanisms of Oryza sativa HKT2;1 and HKT2;2/1 transporters. Nat. Plants 10, 633–644 (2024).\n\nXu, C. et al. Computational design of transmembrane pores. Nature 585, 129–134 (2020).\n\nScott, A. J. et al. Constructing ion channels from water-soluble α-helical barrels. Nat. Chem. 13, 643–650 (2021).\n\nBi, G. et al. The ZAR1 resistosome is a calcium-permeable channel triggering plant immune signaling. Cell 184, 3528–3541 (2021).\n\nWang, W. et al. WeiTsing, a pericycle-expressed ion channel, safeguards the stele to confer clubroot resistance. Cell 186, 2656–2671 (2023).\n\nFörderer, A. et al. A wheat resistosome defines common principles of immune receptor channels. Nature 610, 532–539 (2022).\n\nLiu, F. et al. Activation of the helper NRC4 immune receptor forms a hexameric resistosome. Cell 187, 4877–4889 (2024).\n\nBerhanu, S. et al. Sculpting conducting nanopore size and shape through de novo protein design. Science 385, 282–288 (2024).\n\nLiu, Y. et al. Bottom-up design of calcium channels from defined selectivity filter geometry. Preprint at bioRxiv https://doi.org/10.1101/2024.12.19.629320 (2024).\n\nZheng, K. et al. ESM All-Atom: multi-scale protein language model for unified molecular modeling. Preprint at https://doi.org/10.48550/arXiv.2403.12995 (2024).\n\nCollins, A. S. P. et al. Parallel, continuous monitoring and quantification of programmed cell death in plant tissue. Adv. Sci. 11, 2400225 (2024).\n\nBorowsky, A. T. & Bailey-Serres, J. Rewiring gene circuitry for plant improvement. Nat. Genet. 56, 1574–1582 (2024).\n\nOliva, R. et al. Broad-spectrum resistance to bacterial blight in rice using genome editing. Nat. Biotechnol. 37, 1344–1350 (2019).\n\nChen, Z. et al. De novo design of protein logic gates. Science 368, 78–84 (2020).\n\nRui, Z. et al. High-throughput proximal ground crop phenotyping systems—a comprehensive review. Comput. Electron. Agric. 224, 109108 (2024).\n\nLi, G. et al. The sequences of 1504 mutants in the model rice variety Kitaake facilitate rapid functional genomic studies. Plant Cell 29, 1218–1231 (2017).\n\nLynch, J. P. Harnessing root architecture to address global challenges. Plant J. 109, 415–431 (2022).\n\nScharwies, J. D. et al. Moisture-responsive root-branching pathways identified in diverse maize breeding germplasm. Science 387, 666–673 (2025).\n\nShi, X. et al. Ultra-wideband microwave imaging system for root phenotyping. Sensors 22, 2031 (2022).\n\nNagel, K. A. et al. GROWSCREEN-Rhizo is a novel phenotyping robot enabling simultaneous measurements of root and shoot growth for plants grown in soil-filled rhizotrons. Funct. Plant Biol. 39, 891–904 (2012).\n\nYu, P. et al. Seedling root system adaptation to water availability during maize domestication and global expansion. Nat. Genet. 56, 1245–1256 (2024). This study reveals that reshaping maize root architecture by reducing the seed root number and increasing lateral root density enhances drought resilience.\n\nHuang, X. et al. Genome-wide association studies of 14 agronomic traits in rice landraces. Nat. Genet. 42, 961–967 (2010).\n\nWu, X. et al. Using high-throughput multiple optical phenotyping to decipher the genetic architecture of maize drought tolerance. Genome Biol. 22, 185 (2021). This study utilized a HTP system to extract drought tolerance phenotypes in maize and employed genetic methods such as GWAS in the identification of genes controlling drought resistance in maize.\n\nAl-Tamimi, N. et al. Salinity tolerance loci revealed in rice using high-throughput non-invasive phenotyping. Nat. Commun. 7, 13342 (2016). This work uses HTP and GWAS to study salt tolerance in rice, thereby gaining a deeper understanding of the early response of rice to salinity.\n\nGao, J. et al. Deciphering genetic basis of developmental and agronomic traits by integrating high-throughput optical phenotyping and genome-wide association studies in wheat. Plant Biotechnol. J. 21, 1966–1977 (2023).\n\nLi, B. et al. Phenomics-based GWAS analysis reveals the genetic architecture for drought resistance in cotton. Plant Biotechnol. J. 18, 2533–2544 (2020).\n\nMorton, M. et al. Deciphering salt stress responses in Solanum pimpinellifolium through high-throughput phenotyping. Plant J. 119, 2514–2537 (2024).\n\nWang, W. et al. Integration of high-throughput phenotyping, GWAS, and predictive models reveals the genetic architecture of plant height in maize. Mol. Plant 16, 354–373 (2023).\n\nCrain, J. et al. Combining high-throughput phenotyping and genomic information to increase prediction and selection accuracy in wheat breeding. Plant Genome 11, 170043 (2018).\n\nLane, H. M. et al. Phenomic selection and prediction of maize grain yield from near-infrared reflectance spectroscopy of kernels. Plant Phenome J. 3, e20002 (2020).\n\nTross, M. C. et al. Data driven discovery and quantification of hyperspectral leaf reflectance phenotypes across a maize diversity panel. Plant Phenome J. 7, e20106 (2024).\n\nRincent, R. et al. Phenomic selection is a low-cost and high-throughput method based on indirect predictions: proof of concept on wheat and poplar. G3 8, 3961–3972 (2018).\n\nGibbs, J. A. et al. Active vision and surface reconstruction for 3D plant shoot modelling. IEEE/ACM Trans. Comput. Biol. Bioinformatics 17, 1907–1917 (2020).\n\nJin, S. et al. Lidar sheds new light on plant phenomics for plant breeding and management: recent advances and future prospects. ISPRS 171, 202–223 (2021).\n\nWagner, R. et al. Imagine all the plants: evaluation of a light-field camera for on-site crop growth monitoring. Remote Sens. 8, 823 (2016).\n\nChang, J. et al. EI-MVSNet: epipolar-guided multi-view stereo network with interval-aware label. IEEE Trans. Image Process. 33, 753–766 (2024).\n\nGu, Y. et al. Novel 3D photosynthetic traits derived from the fusion of UAV LiDAR point cloud and multispectral imagery in wheat. Remote Sens. Environ. 311, 114244 (2024).\n\nZhang, Y. et al. Dissecting the phenotypic components and genetic architecture of maize stem vascular bundles using high-throughput phenotypic analysis. Plant Biotechnol. J. 19, 35–50 (2021).\n\nZhang, Y. et al. Plant microphenotype: from innovative imaging to computational analysis. Plant Biotechnol. J. 22, 802–818 (2024).\n\nLiu, Z. et al. Sustained deep-tissue voltage recording using a fast indicator evolved for two-photon microscopy. Cell 185, 3408–3425 (2022).\n\nOvečka, M. et al. Multiscale imaging of plant development by light-sheet fluorescence microscopy. Nat. Plants 4, 639–650 (2018). This work shows that light-sheet fluorescence microscopy methods collectively represent a major breakthrough in the development of bio-imaging of living multicellular organisms.\n\nPayne, W. Z. & Kurouski, D. Raman spectroscopy enables phenotyping and assessment of nutrition values of plants: a review. Plant Methods 17, 78 (2021).\n\nGonçalves, M. T. V. et al. Near-infrared spectroscopy outperforms genomics for predicting sugarcane feedstock quality traits. PLoS ONE 16, e0236853 (2021).\n\nSineshchekov, V. A. Applications of fluorescence spectroscopy in the investigation of plant phytochrome invivo. Plant Physiol. Biochem. 208, 108434 (2024).\n\nBarnes, M. et al. Fourier transform infrared spectroscopy as a non-destructive method for analysing herbarium specimens. Biol. Lett. 19, 20220546 (2023).\n\nHacisalihoglu, G. & Armstrong, P. Crop seed phenomics: focus on non-destructive functional trait phenotyping methods and applications. Plants 12, 1177 (2023).\n\nKou, T. et al. Terahertz spectroscopy for accurate identification of Panax quinquefolium basing on nonconjugated 24(R)-pseudoginsenoside F 11 . Plant Phenomics 2021, 6793457 (2021).\n\nHorn, P. J. & Chapman, K. D. Imaging plant metabolism in situ. J. Exp. Bot. 75, 1654–1670 (2024).\n\nSong, P. et al. High-throughput phenotyping: breaking through the bottleneck in future crop breeding. Crop J. 9, 633–645 (2021).\n\nWen, W. et al. Standard framework construction of technology and equipment for big data in crop phenomics. Engineering 42, 175–184 (2024).\n\nTeng, Z. et al. Panicle-Cloud: an open and AI-powered cloud computing platform for quantifying rice panicles from drone-collected imagery to enable the classification of yield production in rice. Plant Phenomics 5, 0105 (2023).\n\nWei, X. et al. A quantitative genomics map of rice provides genetic insights and guides breeding. Nat. Genet. 53, 243–253 (2021).\n\nZhang, J. et al. Engineering rice genomes towards green super rice. Curr. Opin. Plant Biol. 82, 102664 (2024).\n\nMoor, M. et al. Foundation models for generalist medical artificial intelligence. Nature 616, 259–265 (2023).\n\nZhang, K. et al. A generalist vision–language foundation model for diverse biomedical tasks. Nat. Med. 30, 3129–3141 (2024).\n\nZhu, W. et al. The CropGPT project: call for a global, coordinated effort in precision design breeding driven by AI using biological big data. Mol. Plant 17, 215–218 (2024).\n\nSharma, S. et al. DeepG2P: fusing multi-modal data to improve crop production. Preprint at https://doi.org/10.48550/arXiv.2211.05986 (2022).\n\nWang, H. et al. Horizontal gene transfer of Fhb7 from fungus underlies Fusarium head blight resistance in wheat. Science 368, eaba5435 (2020).\n\nZhang, C. et al. High-resolution satellite imagery applications in crop phenotyping: an overview. Comput. Electron. Agric. 175, 105584 (2020).\n\nJiang, Z. et al. Combining UAV-RGB high-throughput field phenotyping and genome-wide association study to reveal genetic variation of rice germplasms in dynamic response to drought stress. New Phytol. 232, 440–455 (2021).\n\nLu, S. et al. Natural variation at the soybean J locus improves adaptation to the tropics and enhances yield. Nat. Genet. 49, 773–779 (2017).\n\nQi, X. et al. Genome editing enables next-generation hybrid seed production technology. Mol. Plant 13, 1262–1269 (2020).\n\nWang, J. et al. A single transcription factor promotes both yield and immunity in rice. Science 361, 1026–1028 (2018).\n\nXu, K. et al. Sub1A is an ethylene-response-factor-like gene that confers submergence tolerance to rice. Nature 442, 705–708 (2006).\n\nRistaino, J. B. et al. The persistent threat of emerging plant disease pandemics to global food security. Proc. Natl Acad. Sci. USA 118, e2022239118 (2021).\n\nXia, K. et al. The single-cell stereo-seq reveals region-specific cell subtypes and transcriptome profiling in Arabidopsis leaves. Dev. Cell 57, 1299–1310 (2022).\n\nSun, G. et al. The maize single-nucleus transcriptome comprehensively describes signaling networks governing movement and development of grass stomata. Plant Cell 34, 1890–1911 (2022).\n\nYe, H. et al. A novel in vivo genome editing doubled haploid system for Zea mays L. Nat. Plants 10, 1493–1501 (2024).",
      "embedding": [
        0.029614092782139778,
        0.037504132837057114,
        0.06265495717525482,
        0.001331973122432828,
        0.0030751063022762537,
        -0.03086211532354355,
        0.03342162072658539,
        0.0549129880964756,
        -0.015526246279478073,
        -0.004870460834354162,
        0.019365500658750534,
        -0.034521572291851044,
        0.002445806749165058,
        -0.0137282470241189,
        -0.005579083692282438,
        -0.032490890473127365,
        -0.015134916640818119,
        -0.016224293038249016,
        0.0453941747546196,
        -0.03545229882001877,
        0.006483370903879404,
        0.01745116151869297,
        0.011972554959356785,
        0.02971985749900341,
        0.0019434248097240925,
        -0.06878931075334549,
        0.0355580635368824,
        0.06151270121335983,
        -0.00046668638242408633,
        0.005304095800966024,
        -0.009777938947081566,
        -0.015854116529226303,
        -0.0013313121162354946,
        -0.02633539028465748,
        -0.04937092214822769,
        0.030185222625732422,
        0.02407202683389187,
        -0.018551113083958626,
        0.017292514443397522,
        -0.015177222900092602,
        0.016181986778974533,
        0.01748289167881012,
        -0.014733010903000832,
        0.03513500466942787,
        -0.008376557379961014,
        -0.01358017697930336,
        -0.02637769654393196,
        -0.022781698033213615,
        -0.02138560637831688,
        0.020814476534724236,
        -0.017080985009670258,
        -0.028746822848916054,
        -0.04361732676625252,
        -0.042919281870126724,
        -0.035938818007707596,
        0.024325862526893616,
        -0.03217359632253647,
        0.022612474858760834,
        -0.011813907884061337,
        0.02728727087378502,
        0.012670600786805153,
        0.021512523293495178,
        0.035240769386291504,
        0.017345396801829338,
        -0.06269726902246475,
        -0.029508328065276146,
        0.004087802488356829,
        -0.0075410171411931515,
        -0.01892128959298134,
        -0.03251204267144203,
        0.01676369272172451,
        -0.007392946630716324,
        -0.05229002609848976,
        -0.022549016401171684,
        0.030565975233912468,
        -0.06548944860696793,
        -0.05842437595129013,
        0.05051318183541298,
        0.00666845915839076,
        -0.018656877800822258,
        -0.001854846952483058,
        0.0007377082365565002,
        0.03678493574261665,
        -0.06354337930679321,
        0.014754164032638073,
        -0.027900706976652145,
        0.013231153599917889,
        0.008138587698340416,
        -0.10111097246408463,
        0.033210091292858124,
        -0.025510426610708237,
        0.00757803488522768,
        -0.011782178655266762,
        0.02971985749900341,
        -0.026102706789970398,
        0.02191442809998989,
        0.020803900435566902,
        0.0014317885506898165,
        0.021237535402178764,
        0.07145457714796066,
        -0.010433679446578026,
        -0.02400856837630272,
        0.01873091422021389,
        0.05525143817067146,
        0.027181506156921387,
        0.01241676602512598,
        0.016319479793310165,
        -0.039344437420368195,
        0.056901365518569946,
        -0.025827718898653984,
        -0.0193549245595932,
        -0.04632490128278732,
        -0.06637787073850632,
        0.008841922506690025,
        -0.021068312227725983,
        -0.06290879100561142,
        -0.030692892149090767,
        -0.04203085973858833,
        -0.009301997721195221,
        -0.00915392767637968,
        -0.04674796015024185,
        0.04598645493388176,
        -0.00725016463547945,
        -0.003863052697852254,
        -0.023120146244764328,
        -0.04006363824009895,
        -0.0012473614187911153,
        -0.03471194580197334,
        -0.02023277059197426,
        -0.03771566227078438,
        -0.016805997118353844,
        0.0677739679813385,
        0.020581794902682304,
        -0.012279272079467773,
        -0.026948824524879456,
        -0.046240292489528656,
        0.0290006585419178,
        0.029212187975645065,
        0.012078319676220417,
        -0.028725670650601387,
        -0.005690136458724737,
        -0.003064529737457633,
        0.0068588354624807835,
        0.02798531763255596,
        -0.020676983520388603,
        -0.05186696723103523,
        -0.008381846360862255,
        -0.0088895158842206,
        -0.005066125188022852,
        0.05034395679831505,
        0.0018508807988837361,
        0.014796470291912556,
        -0.02072986587882042,
        0.007937634363770485,
        0.008566933684051037,
        0.0024815022479742765,
        -0.03538884222507477,
        0.04818635806441307,
        0.030883267521858215,
        -0.03733491152524948,
        0.01574835181236267,
        0.01971452496945858,
        -0.031115951016545296,
        0.024516237899661064,
        0.0025581817608326674,
        -0.001607622136361897,
        -0.010787990875542164,
        -0.005753595381975174,
        -0.06163961812853813,
        -0.007964075542986393,
        -0.024558544158935547,
        0.006546829827129841,
        -0.01685887947678566,
        0.02191442809998989,
        -0.022950921207666397,
        -0.01725021004676819,
        -0.0066949003376066685,
        0.012903283350169659,
        -0.05630908161401749,
        -0.0450134202837944,
        -0.025658495724201202,
        0.020624101161956787,
        -0.012956165708601475,
        0.02210480533540249,
        0.02152309939265251,
        -0.031348634511232376,
        -0.003408264834433794,
        -0.03454272449016571,
        -0.012258118949830532,
        -0.008117434568703175,
        -0.0007932346197776496,
        0.02567964978516102,
        0.02787955291569233,
        -0.03906945139169693,
        0.05355920270085335,
        -0.012036013416945934,
        0.05368611961603165,
        -0.003358026733621955,
        0.03752528503537178,
        -0.035642676055431366,
        0.033506229519844055,
        0.03306201845407486,
        -0.0022845156490802765,
        -0.025108519941568375,
        0.0061978064477443695,
        -0.042559683322906494,
        0.0037017615977674723,
        -0.014341682195663452,
        -0.050893932580947876,
        0.013834011740982533,
        0.05419379100203514,
        0.017853068187832832,
        0.02811223454773426,
        0.01797998510301113,
        -0.014309952966868877,
        -0.025108519941568375,
        -0.0058752247132360935,
        -0.0027287271805107594,
        -0.027075741440057755,
        0.030714044347405434,
        -0.01533586997538805,
        0.006483370903879404,
        0.0390271432697773,
        0.033971596509218216,
        -0.03179284557700157,
        -0.036848392337560654,
        -0.007726105395704508,
        0.008344828151166439,
        0.02608155459165573,
        -0.02667383663356304,
        0.01760980859398842,
        0.006192518398165703,
        -0.026758449152112007,
        -0.03670032322406769,
        -0.01695406809449196,
        -0.0017424720572307706,
        -0.013696517795324326,
        -0.016742538660764694,
        0.003080394584685564,
        0.009502951055765152,
        0.01955587789416313,
        0.011835061013698578,
        -0.022675933316349983,
        0.046240292489528656,
        -0.017112715169787407,
        0.05656291916966438,
        0.002502655377611518,
        -0.025002755224704742,
        -0.018360737711191177,
        0.008847210556268692,
        -0.0045320140197873116,
        0.01464839931577444,
        0.05377073213458061,
        -0.07517749071121216,
        0.04721332713961601,
        -0.04306735098361969,
        0.012628295458853245,
        0.019524147734045982,
        0.006747782696038485,
        0.042496223002672195,
        -0.01958760805428028,
        0.031200561672449112,
        -0.06743551790714264,
        0.014066694304347038,
        0.011813907884061337,
        0.025235438719391823,
        0.061681926250457764,
        0.0018707116832956672,
        -0.005222128238528967,
        -0.0225067101418972,
        0.046663347631692886,
        0.004931275267153978,
        0.006060312502086163,
        -0.03627726435661316,
        -0.05652061104774475,
        -0.005177177954465151,
        -0.04258083552122116,
        0.04560570418834686,
        -0.04717101901769638,
        0.0292544923722744,
        -0.05618216469883919,
        -0.024029720574617386,
        0.031115951016545296,
        -0.011010096408426762,
        -0.011010096408426762,
        -0.003270770888775587,
        0.021269265562295914,
        0.01965106651186943,
        0.031602468341588974,
        -0.04209431633353233,
        0.009502951055765152,
        8.134786185109988e-05,
        0.047678690403699875,
        0.005965124350041151,
        0.0391540601849556,
        -0.021999040618538857,
        0.016086798161268234,
        0.06032813712954521,
        -0.004857240244746208,
        -0.0013960929354652762,
        0.07183533161878586,
        -0.0194501131772995,
        0.04040208458900452,
        -0.027371883392333984,
        -0.021343300119042397,
        0.019397230818867683,
        -0.07555824518203735,
        -0.023797038942575455,
        0.0211211945861578,
        -0.008302522823214531,
        0.01924915984272957,
        0.03769451007246971,
        0.030354445800185204,
        -0.019460689276456833,
        -0.026758449152112007,
        -0.017493467777967453,
        0.03849831968545914,
        -0.03621380403637886,
        0.013960929587483406,
        0.022549016401171684,
        -0.014362835325300694,
        0.03456387668848038,
        -0.015832962468266487,
        0.01340037677437067,
        -0.04530956223607063,
        -0.012850400991737843,
        0.015420481562614441,
        0.004888969473540783,
        0.028958352282643318,
        -0.02447393350303173,
        -0.005446877796202898,
        -0.0058487835340201855,
        0.00430461997166276,
        -0.003508741268888116,
        -0.03777912259101868,
        0.008635681122541428,
        0.0035669116768985987,
        -0.0036911852657794952,
        0.00043594854651018977,
        0.024791225790977478,
        -0.02394510991871357,
        -0.049117088317871094,
        -0.05986277386546135,
        0.04437883198261261,
        -0.004212075844407082,
        -0.002533062594011426,
        -0.010862026363611221,
        0.0027551683597266674,
        -0.0031623621471226215,
        -0.004143328871577978,
        0.04877864196896553,
        -0.007509287912398577,
        0.024198943749070168,
        0.015431057661771774,
        -0.04158664867281914,
        0.04021170735359192,
        -0.011369696818292141,
        -0.03758874535560608,
        -0.002366483211517334,
        -0.0453941747546196,
        -0.020253924652934074,
        0.012776365503668785,
        -0.0009294065530411899,
        0.03175053745508194,
        0.01869918406009674,
        -0.022252876311540604,
        -0.03771566227078438,
        -0.023373980075120926,
        -0.01316769514232874,
        -0.014225341379642487,
        -0.03735606372356415,
        0.021364452317357063,
        -0.010988944210112095,
        -0.04966706410050392,
        -0.037144534289836884,
        0.027604565024375916,
        0.003958240617066622,
        0.02191442809998989,
        -0.028366070240736008,
        0.011729296296834946,
        0.03572728857398033,
        0.03407736122608185,
        -0.015208952128887177,
        -0.03103133849799633,
        -0.02052891254425049,
        0.034754253923892975,
        0.03450042009353638,
        -0.023183604702353477,
        -0.044336527585983276,
        0.022189415991306305,
        0.0324062779545784,
        -0.0386463925242424,
        -0.016647350043058395,
        -0.010613479651510715,
        -0.0030328005086630583,
        -0.009984180331230164,
        -0.01859341934323311,
        -0.0009241183288395405,
        0.03623495623469353,
        -0.008704427629709244,
        -0.024918144568800926,
        -0.04112128168344498,
        -0.028683364391326904,
        0.016869457438588142,
        -0.0153993284329772,
        -0.03913290798664093,
        0.03799065202474594,
        0.04560570418834686,
        -0.007884752005338669,
        0.012723483145236969,
        -0.0177790317684412,
        -0.05313614383339882,
        0.04105782508850098,
        -0.01507145818322897,
        0.01653100922703743,
        -0.030946727842092514,
        -0.03873100131750107,
        0.016615621745586395,
        -0.004278178792446852,
        0.03149670362472534,
        0.007784275803714991,
        0.011771601624786854,
        0.03443695977330208,
        -0.023437438532710075,
        -0.009079892188310623,
        0.014574364759027958,
        0.029402563348412514,
        -0.04129050672054291,
        0.010259168222546577,
        -0.054659154266119,
        -0.05550527200102806,
        0.014584940858185291,
        0.03365430235862732,
        -0.061681926250457764,
        -0.05639369413256645,
        0.03676377981901169,
        0.025087367743253708,
        0.03727145120501518,
        0.058043621480464935,
        0.01709156297147274,
        -0.02864105813205242,
        0.019735677167773247,
        0.00875730998814106,
        -0.03414081782102585,
        0.012681177817285061,
        0.0037916614674031734,
        -0.03274472430348396,
        0.054659154266119,
        -0.044632669538259506,
        -0.030587127432227135,
        -0.004209431819617748,
        0.003519317600876093,
        0.03930213302373886,
        0.028429528698325157,
        -0.04645182192325592,
        -0.00045577940181829035,
        -0.015103187412023544,
        -0.08926533907651901,
        0.04632490128278732,
        0.05068240314722061,
        0.006483370903879404,
        -0.029508328065276146,
        -0.00352196185849607,
        0.01866745576262474,
        0.007123246788978577,
        0.04789021983742714,
        -0.006081465631723404,
        0.02680075354874134,
        -0.030756350606679916,
        0.01432052906602621,
        -0.03942904993891716,
        -0.015431057661771774,
        -0.03471194580197334,
        0.01497626956552267,
        0.006605000235140324,
        -0.013654212467372417,
        0.011517766863107681,
        -0.040169402956962585,
        -0.029042964801192284,
        0.015145493671298027,
        -0.035409994423389435,
        -0.010417815297842026,
        0.004688016604632139,
        0.008656834252178669,
        -0.017430009320378304,
        -0.0258488729596138,
        -0.0031094797886908054,
        -0.0088895158842206,
        0.022168263792991638,
        -0.012543683871626854,
        0.03431004285812378,
        -0.03894253075122833,
        0.07890040427446365,
        -0.006430488545447588,
        0.02603924833238125,
        -0.03450042009353638,
        -0.04772099480032921,
        0.001450297306291759,
        -0.03037559799849987,
        0.008471745997667313,
        0.017366550862789154,
        0.04313081130385399,
        -0.029614092782139778,
        0.019693372771143913,
        0.0021747848950326443,
        -0.0015891133807599545,
        0.04275005683302879,
        -0.026250777766108513,
        0.01464839931577444,
        0.02299322746694088,
        0.022062499076128006,
        0.0011534953955560923,
        0.02292976900935173,
        0.0322793610394001,
        0.036425333470106125,
        0.0645587220788002,
        0.033442772924900055,
        0.0030698180198669434,
        0.0037678645458072424,
        -0.009635156951844692,
        0.03244858607649803,
        -0.0041909231804311275,
        -0.006948735564947128,
        -0.006155500654131174,
        -0.021999040618538857,
        -0.040359776467084885,
        -0.04734024405479431,
        -0.017525197938084602,
        -0.018329007551074028,
        -0.04632490128278732,
        0.01896359585225582,
        -0.016605045646429062,
        0.029508328065276146,
        0.02063467726111412,
        -0.05914357304573059,
        -0.02883143536746502,
        0.0453941747546196,
        0.022443251684308052,
        -0.051486216485500336,
        0.005446877796202898,
        -0.011401426047086716,
        0.011285084299743176,
        0.04188278689980507,
        0.01218408439308405,
        -0.039217520505189896,
        0.012998471967875957,
        -0.012617719359695911,
        -0.047509465366601944,
        0.026610378175973892,
        0.022168263792991638,
        0.030333291739225388,
        0.02948717586696148,
        0.02959294058382511,
        -0.015208952128887177,
        -0.015600280836224556,
        0.023606663569808006,
        -0.002386314095929265,
        -0.019397230818867683,
        0.00946064479649067,
        0.0105605972930789,
        -0.030333291739225388,
        -0.02859875187277794,
        -0.004481775686144829,
        -0.02889489382505417,
        0.009883703663945198,
        0.010047638788819313,
        0.00785831082612276,
        -0.021872123703360558,
        -0.01064520888030529,
        -0.003080394584685564,
        -0.05034395679831505,
        -0.01082500908523798,
        0.027054589241743088,
        -0.03949250653386116,
        -0.01604449190199375,
        0.05140160396695137,
        -0.02477007359266281,
        -0.014955117367208004,
        -0.026652684435248375,
        0.015568551607429981,
        -0.011010096408426762,
        -0.033738914877176285,
        -0.0016195207135751843,
        0.028366070240736008,
        -0.016181986778974533,
        0.02794301137328148,
        -0.0015045016771182418,
        0.025595037266612053,
        0.028366070240736008,
        0.04915939271450043,
        0.04734024405479431,
        0.01685887947678566,
        0.0291275754570961,
        -0.011591802351176739,
        0.007028058636933565,
        -0.031412091106176376,
        -0.005370198283344507,
        0.031708233058452606,
        -0.007070364896208048,
        0.018191514536738396,
        -0.021724052727222443,
        0.003318364964798093,
        0.035050395876169205,
        0.00044586395961232483,
        -0.028958352282643318,
        -0.006060312502086163,
        -0.008418863639235497,
        0.017006950452923775,
        0.0129244364798069,
        -0.01031733863055706,
        -0.012765789404511452,
        0.002455061301589012,
        -0.0014621958835050464,
        0.0012341408291831613,
        -0.017408855259418488,
        -0.0031332767102867365,
        0.0384560152888298,
        0.023754732683300972,
        0.02512967400252819,
        -0.03464848920702934,
        -0.001423856127075851,
        0.02447393350303173,
        0.030354445800185204,
        0.0031227003782987595,
        0.0007469626143574715,
        -0.027266118675470352,
        0.015885844826698303,
        6.46155676804483e-05,
        -0.016689656302332878,
        0.009455356746912003,
        0.045182645320892334,
        0.005153380800038576,
        -0.020592371001839638,
        0.021375028416514397,
        0.0014344325754791498,
        0.017662690952420235,
        0.03263895958662033,
        -0.01784249022603035,
        -0.011285084299743176,
        -0.014140729792416096,
        0.019238583743572235,
        0.02141733467578888,
        0.013897471129894257,
        -0.02180866338312626,
        0.02614501304924488,
        -0.027012282982468605,
        -0.0021800731774419546,
        -0.014140729792416096,
        0.020454877987504005,
        0.00045842351391911507,
        -0.015885844826698303,
        -0.044759586453437805,
        0.0019976291805505753,
        -0.006451641675084829,
        0.011708143167197704,
        -0.003125344403088093,
        -0.0011799365747720003,
        -0.015758927911520004,
        0.014119576662778854,
        0.006234824191778898,
        -0.010624055750668049,
        -0.02204134687781334,
        0.01695406809449196,
        0.009984180331230164,
        -0.01705983281135559,
        0.03418312594294548,
        0.007927058264613152,
        0.03847716748714447,
        -0.00821791123598814,
        0.013484988361597061,
        0.04776330292224884,
        0.023098992183804512,
        -0.007102094125002623,
        0.011115861125290394,
        0.00732419965788722,
        -0.013802282512187958,
        0.003738779341802001,
        -0.024643156677484512,
        0.0029561209958046675,
        -0.0005003988626413047,
        -0.024622002616524696,
        0.016129104420542717,
        -0.02352205105125904,
        0.007784275803714991,
        0.045774925500154495,
        -0.010936061851680279,
        0.02221057005226612,
        -0.00020624100579880178,
        -0.005758883431553841,
        -0.03974634408950806,
        -0.016393516212701797,
        -0.007641493808478117,
        -0.04954014718532562,
        -0.007911193184554577,
        0.011359119787812233,
        0.016943491995334625,
        -0.002624284476041794,
        0.014108999632298946,
        -0.0358753576874733,
        -0.021470217034220695,
        0.031412091106176376,
        0.03490232303738594,
        -0.004386587534099817,
        -0.04742485284805298,
        -0.005695424508303404,
        0.02165001817047596,
        -0.013960929587483406,
        -0.007778987754136324,
        0.03598112240433693,
        0.030756350606679916,
        -0.02663153037428856,
        -0.01649928092956543,
        0.007556881755590439,
        0.01984144188463688,
        -0.02739303559064865,
        -0.015293563716113567,
        -0.0024841465055942535,
        0.021142346784472466,
        -0.015695469453930855,
        0.005203619133681059,
        -0.011951401829719543,
        -0.026166167110204697,
        -0.004550522658973932,
        -0.011919672600924969,
        -0.024558544158935547,
        0.000587324146181345,
        -0.025870025157928467,
        0.05114777013659477,
        -0.026969976723194122,
        -0.014669552445411682,
        0.012903283350169659,
        -0.03703876957297325,
        0.011951401829719543,
        -0.010253879241645336,
        0.04181933030486107,
        -0.005055548623204231,
        -0.025277743116021156,
        -0.036658015102148056,
        -0.03602343052625656,
        0.028069930151104927,
        -0.0045002843253314495,
        -0.029571786522865295,
        0.01554739847779274,
        -0.011517766863107681,
        -0.03483886644244194,
        -0.008905380964279175,
        -0.018614573404192924,
        0.03818102553486824,
        0.03090442158281803,
        -0.009037586860358715,
        -0.02381819114089012,
        0.004611337557435036,
        -0.018974171951413155,
        -0.056859057396650314,
        0.012385036796331406,
        -0.0019222719129174948,
        -0.052205413579940796,
        0.004103667102754116,
        -0.0017768455436453223,
        0.0002764753298833966,
        -0.01283982489258051,
        0.02847183495759964,
        0.0353676900267601,
        0.016848303377628326,
        -0.030756350606679916,
        0.012543683871626854,
        0.030523668974637985,
        0.007657358422875404,
        0.003469079500064254,
        0.029973693192005157,
        -0.0482286661863327,
        0.008138587698340416,
        -0.009286133572459221,
        0.010571173392236233,
        0.003889493877068162,
        0.003836611518636346,
        0.01012167427688837,
        0.0273295771330595,
        -0.019608760252594948,
        0.02316245064139366,
        -0.019989512860774994,
        -0.006768935360014439,
        -0.049286313354969025,
        0.019048208370804787,
        0.0019460689509287477,
        -0.017334820702672005,
        0.003151785582304001,
        -0.017884796485304832,
        0.016277175396680832,
        -0.017271362245082855,
        0.0014476531650871038,
        0.03466964140534401,
        -0.025954637676477432,
        0.028683364391326904,
        -0.03634072095155716,
        0.03268126770853996,
        -0.010470696724951267,
        -0.0615973137319088,
        -0.004748831503093243,
        0.0006828428013250232,
        0.03500808775424957,
        -0.0011330035049468279,
        -0.005690136458724737,
        0.026821907609701157,
        0.040232859551906586,
        0.0177790317684412,
        -0.03310432657599449,
        0.03919636830687523,
        -0.021660594269633293,
        0.011993708088994026,
        0.009608715772628784,
        0.033442772924900055,
        -0.0028186270501464605,
        -0.020454877987504005,
        -0.017144445329904556,
        -0.00902172178030014,
        0.014045541174709797,
        -0.026060402393341064,
        0.016647350043058395,
        0.01274463627487421,
        0.05897435173392296,
        -0.011951401829719543,
        -0.016880033537745476,
        0.002289803931489587,
        0.011718719266355038,
        -0.018741490319371223,
        -0.0013055320596322417,
        -0.01876264251768589,
        0.018022291362285614,
        0.002890018280595541,
        0.041607800871133804,
        0.021935582160949707,
        -0.03156016021966934,
        0.013633059337735176,
        0.004949783906340599,
        -0.020158736035227776,
        0.013389800675213337,
        0.0043548583053052425,
        0.0016129104187712073,
        0.05656291916966438,
        -0.02728727087378502,
        -0.02663153037428856,
        -0.018286703154444695,
        0.014098423533141613,
        -0.015378175303339958,
        -0.0019764762837439775,
        0.006917005870491266,
        0.008746733888983727,
        -0.01781076192855835,
        -0.015949305146932602,
        -0.0353042297065258,
        -0.039280980825424194,
        -0.00785831082612276,
        -0.0033712470903992653,
        0.04560570418834686,
        0.026229625567793846,
        0.020264500752091408,
        -0.01031733863055706,
        0.0129244364798069,
        0.005547353997826576,
        0.017461737617850304,
        0.0022303112782537937,
        0.02686421386897564,
        -0.009450068697333336,
        0.03329470008611679,
        -0.02335282787680626,
        -0.03211013972759247,
        -0.020518336445093155,
        0.03037559799849987,
        -0.040169402956962585,
        0.04247507080435753,
        0.017620384693145752,
        -0.030417904257774353,
        0.005478607024997473,
        0.045901842415332794,
        0.003945020027458668,
        -0.01968279480934143,
        0.0015494516119360924,
        -0.012036013416945934,
        -0.023183604702353477,
        0.017461737617850304,
        -0.03722914680838585,
        0.014013811945915222,
        0.002645437605679035,
        0.01116874348372221,
        0.010724532417953014,
        0.010507714934647083,
        0.025996943935751915,
        -0.003498164704069495,
        0.011507190763950348,
        -0.017006950452923775,
        -0.017863644286990166,
        -0.019693372771143913,
        0.013231153599917889,
        0.0013987370766699314,
        0.014161881990730762,
        -0.023839345201849937,
        0.022781698033213615,
        -0.02069813571870327,
        -0.0021734628826379776,
        -0.0037678645458072424,
        0.0008414897602051497,
        0.009608715772628784,
        -0.0034109088592231274,
        -0.030587127432227135,
        -0.00033233227441087365,
        0.04046554118394852,
        0.02138560637831688,
        0.02021161839365959,
        -0.0038656967226415873,
        0.01233215443789959,
        0.032131291925907135,
        -0.03132747858762741,
        -0.011750449426472187,
        -0.05216310918331146,
        0.02847183495759964,
        0.02538350783288479,
        0.052501555532217026,
        -0.0004207448801025748,
        -0.07572746276855469,
        0.018096325919032097,
        0.020708711817860603,
        0.01813863217830658,
        0.0081015694886446,
        -0.001644639763981104,
        0.008207334205508232,
        -0.035113852471113205,
        0.009111621417105198,
        -0.036488793790340424,
        0.008662122301757336,
        0.028619905933737755,
        -0.02204134687781334,
        -0.02699113078415394,
        0.023987416177988052,
        0.012321578338742256,
        -0.012734060175716877,
        -0.0066949003376066685,
        0.010148115456104279,
        -0.010639920830726624,
        -0.0306082796305418,
        -0.023331673815846443,
        0.015610857866704464,
        0.01241676602512598,
        -0.0739506185054779,
        0.003368603065609932,
        -0.028958352282643318,
        -0.003683252725750208,
        0.008868362754583359,
        0.004738254938274622,
        -0.00015021880972199142,
        0.038032956421375275,
        -0.032004375010728836,
        0.029825622215867043,
        -0.016287751495838165,
        0.013738824054598808,
        -0.016753114759922028,
        0.03703876957297325,
        0.04408269375562668,
        -0.017504043877124786,
        -0.016509857028722763,
        -0.011221625842154026,
        -0.006567982956767082,
        -0.004280822817236185,
        -0.03405620530247688,
        0.006245400756597519,
        0.0005479929386638105,
        -0.030989032238721848,
        0.001010713167488575,
        0.017662690952420235,
        0.013125388883054256,
        -0.01662619784474373,
        -0.03304086625576019,
        0.02876797690987587,
        0.025446966290473938,
        -0.0013630414614453912,
        -0.0020967836026102304,
        0.004153905436396599,
        -0.025066213682293892,
        0.008752021938562393,
        -0.012120625004172325,
        0.056901365518569946,
        0.01925973780453205,
        -0.013347494415938854,
        -0.05110546201467514,
        -0.001671080943197012,
        0.016351209953427315,
        0.025045061483979225,
        -0.009270268492400646,
        -0.0020967836026102304,
        0.00992072094231844,
        0.038921378552913666,
        -0.034754253923892975,
        -0.008466457948088646,
        -0.013802282512187958,
        0.036721475422382355,
        -0.04181933030486107,
        -0.016901185736060143,
        -0.03521961718797684,
        0.02768917754292488,
        -0.02578541450202465,
        0.01283982489258051,
        0.022845158353447914,
        0.029571786522865295,
        0.026821907609701157,
        -0.07581207901239395,
        -0.03640418127179146,
        -0.015314716845750809,
        -0.013633059337735176,
        0.037081073969602585,
        -0.04245391860604286,
        0.006800665054470301,
        -0.014775317162275314,
        0.03128517419099808,
        0.003432061756029725,
        0.059947386384010315,
        -0.03843486309051514,
        -0.006610288750380278,
        -0.0032363974023610353,
        -0.01830785535275936,
        -0.007593899499624968,
        0.012829247862100601,
        -0.02221057005226612,
        -0.002987850457429886,
        -0.0065309652127325535,
        -0.005996854044497013,
        0.005306739825755358,
        0.010412526316940784,
        0.014521482400596142,
        0.02768917754292488,
        0.008974127471446991,
        0.00915392767637968,
        0.013834011740982533,
        0.001767591224052012,
        0.008810192346572876,
        0.0016353854443877935,
        0.032004375010728836,
        0.017948254942893982,
        0.008540492504835129,
        0.025235438719391823,
        0.005407216027379036,
        -0.04076168313622475,
        -0.011708143167197704,
        -0.027118047699332237,
        -0.002084885025396943,
        0.04272890463471413,
        0.0013326341286301613,
        -0.06532023102045059,
        -0.03103133849799633,
        -0.018603995442390442,
        0.02971985749900341,
        0.017630962654948235,
        0.025933483615517616,
        9.237878111889586e-05,
        0.01274463627487421,
        -0.0007231655763462186,
        -0.02525659091770649,
        0.008334252052009106,
        -0.022739393636584282,
        0.017863644286990166,
        0.008191470056772232,
        -0.0017993205692619085,
        0.015758927911520004,
        -0.017948254942893982,
        0.0071919942274689674,
        0.022654781118035316,
        0.03572728857398033,
        0.05592833086848259,
        -0.02502390928566456,
        0.01846650242805481,
        0.029825622215867043,
        -0.0063670300878584385,
        0.010169267654418945,
        0.001741150044836104,
        0.0009479153668507934,
        0.0006031888187862933,
        -0.009095757268369198,
        -0.014616670086979866,
        0.0008745411760173738,
        0.02948717586696148,
        0.013157118111848831,
        0.0035113852936774492,
        0.0033871119376271963,
        -0.008455880917608738,
        0.009799092076718807,
        -0.029444869607686996,
        0.02870451658964157,
        0.023754732683300972,
        0.005275010131299496,
        0.046367209404706955,
        -0.006821817718446255,
        -0.0292544923722744,
        -0.011528342962265015,
        -0.010830297134816647,
        -0.020052971318364143,
        0.013358071446418762,
        0.013696517795324326,
        -0.004965648986399174,
        0.026398848742246628,
        0.056605223566293716,
        -2.7081525331595913e-05,
        0.02847183495759964,
        0.00046205916441977024,
        -0.011560073122382164,
        -0.07399293035268784,
        -0.06273957341909409,
        0.049117088317871094,
        0.003958240617066622,
        -0.012194660492241383,
        0.0018363381968811154,
        0.005764171481132507,
        -0.02794301137328148,
        -0.0029243917670100927,
        -0.012289848178625107,
        -0.005949259735643864,
        0.01980971358716488,
        0.027731481939554214,
        0.0025489272084087133,
        0.025150826200842857,
        0.03378121927380562,
        0.025066213682293892,
        0.02345859259366989,
        -0.006086753681302071,
        -0.004812289960682392,
        -0.0031755827367305756,
        0.0037176262121647596,
        -0.001109206466935575,
        0.005774748045951128,
        0.04497111588716507,
        -0.011708143167197704,
        -0.005764171481132507,
        -0.024325862526893616,
        0.030840963125228882,
        0.0389636866748333,
        -0.01587526872754097,
        -0.03115825727581978,
        -0.021248111501336098,
        -0.010026485659182072,
        -0.03401390090584755,
        0.017260786145925522,
        -0.008667410351336002,
        0.033506229519844055,
        0.011412002146244049,
        -0.011560073122382164,
        -0.020063547417521477,
        -0.001049713813699782,
        -0.011792754754424095,
        0.0002425975981168449,
        0.03519846498966217,
        -0.04021170735359192,
        0.010936061851680279,
        0.01349556539207697,
        0.0161714106798172,
        -0.00047329667722806334,
        0.033315856009721756,
        -0.002482824493199587,
        -0.009381321258842945,
        -0.014267646707594395,
        -0.00516660138964653,
        0.0005750951240770519,
        0.04437883198261261,
        -0.0034241294488310814,
        0.001992340898141265,
        -0.020613523200154305,
        -0.017620384693145752,
        -0.014151305891573429,
        0.012110048905014992,
        -0.009418339468538761,
        -0.02739303559064865,
        0.020190466195344925,
        -0.035833053290843964,
        0.02496044896543026,
        0.030185222625732422,
        -0.019460689276456833,
        0.016932915896177292,
        -0.0008818124770186841,
        0.006927582435309887,
        -0.008455880917608738,
        -0.012342730537056923,
        0.012448495253920555,
        0.02496044896543026,
        0.03509270027279854,
        0.026843059808015823,
        0.00823377538472414,
        -0.030989032238721848,
        -0.024050874635577202,
        0.003611861728131771,
        -0.0028186270501464605,
        0.013220577500760555,
        0.0016195207135751843,
        0.015124340541660786,
        -0.01873091422021389,
        0.010883179493248463,
        -0.014331106096506119,
        -0.025235438719391823,
        -0.02955063432455063,
        -0.035113852471113205,
        -0.020613523200154305,
        -0.013083083555102348,
        0.010153403505682945,
        0.024495085701346397,
        -0.022612474858760834,
        0.003178226761519909,
        0.00795349944382906,
        -0.022612474858760834,
        0.022125957533717155,
        0.03185630217194557,
        -0.011158167384564877,
        -0.0210260059684515,
        0.020454877987504005,
        -0.05757825821638107,
        0.01990490034222603,
        -0.02069813571870327,
        -0.013453259132802486,
        -0.03443695977330208,
        -0.0024881125427782536,
        -0.0004898224142380059,
        -0.006319435779005289,
        0.028873739764094353,
        0.013125388883054256,
        0.011189896613359451,
        0.009550545364618301,
        0.002579334657639265,
        0.04721332713961601,
        0.006451641675084829,
        0.011549496091902256,
        -0.01307250652462244,
        -0.008461168967187405,
        -0.03940789774060249,
        0.0010206286096945405,
        -0.001019306480884552,
        0.005425724666565657,
        0.004759407602250576,
        -0.001811219030059874,
        -0.021279841661453247,
        0.021829817444086075,
        -0.012882130220532417,
        0.010967791080474854,
        0.006441065110266209,
        -0.010142826475203037,
        0.00029647143674083054,
        0.06633556634187698,
        0.010148115456104279,
        0.001052357954904437,
        -0.05444762483239174,
        0.0025317405816167593,
        -0.006377606652677059,
        0.02328936941921711,
        -0.020751018077135086,
        0.014722434803843498,
        -0.005965124350041151,
        -0.02608155459165573,
        -0.020782748237252235,
        -0.03325239568948746,
        -0.046494126319885254,
        -0.03399274870753288,
        0.02453739196062088,
        0.009407762438058853,
        -0.045055728405714035,
        0.032490890473127365,
        0.022422099485993385,
        0.019957782700657845,
        -0.01489165797829628,
        0.029402563348412514,
        -0.008640969172120094,
        -0.006763647310435772,
        0.01574835181236267,
        -0.03799065202474594,
        0.026843059808015823,
        0.03376006707549095,
        -0.009888991713523865,
        0.02138560637831688,
        -0.0008917279192246497,
        -0.02299322746694088,
        0.027266118675470352,
        -0.02138560637831688,
        0.030121762305498123,
        -0.02210480533540249,
        -0.003598641138523817,
        0.024198943749070168,
        0.009190944954752922,
        -0.00326812663115561,
        -0.012490801513195038,
        0.000614756834693253,
        0.005579083692282438,
        -0.04420961067080498,
        0.025045061483979225,
        -0.031200561672449112,
        -0.022125957533717155,
        -0.006144924089312553,
        -0.03486001864075661,
        -0.010216861963272095,
        0.015134916640818119,
        -0.010089944116771221,
        -0.0072395880706608295,
        -0.009767362847924232,
        0.007853022776544094,
        -0.012173507362604141,
        -0.000833557394798845,
        0.007678511086851358,
        0.031708233058452606,
        -0.0031993796583265066,
        0.01574835181236267,
        -0.01892128959298134,
        -0.0027075742837041616,
        -0.05140160396695137,
        -0.0010715278331190348,
        -0.009206810034811497,
        0.009407762438058853,
        -0.012459072284400463,
        -0.02817569486796856,
        -0.006382894702255726,
        0.016784844920039177,
        -0.0015256545739248395,
        -0.01869918406009674,
        -0.002979918150231242,
        0.007964075542986393,
        0.003027512226253748,
        0.0027816095389425755,
        0.0008970161434262991,
        -0.015060881152749062,
        0.011708143167197704,
        0.018656877800822258,
        -0.028260305523872375,
        -0.012903283350169659,
        0.049413230270147324,
        -0.011412002146244049,
        0.026610378175973892,
        0.010391374118626118,
        -0.010306761600077152,
        0.008773175068199635,
        -0.01896359585225582,
        -0.0055156247690320015,
        0.030185222625732422,
        0.004918054677546024,
        -0.00306717399507761,
        -0.037250299006700516,
        -0.029867928475141525,
        0.021100040525197983,
        -0.007202570326626301,
        0.014013811945915222,
        0.0014450091402977705,
        0.010063502937555313,
        0.005256501492112875,
        -0.0015666383551433682,
        -0.01349556539207697,
        0.018783796578645706,
        0.01823382079601288,
        -0.04067707061767578,
        0.01817036047577858,
        -0.010761549696326256,
        -0.018022291362285614,
        0.03329470008611679,
        0.016541585326194763,
        0.015082034282386303,
        0.007911193184554577,
        0.0041856346651911736,
        0.04776330292224884,
        0.014870504848659039,
        -0.035240769386291504,
        0.012078319676220417,
        -0.00934959203004837,
        -0.004161837510764599,
        -0.016256021335721016,
        -0.0046774400398135185,
        0.0005493150092661381,
        -0.023395134136080742,
        -0.02680075354874134,
        0.014986846596002579,
        -0.025002755224704742,
        -0.011147590354084969,
        -0.02013758383691311,
        -0.02227402850985527,
        0.004534658044576645,
        0.008043399080634117,
        0.025341201573610306,
        0.013622483238577843,
        0.0033738913480192423,
        -0.02680075354874134,
        0.038265638053417206,
        0.0002814330509863794,
        -0.025002755224704742,
        -0.009836109355092049,
        0.013358071446418762,
        -0.030650585889816284,
        -0.027541106566786766,
        0.021787511184811592,
        -0.017377126961946487,
        -0.06371260434389114,
        0.005991565529257059,
        0.02280285209417343,
        -0.0035510470625013113,
        -0.014933964237570763,
        0.027244966477155685,
        0.015082034282386303,
        0.0036541675217449665,
        0.006250688806176186,
        0.017472315579652786,
        -0.006816529668867588,
        0.015706045553088188,
        -0.027731481939554214,
        -0.019640490412712097,
        -0.014584940858185291,
        -0.031962066888809204,
        -0.005208907648921013,
        0.01349556539207697,
        -0.04076168313622475,
        -0.01610795222222805,
        0.011708143167197704,
        0.00042867721640504897,
        0.0046430667862296104,
        -0.009656309150159359,
        -0.03384467586874962,
        0.04319427162408829,
        -0.007768411189317703,
        0.0028953063301742077,
        0.007181417662650347,
        0.008307810872793198,
        0.007440540939569473,
        -0.0012308357981964946,
        -0.0017332176212221384,
        -0.03342162072658539,
        -0.0013775841798633337,
        0.026652684435248375,
        0.0028953063301742077,
        0.03447926416993141,
        0.006832394283264875,
        -0.020444300025701523,
        -0.0072395880706608295,
        -0.039936721324920654,
        0.0273295771330595,
        -0.015928151085972786,
        0.007260741200298071,
        0.0320889838039875,
        -0.024495085701346397,
        -0.016975220292806625,
        -0.0027445917949080467,
        0.017472315579652786,
        0.03276588022708893,
        0.011137014254927635,
        0.03096788004040718,
        0.004569031298160553,
        -0.01637236215174198,
        0.001985730603337288,
        0.011528342962265015,
        0.010671650059521198,
        -0.003244329709559679,
        0.012014860287308693,
        0.017599232494831085,
        0.020359689369797707,
        0.004280822817236185,
        -0.00529087521135807,
        0.007498711347579956,
        0.044886503368616104,
        0.016911761835217476,
        -0.0010133571922779083,
        -0.0038815615698695183,
        0.0031940913759171963,
        0.03566382825374603,
        0.005462742410600185,
        -0.0105764614418149,
        0.0243681687861681,
        0.020645253360271454,
        0.030333291739225388,
        0.015113763511180878,
        0.035536911338567734,
        0.002609741874039173,
        -0.0031332767102867365,
        0.02853529341518879,
        0.0006055024568922818,
        -0.0015441634459421039,
        -0.033971596509218216,
        0.02328936941921711,
        -0.03486001864075661,
        -0.023775886744260788,
        0.00033976882696151733,
        0.001640673610381782,
        0.0005046955193392932,
        0.024854686111211777,
        0.008947686292231083,
        0.01090433169156313,
        7.242397259688005e-05,
        0.015674317255616188,
        -0.028006471693515778,
        -0.051486216485500336,
        0.009571697562932968,
        -0.012025437317788601,
        -0.0033924002200365067,
        -0.01548394002020359,
        0.001351804006844759,
        0.017588656395673752,
        -0.025743108242750168,
        0.011094707995653152,
        0.050005510449409485,
        0.017673267051577568,
        0.004069293849170208,
        -0.015124340541660786,
        0.01637236215174198,
        -0.0033474501688033342,
        -0.04050784930586815,
        0.007234300021082163,
        -0.00856164563447237,
        0.02286631055176258,
        -0.03464848920702934,
        0.028196847066283226,
        -0.004783204756677151,
        0.00882605742663145,
        -0.030164068564772606,
        -0.014986846596002579,
        -0.01820209063589573,
        0.0015930795343592763,
        -0.02072986587882042,
        0.0026480816304683685,
        0.04067707061767578,
        -0.022252876311540604,
        0.010666362009942532,
        0.028069930151104927,
        0.0010807821527123451,
        0.016055069863796234,
        -0.0008018279913812876,
        0.01176102552562952,
        -0.033506229519844055,
        0.020285652950406075,
        -0.007921770215034485,
        -0.02227402850985527,
        0.007958787493407726,
        -0.013379224576056004,
        -0.006726629566401243,
        0.0012420732527971268,
        -0.020687559619545937,
        -0.004722390323877335,
        0.008339540101587772,
        0.01500799972563982,
        0.019524147734045982,
        0.019968360662460327,
        0.008704427629709244,
        0.0004689999914262444
      ],
      "url": "https://www.nature.com/articles/s41586-025-09122-8",
      "source": "Nature",
      "published": "2025-07-24",
      "sentiment_score": 0.85,
      "reasoning": "The article highlights a scientific and technological breakthrough integrating biotechnology and AI to improve crops, which promises to enhance global food security. This advancement is likely to have a positive impact on society by addressing food supply challenges.",
      "category": "Technology",
      "personality_title": "New biotech and AI tools boost crop growth for food security",
      "personality_presentation": "**Context**\nWith the world’s population growing and climate change making farming tougher, finding better ways to grow food is more important than ever. Scientists have been working on technologies to help crops grow stronger and produce more food.\n\n**What happened**\nResearchers combined biotechnology—like genome editing, which lets scientists change plant DNA precisely—and AI, or artificial intelligence, which helps analyze lots of data quickly. They also used omics technologies, which study all the genes, proteins, or chemicals in plants. Together, these tools speed up how we improve crops.\n\n**Impact**\nThis smart mix means we can develop crops that resist tough weather, diseases, and poor soil faster than before. It could help prevent hunger by making sure we have enough food worldwide, even as challenges grow.\n\n**What's next step**\nScientists plan to keep improving these methods and start applying them in farms around the world. They will also focus on making these technologies affordable and accessible for farmers everywhere.\n\n**One-sentence takeaway**\nUsing biotechnology and AI together is a promising way to grow stronger crops and fight global hunger.",
      "personality_title_fr": "De nouveaux outils biotechnologiques et d’IA stimulent la croissance des cultures pour la sécurité alimentaire",
      "personality_presentation_fr": "**Contexte**\nAvec la croissance de la population mondiale et le changement climatique qui rend l’agriculture plus difficile, trouver de meilleures façons de cultiver est plus important que jamais. Les scientifiques travaillent sur des technologies pour aider les cultures à devenir plus fortes et produire plus de nourriture.\n\n**Ce qui s’est passé**\nLes chercheurs ont combiné la biotechnologie — comme l’édition génomique, qui permet de modifier précisément l’ADN des plantes — et l’IA, ou intelligence artificielle, qui aide à analyser rapidement de grandes quantités de données. Ils ont aussi utilisé les technologies omiques, qui étudient tous les gènes, protéines ou substances chimiques dans les plantes. Ensemble, ces outils accélèrent l’amélioration des cultures.\n\n**Impact**\nCette combinaison intelligente permet de développer des plantes résistantes aux conditions météo difficiles, aux maladies et aux sols pauvres plus rapidement qu’avant. Cela pourrait aider à prévenir la faim en assurant assez de nourriture dans le monde même face aux défis.\n\n**Prochaine étape**\nLes scientifiques prévoient d’améliorer encore ces méthodes et de commencer à les appliquer dans les fermes partout dans le monde. Ils se concentreront aussi sur rendre ces technologies abordables et accessibles pour tous les agriculteurs.\n\n**Conclusion en une phrase**\nUtiliser ensemble la biotechnologie et l’IA est une solution prometteuse pour cultiver des plantes plus fortes et lutter contre la faim mondiale.",
      "personality_title_es": "Nuevas herramientas biotecnológicas e IA impulsan el crecimiento de cultivos para la seguridad alimentaria",
      "personality_presentation_es": "**Contexto**\nCon el crecimiento de la población mundial y el cambio climático que dificulta la agricultura, encontrar mejores maneras de cultivar es más importante que nunca. Los científicos trabajan en tecnologías para ayudar a que los cultivos sean más fuertes y produzcan más alimentos.\n\n**Qué sucedió**\nLos investigadores combinaron biotecnología —como la edición del genoma, que permite cambiar el ADN de las plantas con precisión— e inteligencia artificial (IA), que ayuda a analizar muchos datos rápidamente. También usaron tecnologías ómicas, que estudian todos los genes, proteínas o químicos en las plantas. Juntos, estos recursos aceleran la mejora de cultivos.\n\n**Impacto**\nEsta combinación inteligente permite crear plantas que resisten mejor el clima extremo, las enfermedades y suelos pobres, más rápido que antes. Esto podría ayudar a prevenir el hambre asegurando suficiente comida en el mundo a pesar de los desafíos.\n\n**Próximo paso**\nLos científicos planean seguir mejorando estos métodos y comenzar a aplicarlos en granjas de todo el mundo. También se enfocarán en hacer estas tecnologías accesibles y asequibles para todos los agricultores.\n\n**Resumen en una frase**\nUsar biotecnología e IA juntas es una forma prometedora de cultivar plantas más fuertes y combatir el hambre global.",
      "image_url": "public/images/news_image_Integrated-biotechnological-and-AI-innovations-for.png",
      "image_prompt": "A detailed, warm-toned painting of a thriving crop field where glowing, stylized DNA helixes gently intertwine with sprouting plants under a soft sky, while a network of delicate, glowing circuit patterns weaves subtly through the soil and roots, symbolizing the integration of biotechnology and AI nurturing global crop improvement."
    },
    {
      "title": "Gaps in our knowledge of ancient Rome could be filled by AI",
      "summary": "A new system fills in missing words from ancient inscriptions carved on monuments and everyday objects.",
      "content": "Gaps in our knowledge of ancient Rome could be filled by AI\n\n14 hours ago Share Save Pallab Ghosh • @BBCPallab Science Correspondent Share Save\n\nThe Metropolitan Museum of Art Artwork: The new system predicts missing text from broken inscriptions, their date and original location\n\nA new AI tool has the potential to turbocharge our understanding of all human history, researchers say. Artificial intelligence has already been used to fill in gaps in ancient Roman scrolls, but a new system goes much further. It can fill in missing words from ancient Roman inscriptions carved on monuments and everyday objects, as well as dating and placing them geographically. AI often introduces errors in its analysis of even simple modern texts, so there are concerns that relying too much on this technology might distort rather than enhance our understanding of history.\n\nBut historian Prof Dame Mary Beard of Cambridge University has described the technology as potentially \"transformative\" to our study of past events. She said that the system, called Aeneas, after a Greek and Roman mythological figure, could accelerate the rate at which historians piece together the past from ancient texts. \"Breakthroughs in this very difficult field have tended to rely on the memory, the subjective judgement and the hunch/guesswork of individual scholars, supported by traditional, encyclopaedic databases. Aeneas opens up entirely new horizons.\"\n\nAtilimGunesBaydin Inscriptions are found on ancient monuments across the globe. This one at the Temple of Augustus in Ankara in Turkey is known as the queen of inscriptions\n\nAncient inscriptions are usually incomplete, of unknown origin and date, and often all three. Historians and classicists attempt to fill in the blanks by drawing on texts that are similar in wording, grammar, appearance and cultural setting, known as 'parallels'. Ancient inscriptions tend to be formulaic so historians can often infer what the missing part of a sentence goes on to say. The process is painstaking and can take months and years but opens new vistas in our understanding of the past, according to Dr Thea Sommerschield, an historian at Nottingham University, who co-led the research. \"Inscriptions are the earliest forms of writing. They are so precious to historians because they offer first-hand evidence for ancient histories, languages and societies. \"But they degrade over the centuries and interpreting them is like solving a gigantic jigsaw puzzle with tens of thousands of pieces, of which 90 per cent are lost.\"\n\nThea Sommerschield A Roman bronze military diploma dates 94 CE. Like most inscriptions it is incomplete\n\nIt's not the first time AI has been used to join up the missing dots in Roman history. Earlier this year, another team of scientists digitally \"unwrapped\" a badly burnt scroll from the Roman town of Herculaneum using a combination of X-ray imaging and AI, revealing rows and columns of text. Dr Sommerschield developed Aeneas along with her co-research leader Dr Yannis Assael, an AI specialist at Google DeepMind. It automates the process of contextualising based on parallels, in the blink of an eye. Aeneas draws on a vast database of of 176,000 Roman inscriptions including images and uses a carefully designed AI system to pull up a range of relevant historical parallels, to support the work of historians, according to Dr Assael. \"What the historian can't do is assess these parallels in a matter of seconds across tens of thousands of inscriptions, and that is where AI can come in as an assistant.\" The team tested out the system in dating a famous Roman text at the Temple of Augustus in Ankara in Turkey, known as the queen of inscriptions because of its importance to our understanding of Roman history. The Res Gestae Divi Augusti was composed by the first Roman Emperor, Augustus, giving an account of his life and accomplishments. Its date is hotly contested among historians. Aeneas was able to narrow down the options to two possible ranges, the most likely being between 10 and 20 CE and a second slightly less likely range from 10 to 1 BCE. This showed the system's accuracy as most historians agree on these two as the most likely possibilities.\n\nGoogle Deepmind Artwork: An earlier version of the system filled in missing words in ancient Greek. Aeneas is much more powerful",
      "embedding": [
        0.025070592761039734,
        0.05940329656004906,
        0.004541722126305103,
        0.012356629595160484,
        -0.015136691741645336,
        0.01759515330195427,
        0.0003343311545904726,
        0.02033948339521885,
        -0.026757212355732918,
        0.040821902453899384,
        0.004155801143497229,
        -0.017638033255934715,
        -0.046596426516771317,
        -0.0005275151343084872,
        0.041936784982681274,
        0.017409339547157288,
        -0.0345328114926815,
        -0.0026424890384078026,
        -0.02042524330317974,
        0.003301771357655525,
        0.017452219501137733,
        -0.02276935800909996,
        -0.008504563011229038,
        0.007804187014698982,
        0.049455102533102036,
        0.01658032462000847,
        -0.033989664167165756,
        0.04413796588778496,
        0.024770431220531464,
        -0.006256928201764822,
        0.01668037660419941,
        -0.030873706564307213,
        0.017838140949606895,
        -0.010126861743628979,
        0.021697355434298515,
        0.02664286457002163,
        0.030645012855529785,
        -0.013235672377049923,
        0.0007901560747995973,
        0.003673399332910776,
        0.03030197136104107,
        -0.002828303026035428,
        0.03276043385267258,
        -0.048940543085336685,
        -0.013978928327560425,
        -0.01759515330195427,
        -0.022740771993994713,
        0.008004294708371162,
        0.0019778467249125242,
        0.05019836127758026,
        -0.005445778835564852,
        0.014422022737562656,
        -0.04216548055410385,
        -0.01392175443470478,
        -0.00706450454890728,
        -0.06454891711473465,
        -0.03647671267390251,
        0.019439000636339188,
        -0.04919782280921936,
        0.001908166566863656,
        -0.0132142324000597,
        -0.03284619376063347,
        0.0032285177148878574,
        0.015479733236134052,
        -0.0691799744963646,
        0.02552798204123974,
        -0.05477224290370941,
        0.04490980878472328,
        -0.01239950954914093,
        0.020410951226949692,
        0.03793463855981827,
        0.0032785446383059025,
        -0.06952301412820816,
        0.002860463224351406,
        -0.030559252947568893,
        -0.0325031504034996,
        0.013307139277458191,
        0.052199434489011765,
        -0.014229062013328075,
        0.06260501593351364,
        0.029844582080841064,
        -0.0396784283220768,
        -0.04362340271472931,
        -0.039192456752061844,
        -0.01382170058786869,
        0.02063964493572712,
        0.021725941449403763,
        0.03393249213695526,
        -0.027786334976553917,
        -0.03690551221370697,
        0.03007327765226364,
        -0.010269795544445515,
        -0.014422022737562656,
        0.00048374166362918913,
        -0.03984995186328888,
        -0.025556568056344986,
        -0.04653925448656082,
        0.005045563913881779,
        0.0028711832128465176,
        0.034618571400642395,
        0.025470808148384094,
        -0.05771667882800102,
        0.01259961724281311,
        -0.0589459091424942,
        0.04533860832452774,
        -0.04250852018594742,
        -0.028186550363898277,
        -0.03436129167675972,
        0.010755770839750767,
        -0.018667157739400864,
        -0.08364487439393997,
        -0.055458325892686844,
        0.01061283703893423,
        -0.06151871755719185,
        0.05680190399289131,
        -0.004945510532706976,
        -0.022412024438381195,
        0.02735753357410431,
        0.02245490439236164,
        -0.015408266335725784,
        -0.017437927424907684,
        0.02825801819562912,
        -0.008726109750568867,
        0.0032463844399899244,
        0.05294268950819969,
        0.027071665972471237,
        -0.04076472669839859,
        0.01021262165158987,
        -0.047425445169210434,
        -0.0065606627613306046,
        -0.0032088644802570343,
        -0.03802039846777916,
        0.03270325809717178,
        -0.0005105417803861201,
        -0.06632129848003387,
        -0.023326801136136055,
        -0.016037175431847572,
        -0.027085959911346436,
        -0.03121674805879593,
        0.0014606050681322813,
        -0.0067393300123512745,
        -0.04531002417206764,
        0.016408802941441536,
        -0.008890483528375626,
        -0.012642497196793556,
        -0.033303581178188324,
        -0.029044153168797493,
        0.02356978878378868,
        0.002313741249963641,
        -0.015994295477867126,
        0.0010318035492673516,
        0.01275684405118227,
        0.006081834435462952,
        0.03564769774675369,
        -0.017123471945524216,
        -0.02175452746450901,
        -0.00787565391510725,
        0.010441316291689873,
        0.02339826710522175,
        0.020096495747566223,
        -0.03296054154634476,
        -0.018038248643279076,
        0.04585317149758339,
        -0.02072540484368801,
        0.014100422151386738,
        3.92788861063309e-05,
        -0.0046918028965592384,
        -0.027471881359815598,
        -0.03819191828370094,
        0.007361092139035463,
        -0.0299875158816576,
        -0.06088981032371521,
        -0.021282846108078957,
        0.05234236642718315,
        -0.03387531638145447,
        0.006381995510309935,
        -0.02166876755654812,
        -0.013121325522661209,
        -0.04939793050289154,
        -0.029101327061653137,
        0.03230304643511772,
        0.012320895679295063,
        -0.014950877986848354,
        0.049169234931468964,
        0.0218545813113451,
        -0.060946982353925705,
        0.030930880457162857,
        0.035733457654714584,
        0.012392362579703331,
        0.060832638293504715,
        -0.02062535099685192,
        -0.0046560694463551044,
        0.10285518318414688,
        0.011005904525518417,
        0.007246744818985462,
        -0.033389341086149216,
        0.009033418260514736,
        -0.0157656017690897,
        0.05906025692820549,
        0.006010367535054684,
        -0.012335189618170261,
        -0.013342872262001038,
        -0.01871003769338131,
        -0.01706629805266857,
        -0.016094349324703217,
        0.01056995615363121,
        -0.012521003372967243,
        -0.033389341086149216,
        -0.016537442803382874,
        -0.039707016199827194,
        0.01467930432409048,
        -0.0497981458902359,
        -0.01174916047602892,
        0.03607649728655815,
        -0.040907662361860275,
        0.012349482625722885,
        -0.01698053814470768,
        0.027814922854304314,
        -0.003217797726392746,
        -0.02113991230726242,
        0.024355923756957054,
        0.005281405057758093,
        0.035218894481658936,
        0.04928358271718025,
        -0.036019325256347656,
        -0.008275868371129036,
        0.040107231587171555,
        -0.004870470147579908,
        -0.03130250796675682,
        -0.02795785665512085,
        0.06363414227962494,
        0.02073969878256321,
        -0.004966950509697199,
        0.01457925047725439,
        -0.028415244072675705,
        0.008440242148935795,
        0.01366447377949953,
        0.015065224841237068,
        0.032674673944711685,
        -0.00039128135540522635,
        0.006396288517862558,
        0.005603006109595299,
        0.022840825840830803,
        0.02346973493695259,
        -0.024556031450629234,
        0.06735041737556458,
        -0.04465252906084061,
        0.0005605685873888433,
        0.031759895384311676,
        -0.03030197136104107,
        0.0132213793694973,
        -0.006892983801662922,
        0.012828310951590538,
        0.03230304643511772,
        -0.006432021968066692,
        0.022140448912978172,
        -0.035619109869003296,
        0.023155279457569122,
        -0.010291235521435738,
        0.00037185128894634545,
        -0.015508320182561874,
        -0.020553885027766228,
        -0.05400040000677109,
        0.03364662453532219,
        0.01748080737888813,
        -0.06592108309268951,
        0.017466513440012932,
        0.04250852018594742,
        0.021182792261242867,
        -0.057373639196157455,
        -0.02103985846042633,
        0.016137229278683662,
        -0.003884226782247424,
        -0.050255533307790756,
        -0.0013516179751604795,
        -0.023555494844913483,
        -0.06443456560373306,
        0.04096483439207077,
        0.004766843281686306,
        0.05651603639125824,
        -0.011013051494956017,
        0.0026121155824512243,
        0.013650180771946907,
        0.03164554759860039,
        0.0008866363787092268,
        0.020382363349199295,
        -0.0016544590471312404,
        -0.0031874242704361677,
        0.02062535099685192,
        0.006306955125182867,
        -0.0007700559799559414,
        -0.01011256780475378,
        0.003287478117272258,
        -0.013778820633888245,
        -0.06489195674657822,
        -0.01021976862102747,
        -0.04322318732738495,
        -0.017623741179704666,
        0.03133109584450722,
        0.02085404470562935,
        0.020053615793585777,
        -0.04908347502350807,
        0.03496161475777626,
        0.020582471042871475,
        -0.07889947295188904,
        0.07186713069677353,
        -0.028429538011550903,
        -0.04736826941370964,
        0.046396318823099136,
        -0.012070761993527412,
        0.05940329656004906,
        -0.014514929614961147,
        0.017237819731235504,
        0.01051278319209814,
        0.019024493172764778,
        -0.047825656831264496,
        0.0119492681697011,
        -0.022326264530420303,
        0.04908347502350807,
        -0.05774526670575142,
        -0.011777747422456741,
        -0.035819217562675476,
        0.04831163212656975,
        -0.01129177212715149,
        -0.013893167488276958,
        -0.004945510532706976,
        0.030044689774513245,
        -0.02987316995859146,
        0.011706280522048473,
        -0.039106693118810654,
        0.0007258358527906239,
        0.014750771224498749,
        0.04622479900717735,
        0.01666608452796936,
        -0.0061961812898516655,
        -0.00037899796734564006,
        -0.030759358778595924,
        0.04156515747308731,
        0.034504227340221405,
        -0.020782578736543655,
        -0.011599079705774784,
        -0.02742900140583515,
        0.015522613190114498,
        0.0037877464201301336,
        0.06037524715065956,
        0.029330020770430565,
        -0.014622130431234837,
        0.0016571390442550182,
        0.024841899052262306,
        0.0006047887727618217,
        -0.028801165521144867,
        0.0038234798703342676,
        0.043766338378190994,
        0.021325726062059402,
        -0.002601395593956113,
        0.009633739478886127,
        0.012935510836541653,
        -0.023912828415632248,
        -0.022626424208283424,
        -0.01001966092735529,
        0.018224062398076057,
        -0.019439000636339188,
        0.022226210683584213,
        0.021983223035931587,
        -0.03527606651186943,
        -0.0005913887289352715,
        -0.005631592590361834,
        0.0386207215487957,
        -0.041936784982681274,
        -0.03404683619737625,
        -0.05225660651922226,
        -0.041222114115953445,
        -0.03824909031391144,
        -0.014350555837154388,
        -0.03627660498023033,
        0.044166553765535355,
        0.012585323303937912,
        -0.016323043033480644,
        -0.09427915513515472,
        0.012249428778886795,
        0.05205649882555008,
        0.021883169189095497,
        0.027214599773287773,
        0.0015865655150264502,
        0.06849388778209686,
        0.005706632975488901,
        0.006235488224774599,
        0.051684871315956116,
        -0.034732919186353683,
        0.002726462669670582,
        0.03133109584450722,
        0.0025692356284707785,
        0.0507986806333065,
        0.01871003769338131,
        -0.0005431485478766263,
        0.024656085297465324,
        0.023298213258385658,
        0.014779357239603996,
        0.02827231027185917,
        0.03284619376063347,
        0.05325714498758316,
        0.03641954064369202,
        -0.0020957672968506813,
        0.011377532966434956,
        0.030473491176962852,
        0.02978741005063057,
        0.024370217695832253,
        -0.010169741697609425,
        -0.0006668756250292063,
        0.04025016725063324,
        0.033189233392477036,
        -0.01266393717378378,
        0.0680365040898323,
        -0.023655548691749573,
        0.04116494208574295,
        0.016294457018375397,
        0.021382899954915047,
        0.02601395547389984,
        0.018652863800525665,
        -0.023126693442463875,
        0.004920497070997953,
        -0.027914976701140404,
        -0.02288370579481125,
        -0.09393610805273056,
        0.061861760914325714,
        0.03539041429758072,
        -0.0406789667904377,
        -0.05457213521003723,
        0.0335322767496109,
        -0.04562447592616081,
        0.04585317149758339,
        0.008526002988219261,
        0.06980887800455093,
        -0.016137229278683662,
        0.0020921938121318817,
        -0.02835807204246521,
        0.011155985295772552,
        0.039592668414115906,
        0.015822773799300194,
        -0.014329115860164165,
        -0.009812407195568085,
        -0.010727183893322945,
        -0.03667682036757469,
        -0.0038806532975286245,
        -0.04125070199370384,
        0.0022637145593762398,
        -0.04399503022432327,
        0.009154911153018475,
        -0.005427911877632141,
        -0.05354301258921623,
        0.033589448779821396,
        0.004363054875284433,
        0.0064749023877084255,
        0.02765769511461258,
        0.054429199546575546,
        -0.040936246514320374,
        -0.025170646607875824,
        -0.029444368556141853,
        0.003816333133727312,
        -0.00722173135727644,
        0.009176352061331272,
        0.012235135771334171,
        -0.03393249213695526,
        0.014950877986848354,
        0.03133109584450722,
        0.0467679463326931,
        -0.03822050616145134,
        0.049455102533102036,
        0.03773453086614609,
        0.01005539484322071,
        -0.011699133552610874,
        0.061747413128614426,
        -0.01097017154097557,
        -0.0030623571947216988,
        -0.012413802556693554,
        -0.025027712807059288,
        -0.046281974762678146,
        0.001554405316710472,
        0.006289088167250156,
        0.01808112859725952,
        -0.015894241631031036,
        -0.05683048814535141,
        0.03916386887431145,
        -0.006875116843730211,
        0.008283015340566635,
        -0.008268721401691437,
        -0.03138826787471771,
        -0.0345613993704319,
        0.02164018154144287,
        -0.06643564254045486,
        -0.021926049143075943,
        -0.025785261765122414,
        0.010405582375824451,
        -0.01668037660419941,
        0.05825982615351677,
        -0.06998039782047272,
        -0.019967855885624886,
        -0.018481343984603882,
        0.009469365701079369,
        -0.01759515330195427,
        0.007725573144853115,
        0.04279438778758049,
        -0.044681113213300705,
        0.012242281809449196,
        -0.006539222318679094,
        0.03436129167675972,
        -0.013164205476641655,
        0.03942114859819412,
        0.0060746874660253525,
        -0.01266393717378378,
        -0.0010764703620225191,
        0.024255869910120964,
        0.0024638217873871326,
        0.001870646490715444,
        0.019767748191952705,
        0.015351093374192715,
        0.010191181674599648,
        0.02847241796553135,
        0.025084886699914932,
        -0.03464715927839279,
        -0.018166888505220413,
        -0.019138839095830917,
        -0.015608374029397964,
        -0.046910881996154785,
        0.02602824941277504,
        -0.03699127584695816,
        -0.049455102533102036,
        -0.0208254586905241,
        -0.015608374029397964,
        0.05888873711228371,
        -0.02734324149787426,
        -0.0003819013072643429,
        0.05883156135678291,
        0.015708427876234055,
        -0.002953370101749897,
        -0.026557104662060738,
        -0.03544759005308151,
        0.0026424890384078026,
        0.01716635189950466,
        0.015922827646136284,
        0.019967855885624886,
        0.03699127584695816,
        -0.0011577639961615205,
        0.0037520129699259996,
        -0.011713427491486073,
        0.0299875158816576,
        0.01595141552388668,
        -0.016637496650218964,
        0.003467931877821684,
        0.05011259764432907,
        0.02155442163348198,
        0.009362165816128254,
        -0.01549402717500925,
        -0.0162515752017498,
        0.017537981271743774,
        -0.00037721131229773164,
        0.023855656385421753,
        0.02935860864818096,
        0.04656784236431122,
        0.019439000636339188,
        0.036248017102479935,
        0.01636592298746109,
        0.03944973647594452,
        0.029015567153692245,
        0.011634813621640205,
        -0.011627666652202606,
        0.0012256575282663107,
        0.04099342226982117,
        -0.0006222088122740388,
        -0.02113991230726242,
        0.0005217084544710815,
        -0.043166015297174454,
        0.006514209322631359,
        -0.007561199367046356,
        -0.009883874095976353,
        -0.020511003211140633,
        0.054343439638614655,
        0.005063430871814489,
        0.01992497593164444,
        -0.010991611517965794,
        0.013735940679907799,
        -0.005681619513779879,
        0.020611057057976723,
        0.01618010923266411,
        -0.05445778742432594,
        0.005502952262759209,
        0.027586229145526886,
        0.028315190225839615,
        0.01031982246786356,
        0.008768990635871887,
        -0.0002668842498678714,
        0.03233163058757782,
        0.0167804304510355,
        0.01276399102061987,
        0.005763806402683258,
        0.025756675750017166,
        0.050455641001462936,
        -0.022397730499505997,
        -0.012428096495568752,
        0.0315312035381794,
        0.005606579128652811,
        -0.008475976064801216,
        0.03490443900227547,
        0.01646597683429718,
        0.0030623571947216988,
        0.00533857848495245,
        0.015679839998483658,
        -0.0060746874660253525,
        -0.008683229796588421,
        0.010991611517965794,
        -0.011434705927968025,
        0.047711312770843506,
        0.02674291841685772,
        0.004202254582196474,
        -0.028715405613183975,
        0.04127928987145424,
        -0.04799718037247658,
        0.013021271675825119,
        -0.002931930124759674,
        0.022812237963080406,
        0.0066535696387290955,
        0.009948194026947021,
        -0.02438451163470745,
        0.013285699300467968,
        0.011448999866843224,
        0.023626960813999176,
        -0.04027875140309334,
        0.011091665364801884,
        -0.023455440998077393,
        -0.006096127908676863,
        0.014979464933276176,
        -0.00788280088454485,
        0.04516708850860596,
        0.005199217703193426,
        -0.012342335656285286,
        0.01102734450250864,
        0.011013051494956017,
        0.00930499192327261,
        0.02398429624736309,
        -0.009576566517353058,
        0.002029660390689969,
        -0.05580136552453041,
        -0.006453462410718203,
        0.0026067555882036686,
        0.01585136167705059,
        0.026671452447772026,
        -0.019138839095830917,
        0.01392175443470478,
        0.001006790087558329,
        -0.013685913756489754,
        0.013593006879091263,
        -0.014243355952203274,
        0.04339471086859703,
        0.01596570760011673,
        0.00034929453977383673,
        -0.029815996065735817,
        -0.0006579422624781728,
        0.012077908031642437,
        -0.004291587974876165,
        -0.056973423808813095,
        -0.04150798171758652,
        -0.011906387284398079,
        0.020668230950832367,
        -0.031045226380228996,
        0.004645349457859993,
        0.02399859018623829,
        0.019467586651444435,
        0.04556730389595032,
        -0.03081653267145157,
        0.07249603420495987,
        0.006767916493117809,
        -0.015622667036950588,
        0.022955171763896942,
        0.030159037560224533,
        0.0058102598413825035,
        0.05571560561656952,
        0.015379679389297962,
        -0.009891021065413952,
        -0.046281974762678146,
        0.011113105341792107,
        -0.018381290137767792,
        0.020396657288074493,
        -0.011277479119598866,
        0.013142765499651432,
        -0.02184028923511505,
        0.007811333518475294,
        0.027471881359815598,
        0.01688048429787159,
        0.014779357239603996,
        -0.002211900893598795,
        0.0019832069519907236,
        -0.010648570023477077,
        0.02023942954838276,
        -0.02804361656308174,
        0.04536719620227814,
        -0.021611593663692474,
        0.038163330405950546,
        0.024012882262468338,
        0.007718426641076803,
        -0.027271773666143417,
        0.02471325919032097,
        -0.023355387151241302,
        -0.017609447240829468,
        0.00022746578906662762,
        -0.0020225136540830135,
        -0.002669289242476225,
        -0.031502615660429,
        0.005770953372120857,
        0.01031267549842596,
        0.029044153168797493,
        0.02734324149787426,
        -0.017409339547157288,
        0.0022547810804098845,
        0.015136691741645336,
        0.018852971494197845,
        0.022412024438381195,
        0.011570493690669537,
        -0.008040027692914009,
        -0.03721996769309044,
        -0.044052205979824066,
        -0.004638202488422394,
        0.017094885930418968,
        0.031188160181045532,
        -0.02359837479889393,
        -0.0203108973801136,
        -0.003909240011125803,
        0.045481543987989426,
        -0.01047704927623272,
        -0.0013489379780367017,
        0.013478660024702549,
        -0.003784172935411334,
        -0.004763269796967506,
        0.021211380138993263,
        -0.036762580275535583,
        -0.0006816156674176455,
        0.015708427876234055,
        -0.032274458557367325,
        -0.015422560274600983,
        0.008154374547302723,
        -0.005370738450437784,
        -0.050569988787174225,
        0.0004734683025162667,
        0.027800628915429115,
        0.023426854982972145,
        0.019067373126745224,
        0.02165447548031807,
        -0.01214222889393568,
        -0.04096483439207077,
        -0.027886388823390007,
        0.02774345502257347,
        -0.030216211453080177,
        0.014107568189501762,
        -0.010605690069496632,
        -0.046396318823099136,
        0.02674291841685772,
        -0.026657158508896828,
        -0.004263001494109631,
        0.010548516176640987,
        -0.018066836521029472,
        -0.05528680235147476,
        0.018324116244912148,
        0.018252650275826454,
        0.0032463844399899244,
        -0.0005400218651629984,
        0.007732720114290714,
        0.00803288072347641,
        -0.014400582760572433,
        -0.0006311421748250723,
        0.003500092076137662,
        0.019238892942667007,
        0.013071298599243164,
        -0.03424694389104843,
        0.01275684405118227,
        0.008347335271537304,
        -0.01648027077317238,
        -0.007185997907072306,
        0.011163132265210152,
        0.011634813621640205,
        -0.0026960892137140036,
        0.015336799435317516,
        -0.015079518780112267,
        2.787488847388886e-05,
        -0.021397193893790245,
        -0.017852434888482094,
        0.026685744524002075,
        0.0081257876008749,
        -0.01529391948133707,
        -0.022426316514611244,
        0.0406217947602272,
        -0.03141685575246811,
        -0.005867433734238148,
        0.04633914679288864,
        -0.006871543824672699,
        -0.010248355567455292,
        -0.004852603189647198,
        0.01849563792347908,
        0.025227820500731468,
        -0.04819728434085846,
        -0.011406118981540203,
        0.006103274412453175,
        0.029330020770430565,
        -0.0023351814597845078,
        -0.0006708956207148731,
        0.018681451678276062,
        0.019896388053894043,
        -0.005631592590361834,
        -0.013500100001692772,
        0.03524748235940933,
        0.013707353733479977,
        0.0020707538351416588,
        -0.016222989186644554,
        0.01686619222164154,
        0.013021271675825119,
        -0.02052529715001583,
        0.023655548691749573,
        -0.009476512670516968,
        -0.008876190520823002,
        -0.0375915952026844,
        0.004323748406022787,
        0.011606226675212383,
        -0.032874781638383865,
        -0.02184028923511505,
        -0.014607837423682213,
        -0.005728072952479124,
        0.01509381178766489,
        -0.04025016725063324,
        0.025499394163489342,
        -0.004556015599519014,
        -0.0007539759390056133,
        -0.04199395701289177,
        0.0021529407240450382,
        0.0047060963697731495,
        -0.03982136398553848,
        0.011084518395364285,
        0.018109716475009918,
        0.02105415239930153,
        -0.002949796849861741,
        0.06243349611759186,
        0.000635608856100589,
        -0.011256039142608643,
        0.025899609550833702,
        0.0208397526293993,
        0.03976419195532799,
        0.011720573529601097,
        0.069065622985363,
        -0.0162801630795002,
        0.02927284687757492,
        -0.03916386887431145,
        -0.01618010923266411,
        0.0072324518114328384,
        0.008754696696996689,
        0.006142581347376108,
        0.016208695247769356,
        0.018953025341033936,
        -0.007939973846077919,
        -0.01648027077317238,
        0.018038248643279076,
        0.00038770801620557904,
        -0.0208397526293993,
        0.008311602286994457,
        0.010326968505978584,
        0.0023941416293382645,
        -0.015636960044503212,
        0.0081400815397501,
        0.00011780874046962708,
        0.027714869007468224,
        -0.010069687850773335,
        0.0029426501132547855,
        0.01748080737888813,
        -0.024041470140218735,
        0.015679839998483658,
        0.029044153168797493,
        -0.01596570760011673,
        -0.015408266335725784,
        0.001660712412558496,
        0.015808481723070145,
        0.020796870812773705,
        0.00874754972755909,
        0.03673399239778519,
        -0.004838310182094574,
        -0.01337145920842886,
        -0.011363239027559757,
        0.002085047075524926,
        -0.03727714344859123,
        0.015150985680520535,
        -0.018838677555322647,
        0.0032124377321451902,
        0.014271942898631096,
        -0.010041100904345512,
        0.00044421153143048286,
        -0.01005539484322071,
        0.00271752942353487,
        0.0038985200226306915,
        -0.011649106629192829,
        -0.006078260950744152,
        0.010105421766638756,
        0.006385568529367447,
        0.029101327061653137,
        0.03018762357532978,
        -0.0038270531222224236,
        -0.04716816172003746,
        0.00407004076987505,
        0.0013194578932598233,
        -0.010126861743628979,
        0.029044153168797493,
        0.03130250796675682,
        -0.008668936789035797,
        0.03284619376063347,
        0.03842061385512352,
        -0.015980001538991928,
        -0.003425051923841238,
        -0.043051667511463165,
        0.03296054154634476,
        0.008811870589852333,
        0.010548516176640987,
        0.011241745203733444,
        -0.02358408086001873,
        -0.03693410009145737,
        0.031359679996967316,
        -0.012485269457101822,
        -0.01555120013654232,
        -0.025885315611958504,
        0.00020278737065382302,
        0.0024959819857031107,
        0.015565494075417519,
        0.03733431547880173,
        -0.0006682156235910952,
        0.03241739049553871,
        0.008268721401691437,
        0.0025209954474121332,
        0.026271237060427666,
        -0.015236745588481426,
        -0.008633202873170376,
        0.0034053984563797712,
        0.024255869910120964,
        -0.05065574869513512,
        0.07123821973800659,
        0.015236745588481426,
        0.013850287534296513,
        -0.039078108966350555,
        -0.01991068199276924,
        -0.014464903622865677,
        -0.015422560274600983,
        -0.050255533307790756,
        -0.010498489253222942,
        -0.05071292072534561,
        -0.004906203597784042,
        0.003108810633420944,
        0.02481331303715706,
        0.007489732466638088,
        -0.026714332401752472,
        -0.0014195115072652698,
        -0.010384142398834229,
        0.013693060725927353,
        0.0006141687626950443,
        0.003446491900831461,
        0.045681651681661606,
        0.0007271758513525128,
        0.007675546687096357,
        0.007818480022251606,
        0.004845456685870886,
        0.016108641400933266,
        -0.018124008551239967,
        -0.0004998217336833477,
        -0.01566554792225361,
        -0.002722889417782426,
        -0.033589448779821396,
        -0.02431304380297661,
        0.015980001538991928,
        -0.010634277015924454,
        0.019353240728378296,
        0.013414339162409306,
        -0.04991249367594719,
        0.03007327765226364,
        0.00068920903140679,
        0.0157656017690897,
        -0.005520819220691919,
        -0.017452219501137733,
        0.0038234798703342676,
        -0.03564769774675369,
        0.023312507197260857,
        -0.0032374511938542128,
        0.021811701357364655,
        0.03058783896267414,
        -0.016237283125519753,
        -0.015136691741645336,
        0.018581397831439972,
        0.010705743916332722,
        -0.00569233950227499,
        -0.03444705158472061,
        -0.020196549594402313,
        -0.007303918711841106,
        -0.008668936789035797,
        0.006096127908676863,
        0.018109716475009918,
        -0.013621593825519085,
        -0.011627666652202606,
        -0.04908347502350807,
        -0.020911218598484993,
        -0.004195107612758875,
        0.003777026431635022,
        0.016237283125519753,
        0.02927284687757492,
        -0.03842061385512352,
        -0.003148117568343878,
        -0.04156515747308731,
        0.005835273303091526,
        -0.03138826787471771,
        0.014472049660980701,
        0.025999663397669792,
        -0.0012060041772201657,
        0.007257464807480574,
        0.026914440095424652,
        -0.022097568958997726,
        0.022712184116244316,
        0.013678766787052155,
        -0.015065224841237068,
        0.02073969878256321,
        -0.013871727511286736,
        -0.03396107628941536,
        -0.01820977032184601,
        -0.017766674980521202,
        0.03213152289390564,
        -0.005817406810820103,
        -0.00975523330271244,
        -0.04462394118309021,
        -0.005174204707145691,
        -0.008261575363576412,
        0.00777560006827116,
        -0.0005145617760717869,
        -0.0009000364225357771,
        0.006085407454520464,
        0.033389341086149216,
        0.00985528714954853,
        -0.013678766787052155,
        0.0045631625689566135,
        -0.005109884310513735,
        0.007632666267454624,
        -0.0006306954892352223,
        -0.022011809051036835,
        -0.014257648959755898,
        0.008568882942199707,
        0.01922459900379181,
        -0.027014493942260742,
        0.0061818878166377544,
        0.011163132265210152,
        0.00839021522551775,
        0.02775774896144867,
        0.02073969878256321,
        0.0315312035381794,
        0.009790967218577862,
        0.03190283104777336,
        -0.0027139559388160706,
        0.00722173135727644,
        0.008811870589852333,
        -0.001767019391991198,
        0.035333242267370224,
        -0.010162594728171825,
        0.03270325809717178,
        0.04013581946492195,
        0.007889946922659874,
        0.008883337490260601,
        0.00488119013607502,
        -0.021297140046954155,
        0.007682693190872669,
        0.004352334886789322,
        0.02122567407786846,
        -0.016537442803382874,
        0.007968560792505741,
        0.03347510099411011,
        -0.010884410701692104,
        -0.017309285700321198,
        -0.03882082551717758,
        -0.027271773666143417,
        -0.002295874524861574,
        0.015522613190114498,
        -0.020268017426133156,
        -0.02286941185593605,
        0.023941416293382645,
        0.012370922602713108,
        0.01001966092735529,
        -0.01093443762511015,
        0.011820627376437187,
        -0.021182792261242867,
        0.0006088087684474885,
        -0.019153133034706116,
        0.030444905161857605,
        -0.04105059430003166,
        -0.02835807204246521,
        -0.0010702169965952635,
        0.003285691374912858,
        0.009090591222047806,
        -0.028029322624206543,
        -0.023655548691749573,
        0.023012345656752586,
        0.025184940546751022,
        -0.018124008551239967,
        -0.008090054616332054,
        -0.0035947856958955526,
        0.01728069968521595,
        0.008397362194955349,
        -0.0033625182695686817,
        -0.030130449682474136,
        -0.02196892909705639,
        -0.042222652584314346,
        -0.022998051717877388,
        0.012628203257918358,
        0.04699664190411568,
        0.02204039692878723,
        0.047511205077171326,
        -0.005188497714698315,
        -0.03396107628941536,
        -0.0188100915402174,
        -0.002085047075524926,
        0.022440610453486443,
        -0.0035251055378466845,
        -0.007961413823068142,
        0.002331607975065708,
        0.01586565561592579,
        0.015894241631031036,
        0.022712184116244316,
        -0.015265332534909248,
        0.0157513078302145,
        0.021825995296239853,
        0.004448815248906612,
        0.02479901909828186,
        0.0025138487108051777,
        0.006031807512044907,
        -0.005038417410105467,
        0.022840825840830803,
        -0.003446491900831461,
        -0.023970002308487892,
        0.02898697927594185,
        -0.031159574165940285,
        -0.008440242148935795,
        0.012606763280928135,
        0.0014963385183364153,
        -0.004884763620793819,
        0.005535112228244543,
        0.003603719174861908,
        9.871367365121841e-05,
        -0.008797576650977135,
        -0.032989125698804855,
        -0.002240487840026617,
        -0.011055931448936462,
        0.02631411701440811,
        -0.00031244440469890833,
        0.08610333502292633,
        0.00884760357439518,
        -0.03110240027308464,
        -0.003589425701647997,
        0.008297308348119259,
        -0.022740771993994713,
        -0.012799724005162716,
        -0.035018786787986755,
        0.0019349666545167565,
        -0.005331431515514851,
        0.011620519682765007,
        0.023655548691749573,
        0.009433632716536522,
        0.0020082201808691025,
        -0.024127230048179626,
        0.012085055001080036,
        -0.03238880634307861,
        -0.01839558407664299,
        -0.02419869601726532,
        -0.008068614639341831,
        0.007236024830490351,
        -0.005195644684135914,
        -0.011870654299855232,
        -0.022697892040014267,
        -0.01889585144817829,
        0.01688048429787159,
        0.011706280522048473,
        0.017923902720212936,
        0.009891021065413952,
        0.0032463844399899244,
        0.037763118743896484,
        -0.0030552104581147432,
        -0.022497784346342087,
        0.001256030984222889,
        -0.014314822852611542,
        0.04096483439207077,
        -0.016022881492972374,
        -0.008811870589852333,
        -0.00384849333204329,
        -0.007157411426305771,
        -0.021211380138993263,
        0.007561199367046356,
        -0.005167057737708092,
        0.03504737466573715,
        -0.011691986583173275,
        -0.013435780070722103,
        0.014807944186031818,
        0.014429169707000256,
        -0.00424513453617692,
        -0.016708964481949806,
        -0.02674291841685772,
        0.000353314564563334,
        -0.007982853800058365,
        0.003182064276188612,
        -0.0050062574446201324,
        -0.03336075320839882,
        -0.00015588720270898193,
        0.030645012855529785,
        -0.015694133937358856,
        -0.012949804775416851,
        -0.003973560407757759,
        0.012463829480111599,
        -0.006203328259289265,
        -0.009419338777661324,
        -0.008547442965209484,
        -0.003089157398790121,
        -0.030444905161857605,
        -0.0002349474816583097,
        -0.013936048373579979,
        -0.0008879763772711158,
        -0.042422760277986526,
        -0.038477785885334015,
        0.018166888505220413,
        0.0028354497626423836,
        -0.004173667635768652,
        -0.007453999016433954,
        -0.012642497196793556,
        0.015794187784194946,
        -0.007114531006664038,
        -0.0006695556221529841,
        0.020868338644504547,
        0.027600521221756935,
        -0.010248355567455292,
        0.034504227340221405,
        -0.016894778236746788,
        -0.04516708850860596,
        0.017566567286849022,
        0.00960515346378088,
        0.004509562160819769,
        0.010534223169088364,
        -0.03710561990737915,
        -0.028386658057570457,
        -0.0034196916967630386,
        0.04819728434085846,
        0.025971075519919395,
        -0.0008598362910561264,
        -0.02499912679195404,
        0.007575492840260267,
        -3.316511356388219e-05,
        -0.02469896525144577,
        0.00293550337664783,
        0.004159374162554741,
        -0.05317138507962227,
        -0.013078444637358189,
        -0.007811333518475294,
        -0.024341629818081856,
        -0.018981611356139183,
        0.0037162795197218657,
        -0.0289583932608366,
        0.008504563011229038,
        0.0068608238361775875,
        0.017938194796442986,
        0.01931036077439785,
        -0.0031945710070431232,
        -3.24671964335721e-05,
        -0.031960003077983856,
        -0.019267478957772255,
        -0.0032374511938542128,
        -0.006371275521814823,
        -0.028215136379003525,
        -0.004581029061228037,
        0.0001660489069763571,
        -0.000849116244353354,
        0.015937121585011482,
        0.033903904259204865,
        -0.019953561946749687,
        0.010862970724701881,
        -0.0264141708612442,
        0.007839919999241829,
        -0.0037877464201301336,
        -0.01422191597521305,
        0.021625887602567673,
        0.00920493807643652,
        -0.008668936789035797,
        -0.0024513150565326214,
        -0.002156514208763838,
        0.011599079705774784,
        -0.00038748467341065407,
        -0.003741292981430888,
        -0.006817943416535854,
        0.011563346721231937,
        0.006553515791893005,
        -0.011177425272762775,
        0.02419869601726532,
        -0.004895483609288931,
        -0.012013588100671768,
        0.0063677020370960236,
        0.005081297364085913,
        -0.03844919800758362,
        -0.02001073583960533,
        -0.00858317594975233,
        -0.01529391948133707,
        -0.004420228768140078,
        -0.002735396148636937,
        0.03701985999941826,
        -0.004409508313983679,
        0.007504025939851999,
        -0.008418802171945572,
        -0.005742366425693035,
        0.024570325389504433,
        -0.047768484801054,
        0.006321248598396778,
        -0.013735940679907799,
        -0.00406646728515625,
        0.007261038292199373,
        0.03258891403675079,
        0.004152227658778429,
        -0.01982492208480835,
        0.010648570023477077,
        0.005720926448702812,
        0.02115420624613762,
        -0.0025674488861113787,
        0.020453831180930138,
        -0.02471325919032097,
        0.005152764264494181,
        -0.06563521176576614,
        -0.004731109831482172,
        0.009840994141995907,
        0.007257464807480574,
        -0.006746476516127586,
        0.0010836170986294746,
        -0.005377885419875383,
        0.008082907646894455,
        0.0032821178901940584,
        -0.02338397316634655,
        -0.043366122990846634,
        0.0032392379362136126,
        -0.009905314072966576,
        -0.008554589934647083,
        -0.036133673042058945,
        0.017709501087665558,
        -0.009898167103528976,
        -0.013178498484194279,
        -0.017037712037563324,
        0.010026807896792889,
        -0.01509381178766489,
        0.02794356271624565,
        -0.011963561177253723,
        -0.006835810374468565,
        0.048540327697992325,
        0.010820090770721436,
        0.008718963712453842,
        0.01922459900379181,
        0.0011908174492418766,
        -0.02306951954960823,
        0.017923902720212936,
        -0.013492953032255173,
        0.016323043033480644,
        -0.008011440746486187,
        -0.024941952899098396,
        -0.02824372425675392,
        -0.038878001272678375,
        0.047311097383499146,
        0.026457050815224648,
        0.007668399717658758,
        -0.0061961812898516655,
        -0.016208695247769356,
        0.009898167103528976,
        0.026371290907263756,
        -0.022283382713794708,
        0.014493489637970924,
        0.01605146937072277,
        0.0007173491176217794,
        -0.026471344754099846,
        -0.05957482010126114,
        0.0033303580712527037,
        0.01467930432409048,
        -0.01229945570230484,
        -0.013264259323477745,
        0.03779170289635658,
        0.0018813664792105556,
        -0.019782042130827904,
        -0.02674291841685772,
        0.03727714344859123,
        -0.0046346294693648815,
        0.043366122990846634,
        -0.00579596683382988,
        -0.02102556638419628,
        0.008297308348119259,
        0.030873706564307213,
        0.01483653113245964,
        -0.007325358688831329,
        0.023541200906038284,
        -0.0044059352949261665,
        0.0034179051872342825,
        0.013707353733479977,
        0.04419513791799545,
        0.0024870485067367554,
        -0.00010770287190098315,
        -0.0027318226639181376,
        0.0071967183612287045,
        0.0386207215487957,
        -0.005445778835564852,
        -0.016494562849402428,
        -0.003621585899963975,
        -0.05014118552207947,
        0.018481343984603882,
        0.039106693118810654,
        -0.009783820249140263,
        0.002631769049912691,
        -0.02063964493572712,
        0.0182955302298069,
        0.01031982246786356,
        -0.048340220004320145,
        -0.02552798204123974,
        0.02125426009297371,
        0.00470252288505435,
        0.008168668486177921,
        0.003078437177464366,
        0.026356996968388557,
        -0.007504025939851999,
        -0.0034840120933949947,
        0.007271758280694485,
        0.022126156836748123,
        0.031960003077983856,
        0.006407008972018957,
        0.007182424888014793,
        -0.0005248351371847093,
        -0.0060746874660253525,
        0.009676620364189148,
        0.047339681535959244,
        -0.018867265433073044,
        0.009104885160923004,
        -0.012378069572150707,
        0.0467679463326931,
        0.003548332257196307,
        -0.02338397316634655,
        0.014150449074804783,
        0.013750233687460423,
        0.018138302490115166,
        0.016494562849402428,
        0.01952476054430008,
        -0.0016312323277816176,
        0.014050395227968693,
        -0.03956408426165581,
        -0.010441316291689873,
        -0.018138302490115166,
        -0.005527965724468231,
        0.0011050571920350194,
        0.0021457939874380827,
        0.0008080227999016643,
        0.0035411855205893517,
        0.003162410808727145,
        0.008733256720006466,
        0.022826531901955605,
        0.028944099321961403,
        -0.005052710883319378,
        0.03770594298839569,
        0.002565662143751979,
        -0.0061747413128614426,
        0.00660354271531105,
        -0.013357166200876236,
        0.01799536868929863,
        0.023526906967163086,
        0.013557272963225842,
        -0.012135081924498081,
        -0.007411119062453508,
        0.030873706564307213,
        -0.021983223035931587,
        -0.027900682762265205,
        0.03236021846532822,
        0.02987316995859146,
        0.012077908031642437,
        -0.008776136673986912,
        -0.031960003077983856,
        -0.04536719620227814,
        -0.01636592298746109,
        -0.026156889274716377,
        -0.02144007384777069,
        0.0187957976013422,
        0.01132750604301691,
        0.015265332534909248,
        -0.05540115013718605,
        -0.0017357526812702417,
        -0.030216211453080177,
        -0.010076834820210934,
        -0.01972486823797226,
        0.018252650275826454,
        -0.0032267312053591013,
        -0.007453999016433954,
        0.005470792297273874,
        -0.0059674871154129505,
        -0.008668936789035797,
        0.02409864217042923,
        0.020668230950832367,
        0.010855823755264282,
        -0.012342335656285286,
        -0.014071835204958916,
        0.023126693442463875,
        -0.008919070474803448,
        -0.0032553179189562798,
        0.010598543100059032,
        0.0018634997541084886,
        0.006310528609901667,
        0.01184206735342741,
        -0.019767748191952705,
        0.021068446338176727,
        0.021111326292157173,
        -0.03913528099656105,
        -0.0065821027383208275,
        -0.03090229257941246,
        0.015679839998483658,
        -0.019253186881542206,
        0.05122748389840126,
        -0.001148830633610487,
        0.0019367533968761563,
        0.019138839095830917,
        -0.014371995814144611,
        -0.009004831314086914,
        0.031159574165940285,
        0.011663400568068027,
        -0.037162795662879944,
        0.027914976701140404,
        -0.0651206523180008,
        0.021325726062059402,
        0.013328579254448414,
        -0.0020975538063794374,
        0.007246744818985462,
        -0.039106693118810654,
        -0.01921030692756176,
        0.027786334976553917,
        0.05500093474984169,
        0.008647496812045574,
        -0.045195676386356354,
        0.033989664167165756,
        0.039106693118810654,
        3.55938718712423e-05,
        -0.00032405779347755015,
        -0.0015365385916084051
      ],
      "url": "https://www.bbc.com/news/articles/c04dwqr5lkvo",
      "source": "BBC News",
      "published": "2025-07-23",
      "sentiment_score": 0.75,
      "reasoning": "The article highlights a technological advancement where AI is used to fill in missing words from ancient inscriptions, which can significantly enhance our understanding of ancient Rome. This represents a positive use of technology to solve a real problem in historical research and education.",
      "category": "Technology",
      "personality_title": "AI helps uncover lost words from ancient Roman inscriptions",
      "personality_presentation": "**Context**\nMany ancient Roman inscriptions, etched on monuments and everyday objects, have become damaged or incomplete over time. These gaps make it hard for historians to fully understand Roman history.\n\n**What happened**\nScientists have developed a new AI system that can predict missing words in broken inscriptions. This tool looks at the fragments, estimates when they were made, and even guesses their original location.\n\n**Impact**\nBy filling in the missing pieces, this AI helps historians get a clearer picture of life in ancient Rome. It opens the door to better understanding the culture, language, and events of the time.\n\n**What's next step**\nResearchers plan to apply this AI to more ancient texts and objects, broadening our knowledge of human history beyond Rome. They will also refine the system to improve its accuracy.\n\n**One-sentence takeaway**\nAI is now helping to bring lost ancient Roman words back to life, enriching our connection to the past.",
      "personality_title_fr": "L'IA aide à retrouver les mots perdus des inscriptions romaines anciennes",
      "personality_presentation_fr": "**Contexte**\nDe nombreuses inscriptions romaines anciennes, gravées sur des monuments et des objets du quotidien, sont endommagées ou incomplètes avec le temps. Ces lacunes compliquent la compréhension complète de l'histoire romaine.\n\n**Ce qui s'est passé**\nDes scientifiques ont développé un nouveau système d'IA capable de prédire les mots manquants dans les inscriptions cassées. Cet outil analyse les fragments, estime leur date et devine leur emplacement d'origine.\n\n**Impact**\nEn comblant ces blancs, cette IA aide les historiens à mieux comprendre la vie dans la Rome antique. Elle permet de mieux saisir la culture, la langue et les événements de cette époque.\n\n**Étape suivante**\nLes chercheurs prévoient d'appliquer cette IA à plus de textes et d'objets anciens, élargissant ainsi nos connaissances de l'histoire humaine au-delà de Rome. Ils vont aussi améliorer la précision du système.\n\n**Conclusion en une phrase**\nL'IA aide aujourd'hui à redonner vie aux mots perdus de la Rome antique, renforçant notre lien avec le passé.",
      "personality_title_es": "La IA ayuda a recuperar palabras perdidas de inscripciones romanas antiguas",
      "personality_presentation_es": "**Contexto**\nMuchas inscripciones romanas antiguas, grabadas en monumentos y objetos cotidianos, se han dañado o están incompletas con el tiempo. Estas lagunas dificultan entender completamente la historia romana.\n\n**Qué pasó**\nCientíficos desarrollaron un nuevo sistema de IA que puede predecir las palabras faltantes en inscripciones rotas. Esta herramienta analiza los fragmentos, estima su fecha e incluso adivina su ubicación original.\n\n**Impacto**\nAl llenar los espacios faltantes, esta IA ayuda a los historiadores a obtener una imagen más clara de la vida en la antigua Roma. Abre la puerta para entender mejor la cultura, el idioma y los eventos de esa época.\n\n**Próximo paso**\nLos investigadores planean aplicar esta IA a más textos y objetos antiguos, ampliando nuestro conocimiento de la historia humana más allá de Roma. También mejorarán la precisión del sistema.\n\n**Conclusión en una frase**\nLa IA está ayudando a devolver a la vida las palabras perdidas de la antigua Roma, enriqueciendo nuestra conexión con el pasado.",
      "image_url": "public/images/news_image_Gaps-in-our-knowledge-of-ancient-Rome-could-be-fil.png",
      "image_prompt": "A detailed, warm-toned painting of ancient Roman stone inscriptions with visible cracks and missing pieces, gently illuminated by a soft light shaped like a glowing, abstract neural network weaving golden threads that connect fragmented letters and symbols, set against a calm, neutral background to symbolize AI piecing together history."
    },
    {
      "title": "Watch the Earth split in real time: Stunning footage reveals a 2. 5-meter fault slip in seconds",
      "summary": "A colossal 7.7 magnitude earthquake rocked central Myanmar in March 2025, marking the strongest quake in over a century. What makes this event groundbreaking isn't just the seismic power—it’s the unprecedented footage captured by a CCTV camera near the fault line. Researchers at Kyoto University used this rare video to measure the fault’s movement in stunning detail, confirming a rapid, pulse-like rupture and a subtle curve in the slip path. This real-time visual data opens a new frontier in earthquake science, potentially transforming how we understand and predict seismic behavior.",
      "content": "During the midday Friday prayer hours on March 28, 2025, a magnitude 7.7 earthquake struck central Myanmar along the Sagaing Fault. With an epicenter close to Mandalay, the country's second-largest city, it was the most powerful earthquake to strike Myanmar in more than a century and the second deadliest in its modern history.\n\nThe cause was a strike-slip fault, in which two masses of earth \"slip\" past each other horizontally along a vertical fault plane. To an observer, it would look like the ground were split in two along a defined line, with both sides being wrenched past each other in opposite directions.\n\nPrevious seismological studies have inferred pulse-like rupture behavior and curved slip paths from the analysis of seismic data. However, because the recording instruments were at a considerable distance from the fault itself, these findings were indirect.\n\nThis time, however, a CCTV camera caught this slip in action, presenting a unique opportunity for a team researchers at Kyoto University to study the fault motion in real time. (See video link at bottom of article.)\n\nThe team applied a technique known as pixel cross-correlation to the CCTV footage to analyze the fault's movement frame-by-frame. Their analysis reveals that the fault slipped sideways 2.5 meters in just 1.3 seconds, with a maximum speed of 3.2 meters per second. The total sideways movement recorded during this earthquake is typical of strike-slip ruptures, but the short duration of the fault slip is a major discovery.\n\n\"The brief duration of motion confirms a pulse-like rupture, characterized by a concentrated burst of slip propagating along the fault, much like a ripple traveling down a rug when flicked from one end,\" says corresponding author Jesse Kearse.\n\nThe team's analysis also proves that the slip path was subtly curved, a finding which aligns with previous geological observations from faults around the world. This may suggest that such slips are typically curved, as opposed to being completely linear.\n\nThe study demonstrates that video-based monitoring of faults is a powerful tool for seismology, enabling unprecedented insights into earthquake behavior. Capturing this level of detail is fundamental to improving our understanding of earthquake processes and enhancing our ability to anticipate the ground shaking expected in future large events.\n\n\"We did not anticipate that this video record would provide such a rich variety of detailed observations. Such kinematic data is critical for advancing our understanding of earthquake source physics,\" says Kearse.\n\nThe next phase of their research will utilize physics-based models to investigate the factors that control fault behavior as revealed by this analysis.",
      "embedding": [
        -0.005455358885228634,
        0.031036527827382088,
        -0.00023835364845581353,
        0.07544632256031036,
        -0.054260000586509705,
        0.01850208453834057,
        0.01161772757768631,
        0.0261234100908041,
        -0.03439182788133621,
        -0.031324125826358795,
        0.04174952208995819,
        0.009269017726182938,
        -0.031276192516088486,
        -0.02597961202263832,
        0.011006583459675312,
        -0.0018963438924401999,
        -0.024637490510940552,
        -0.02497302182018757,
        -0.031084461137652397,
        0.0029987997841089964,
        -0.018573984503746033,
        -0.022228864952921867,
        0.029143180698156357,
        0.018442168831825256,
        0.011282197199761868,
        -0.04941878095269203,
        -0.04402633383870125,
        0.021126409992575645,
        0.011851400136947632,
        0.011366080492734909,
        -0.0036488892510533333,
        -0.025308551266789436,
        -0.004101255442947149,
        -0.041965220123529434,
        -0.07482320070266724,
        0.0061174314469099045,
        -0.009364883415400982,
        -0.0323307141661644,
        -0.009011378511786461,
        0.010059909895062447,
        0.0015263621462509036,
        -0.06116233393549919,
        0.010653078556060791,
        0.044505663216114044,
        -0.027106033638119698,
        -0.024709390476346016,
        -0.04671057313680649,
        0.07343314588069916,
        0.0067944834008812904,
        0.04119829460978508,
        0.016632704064249992,
        -0.01995205320417881,
        0.040718965232372284,
        -0.033912498503923416,
        0.03424803167581558,
        -0.01826241984963417,
        0.01971239037811756,
        0.06140199676156044,
        -0.04040740430355072,
        -0.043570972979068756,
        0.025883745402097702,
        -0.0016761523438617587,
        -0.03559014946222305,
        0.014859187416732311,
        0.006183339282870293,
        -0.054260000586509705,
        -0.007213895674794912,
        0.027777094393968582,
        0.001226032734848559,
        0.019688423722982407,
        0.018933480605483055,
        -0.010623120702803135,
        0.03300177678465843,
        0.0014956550439819694,
        0.044266000390052795,
        -0.021581770852208138,
        0.0016716585960239172,
        0.030389435589313507,
        -0.01636907272040844,
        -0.00932893343269825,
        0.052869945764541626,
        0.02765726111829281,
        -0.06451763212680817,
        0.029838206246495247,
        -0.04941878095269203,
        0.08105447143316269,
        -0.025907712057232857,
        -0.03177948668599129,
        -0.008669856935739517,
        0.014835220761597157,
        -0.018322337418794632,
        0.001148141804151237,
        0.011348105035722256,
        -0.005197719670832157,
        -0.025140786543488503,
        0.04189332202076912,
        0.05315754562616348,
        0.01881364919245243,
        0.008993403054773808,
        -0.033816635608673096,
        -0.014475724659860134,
        0.010677045211195946,
        0.010329531505703926,
        -0.016488904133439064,
        0.06159373000264168,
        0.07626118510961533,
        -0.010389448143541813,
        -0.02348710224032402,
        0.006189330946654081,
        0.006716592237353325,
        0.02228878065943718,
        -0.017735159024596214,
        0.0031276193913072348,
        0.0015937676653265953,
        -0.02890351600944996,
        -0.01895744726061821,
        0.01692030020058155,
        -0.03940081223845482,
        0.0035859772469848394,
        -0.006345112808048725,
        -0.03420009836554527,
        0.016980215907096863,
        -0.015901727601885796,
        -0.003361291950568557,
        0.026482906192541122,
        0.009982018731534481,
        -0.01612940803170204,
        0.03343317285180092,
        -0.04055120050907135,
        0.016153374686837196,
        0.002916414989158511,
        -0.011857392266392708,
        0.02964647486805916,
        0.02931094542145729,
        0.014116227626800537,
        0.002979326993227005,
        -0.03657277300953865,
        0.010191724635660648,
        -0.042276784777641296,
        0.005026958882808685,
        -0.03307367488741875,
        0.000870281015522778,
        0.048891518265008926,
        -0.0019322935258969665,
        0.03259434551000595,
        0.01682443544268608,
        0.0021674642339348793,
        0.0477650985121727,
        0.06571595370769501,
        -0.04050326719880104,
        0.03549428656697273,
        -0.013876563869416714,
        0.004062310326844454,
        -0.016632704064249992,
        0.00873576384037733,
        -0.015853794291615486,
        0.020383449271321297,
        0.03439182788133621,
        -0.0029418794438242912,
        -0.02528458461165428,
        -0.016608737409114838,
        0.03355300426483154,
        -0.004895143676549196,
        0.03523065522313118,
        0.03139602392911911,
        0.055602122098207474,
        -0.05780703201889992,
        -0.018897531554102898,
        -0.06585974991321564,
        -0.07453560084104538,
        -0.012702208943665028,
        0.00855601578950882,
        0.021366072818636894,
        0.0149310864508152,
        0.01592569425702095,
        -0.009934085421264172,
        0.0003385258314665407,
        -0.039328914135694504,
        0.0029673436656594276,
        -0.008663864806294441,
        0.005467342212796211,
        -0.010940675623714924,
        -0.007998796179890633,
        0.054260000586509705,
        -0.02059914730489254,
        0.04016773775219917,
        -0.0025149774737656116,
        0.09265422075986862,
        0.0039185113273561,
        0.0013638397213071585,
        -0.04603951424360275,
        0.051527827978134155,
        -0.003660872345790267,
        0.03328937292098999,
        0.03302574157714844,
        0.0026003578677773476,
        0.027082066982984543,
        0.011216290295124054,
        0.026339108124375343,
        -0.06758533418178558,
        -0.036788471043109894,
        0.009269017726182938,
        0.018633900210261345,
        -0.0223966296762228,
        0.024158162996172905,
        -0.03403233364224434,
        0.014703406020998955,
        0.04812459275126457,
        -0.06844812631607056,
        0.01805870607495308,
        0.021821435540914536,
        0.025044919922947884,
        0.050377439707517624,
        -0.016584770753979683,
        0.03115636110305786,
        -0.00855601578950882,
        -0.0020745941437780857,
        0.027010168880224228,
        0.023307355120778084,
        -0.02617134340107441,
        -0.025236651301383972,
        0.013493101112544537,
        0.034463729709386826,
        0.012294779531657696,
        -0.016285190358757973,
        -0.04067103564739227,
        0.02552424930036068,
        0.041725557297468185,
        0.03189932182431221,
        -0.011899333447217941,
        -0.022528445348143578,
        -0.01527860015630722,
        0.04474532604217529,
        -0.027489496394991875,
        -0.001927799778059125,
        -0.0011451460886746645,
        0.016440972685813904,
        0.04941878095269203,
        -0.025763913989067078,
        0.01692030020058155,
        0.046351078897714615,
        0.021617721766233444,
        -0.01067105308175087,
        -0.01906529627740383,
        -0.05066503584384918,
        0.04150985926389694,
        -0.01587776094675064,
        0.025548215955495834,
        -0.03559014946222305,
        0.06250445544719696,
        0.018969429656863213,
        0.016093458980321884,
        -0.020718980580568314,
        -0.006099456921219826,
        0.0020581171847879887,
        -0.027825025841593742,
        -0.03762729838490486,
        0.04155779257416725,
        -0.004949068184942007,
        0.02189333550632,
        0.026746537536382675,
        -0.002564408117905259,
        -0.04055120050907135,
        -0.008376267738640308,
        -0.006722583901137114,
        -0.048436157405376434,
        -0.016105441376566887,
        -0.030125804245471954,
        -7.751642260700464e-05,
        -0.031515855342149734,
        0.018585966899991035,
        -0.03393646702170372,
        0.006578785367310047,
        -0.03415216505527496,
        -0.04035947099328041,
        0.023319337517023087,
        0.014655472710728645,
        -0.013445167802274227,
        0.018430186435580254,
        0.01562611386179924,
        0.012522459961473942,
        0.004194125533103943,
        0.029430776834487915,
        -0.006746550556272268,
        -0.02732173167169094,
        -0.012977822683751583,
        -0.013576983474195004,
        -0.005841817706823349,
        -0.002934389980509877,
        -0.018430186435580254,
        0.052774082869291306,
        -0.059628479182720184,
        0.004832231905311346,
        -0.013744748197495937,
        -0.03559014946222305,
        0.008741755969822407,
        0.033265408128499985,
        0.022804059088230133,
        0.005137803498655558,
        -0.0006837922264821827,
        -0.011623718775808811,
        -0.039928074926137924,
        -0.010659070685505867,
        0.03398440033197403,
        -0.01253444328904152,
        0.10363084822893143,
        0.011048524640500546,
        -0.05958054959774017,
        -0.022851992398500443,
        0.015470331534743309,
        -0.04349907115101814,
        -0.032570380717515945,
        -0.0011099453549832106,
        0.01034750696271658,
        0.0018319340888410807,
        -0.026458939537405968,
        -0.005029954947531223,
        0.0035380444023758173,
        -0.009137202054262161,
        -0.021282190456986427,
        0.05263028293848038,
        -0.05910122022032738,
        0.012594359926879406,
        -0.03163569048047066,
        -0.04810062795877457,
        0.010832826606929302,
        -0.02756139636039734,
        -0.051479894667863846,
        -0.027753127738833427,
        -0.013768714852631092,
        -0.022720176726579666,
        0.0005025460850447416,
        0.026986202225089073,
        0.011821442283689976,
        -0.03563808277249336,
        0.024158162996172905,
        0.03870578482747078,
        0.0042839995585381985,
        0.0343199297785759,
        -0.011755534447729588,
        -0.00855601578950882,
        0.003112640231847763,
        0.03523065522313118,
        0.035805847495794296,
        0.005527258384972811,
        0.021366072818636894,
        0.02964647486805916,
        -0.03436786308884621,
        -0.031324125826358795,
        -0.025692014023661613,
        -0.04805269464850426,
        -0.04572794958949089,
        -0.007866981439292431,
        0.01721988059580326,
        0.05517072603106499,
        -0.021186325699090958,
        -0.029598543420433998,
        0.032666247338056564,
        0.0044158147647976875,
        -0.0293588787317276,
        -0.05349307507276535,
        -0.016896333545446396,
        0.046446945518255234,
        -0.010329531505703926,
        -0.014463741332292557,
        0.032714176923036575,
        -0.05651284381747246,
        -0.018789682537317276,
        0.007213895674794912,
        0.00873576384037733,
        -0.04359493777155876,
        0.006375070661306381,
        -0.02955061011016369,
        -0.010335523635149002,
        -0.006231272127479315,
        -0.044361863285303116,
        0.02149788849055767,
        -0.0018783690175041556,
        0.0027067088522017,
        -0.021366072818636894,
        0.024361876770853996,
        -0.02528458461165428,
        0.03307367488741875,
        -0.009388849139213562,
        -0.013768714852631092,
        0.04891548678278923,
        0.001975732622668147,
        0.017435578629374504,
        0.015650080516934395,
        0.004904130939394236,
        0.0537327378988266,
        0.05195922404527664,
        0.024266012012958527,
        -0.021809453144669533,
        0.03420009836554527,
        0.02593167871236801,
        0.09246249496936798,
        0.0006103950436227024,
        -0.002531454199925065,
        0.03813059255480766,
        -0.031419992446899414,
        0.008016771636903286,
        0.025835812091827393,
        0.009520664811134338,
        0.024757323786616325,
        0.043115608394145966,
        -0.05114436522126198,
        -0.031923286616802216,
        -0.006075490266084671,
        0.01811862178146839,
        0.0006092716357670724,
        -0.01666865311563015,
        0.016728568822145462,
        -0.03070099838078022,
        0.0186578668653965,
        -0.04146192595362663,
        -0.06279204785823822,
        0.014727371744811535,
        -0.018837615847587585,
        0.030844796448946,
        -0.0025958640035241842,
        -0.03925701603293419,
        -0.022121015936136246,
        0.059484682977199554,
        0.00038982898695394397,
        0.04457756131887436,
        0.007153979502618313,
        -0.004799277987331152,
        0.07333727926015854,
        -0.026458939537405968,
        0.027872959151864052,
        -0.043067678809165955,
        0.007621325086802244,
        -0.01602155901491642,
        0.03050926700234413,
        0.0497543103992939,
        -0.04091069847345352,
        -0.046351078897714615,
        -0.015901727601885796,
        0.022252831608057022,
        -0.0016566795529797673,
        0.001411023666150868,
        0.0368124395608902,
        -0.0037357674445956945,
        0.059436749666929245,
        -0.0029838206246495247,
        0.0015023956075310707,
        0.00481425691395998,
        0.0035739941522479057,
        0.013001789338886738,
        9.614658483769745e-05,
        -0.012582376599311829,
        -0.013193520717322826,
        -0.04083880037069321,
        -0.023007774725556374,
        0.005946670658886433,
        0.01657278649508953,
        -0.03503892198204994,
        0.04148589074611664,
        0.011959249153733253,
        0.020287584513425827,
        0.018346302211284637,
        0.013349302113056183,
        0.029574576765298843,
        -0.01766325905919075,
        0.024709390476346016,
        -0.003603952005505562,
        -0.012546426616609097,
        0.007100055459886789,
        0.013672849163413048,
        -0.030724965035915375,
        0.0032804051879793406,
        9.408696496393532e-05,
        0.043211475014686584,
        -0.021773502230644226,
        -0.012798074632883072,
        -0.006830432917922735,
        -0.016297172755002975,
        0.01711203157901764,
        0.021917302161455154,
        0.00932893343269825,
        -0.00649490300565958,
        0.013145587407052517,
        0.004355899058282375,
        -0.02204911597073078,
        -0.034056298434734344,
        -0.02004791982471943,
        -0.0018139592139050364,
        -0.006351104471832514,
        -0.012474527582526207,
        -0.10219286382198334,
        -0.006147389765828848,
        0.0612102672457695,
        -0.010251641273498535,
        0.008370276540517807,
        -0.008478124625980854,
        0.0067944834008812904,
        -0.03177948668599129,
        -0.035158753395080566,
        0.005712998099625111,
        0.01677650213241577,
        0.021773502230644226,
        -0.000305010296870023,
        -0.09322942048311234,
        -0.026794470846652985,
        0.0071599711664021015,
        0.0065727937035262585,
        0.04817252606153488,
        0.04438583180308342,
        0.0118154501542449,
        -0.012031148187816143,
        0.02880765125155449,
        0.00722587900236249,
        0.01726781390607357,
        0.038681820034980774,
        0.021677637472748756,
        0.029886139556765556,
        0.008520066738128662,
        0.016632704064249992,
        -0.009269017726182938,
        -0.013636899180710316,
        -0.029215078800916672,
        0.01179148443043232,
        -0.013636899180710316,
        -0.040527235716581345,
        -0.027801061049103737,
        -0.015386449173092842,
        0.006578785367310047,
        0.01925702765583992,
        -0.03662070631980896,
        -0.008867579512298107,
        -0.024996988475322723,
        -0.005638103000819683,
        -0.017890941351652145,
        -0.02418212965130806,
        -0.019976019859313965,
        -0.005302573088556528,
        -0.05258234962821007,
        0.009622521698474884,
        0.03288194537162781,
        0.009472731500864029,
        -0.008759730495512486,
        0.0008433188195340335,
        -0.014200110919773579,
        -0.0011346606770530343,
        0.019376859068870544,
        0.007795081939548254,
        -0.00938285794109106,
        0.018921498209238052,
        0.004982022102922201,
        0.010113834403455257,
        -0.020982610061764717,
        -0.015206700190901756,
        -0.014811254106462002,
        0.032115016132593155,
        0.03213898465037346,
        -0.0046375044621527195,
        0.039928074926137924,
        0.02304372377693653,
        -0.003214497584849596,
        0.008567999117076397,
        0.035901714116334915,
        -0.008370276540517807,
        0.014691422693431377,
        -0.021270208060741425,
        -0.030029937624931335,
        -0.013588966801762581,
        0.006650684867054224,
        0.02542838267982006,
        0.0068064662627875805,
        -0.02372676692903042,
        -0.062120988965034485,
        0.051623694598674774,
        -0.023547017946839333,
        -0.007303769700229168,
        0.016632704064249992,
        0.02358296886086464,
        -0.001748051610775292,
        0.03300177678465843,
        -0.03436786308884621,
        -0.01127021387219429,
        -0.02399039827287197,
        0.007405627053231001,
        -0.014619522728025913,
        -0.04599158093333244,
        0.0009826236637309194,
        0.011168356984853745,
        -0.015482314862310886,
        -0.0005808114656247199,
        0.03070099838078022,
        -0.02170160412788391,
        -0.010167758911848068,
        0.013840613886713982,
        0.042516447603702545,
        0.019640490412712097,
        0.024709390476346016,
        -0.010437380522489548,
        -0.021138392388820648,
        -0.04488912597298622,
        -0.004826240241527557,
        -0.008094661869108677,
        -0.028088657185435295,
        0.01870580017566681,
        0.022456545382738113,
        0.027705194428563118,
        -0.025907712057232857,
        -0.005859792232513428,
        0.012426594272255898,
        -0.032762110233306885,
        -0.006446970161050558,
        -0.01944875903427601,
        0.025859778746962547,
        0.00838225893676281,
        -0.025308551266789436,
        0.016944266855716705,
        -0.02852005325257778,
        0.004541638772934675,
        0.03616534546017647,
        0.04143796116113663,
        0.005656077992171049,
        -0.01780705899000168,
        0.015494298189878464,
        0.04225281998515129,
        -0.0383223220705986,
        0.010868776589632034,
        0.023067690432071686,
        -0.033169541507959366,
        -0.020539231598377228,
        -0.04738163575530052,
        -0.028975415974855423,
        0.03700416907668114,
        -0.03302574157714844,
        0.009784295223653316,
        -0.040623102337121964,
        -0.0035290569067001343,
        -0.005784897133708,
        0.03439182788133621,
        0.00932893343269825,
        0.011785492300987244,
        -0.04115036129951477,
        0.02736966498196125,
        0.037195902317762375,
        0.0014656970743089914,
        -0.005146791227161884,
        0.023750733584165573,
        -0.00674055889248848,
        0.03573394939303398,
        0.005760930944234133,
        -0.004469739273190498,
        0.004188133869320154,
        0.011030550114810467,
        -0.007477526552975178,
        -0.015146784484386444,
        -0.024266012012958527,
        -0.01751946099102497,
        -0.004248050041496754,
        0.0156740453094244,
        0.008394242264330387,
        -0.01712401583790779,
        -0.025859778746962547,
        -0.033313337713479996,
        0.02681843750178814,
        -0.022228864952921867,
        -0.021905317902565002,
        -0.01415217760950327,
        -0.0012477523414418101,
        -0.009940077550709248,
        0.027177933603525162,
        0.02397841401398182,
        0.011527853086590767,
        0.04064706712961197,
        -0.016452955082058907,
        -0.01497901976108551,
        0.06413417309522629,
        0.02861591801047325,
        -0.027441563084721565,
        0.019616523757576942,
        -0.031419992446899414,
        -0.01313360407948494,
        -0.009125218726694584,
        0.04965844377875328,
        0.011647685430943966,
        -0.027345698326826096,
        0.00019051440176554024,
        0.002423605415970087,
        0.002938883611932397,
        0.01592569425702095,
        0.04433789849281311,
        -0.018382253125309944,
        -0.005539241246879101,
        -0.010149783454835415,
        -0.021162359043955803,
        0.009436782449483871,
        0.024805257096886635,
        -0.00686638243496418,
        -0.01970040611922741,
        0.0008403229876421392,
        0.0018364278366789222,
        0.020934678614139557,
        -0.015254633501172066,
        0.011012575589120388,
        0.017052115872502327,
        -0.04800476133823395,
        -0.008699814788997173,
        -0.0004624772409442812,
        -0.007543434388935566,
        -0.022971823811531067,
        -0.05852602422237396,
        0.030365468934178352,
        0.009718388319015503,
        0.010958651080727577,
        -0.00975433737039566,
        0.016884351149201393,
        -0.031228259205818176,
        0.008999395184218884,
        -0.012953856028616428,
        -0.02408626303076744,
        0.06010780856013298,
        -0.030461333692073822,
        -0.01606949232518673,
        0.00932893343269825,
        -0.001575792906805873,
        0.0014709397219121456,
        0.015002986416220665,
        -0.005943675059825182,
        -0.001998201245442033,
        0.011012575589120388,
        0.0029433772433549166,
        0.014595557004213333,
        -0.04409823194146156,
        0.0027381647378206253,
        0.011629710905253887,
        0.04016773775219917,
        0.024901121854782104,
        -0.01944875903427601,
        -0.009191126562654972,
        0.008831629529595375,
        0.012294779531657696,
        -0.01647692173719406,
        0.025140786543488503,
        0.011384055018424988,
        0.0161653570830822,
        -0.016297172755002975,
        -0.017327729612588882,
        -0.01271419133991003,
        -0.01895744726061821,
        -0.00536248879507184,
        -0.015901727601885796,
        -0.004742357414215803,
        0.003088673809543252,
        0.01990412175655365,
        0.008274410851299763,
        -0.02487715519964695,
        0.00763930007815361,
        0.0507609024643898,
        -0.010209700092673302,
        -0.005056917201727629,
        0.04095863178372383,
        -0.023223472759127617,
        0.009562605991959572,
        -0.014799271710216999,
        -0.0035320527385920286,
        0.0432833731174469,
        -0.030581166967749596,
        0.011461946181952953,
        -0.0007766621420159936,
        -0.056752510368824005,
        -0.0042839995585381985,
        -0.04234868288040161,
        0.014343908987939358,
        0.030269602313637733,
        -0.018681833520531654,
        -0.0069262986071407795,
        0.012929889373481274,
        0.05886155366897583,
        0.014595557004213333,
        0.000862791552208364,
        0.02602754347026348,
        0.010359490290284157,
        0.00686638243496418,
        -0.048340290784835815,
        -0.006950265262275934,
        0.02298380807042122,
        -0.0021584767382591963,
        -0.011306163854897022,
        -0.0016566795529797673,
        -0.020659063011407852,
        -0.0194008257240057,
        0.01197123248130083,
        0.00402935640886426,
        -0.010221682488918304,
        -0.037195902317762375,
        0.008747747167944908,
        -0.00014557734539266676,
        -0.014439774677157402,
        0.01269022561609745,
        -0.030629098415374756,
        -0.07669258117675781,
        -0.012929889373481274,
        -0.0031186318956315517,
        -0.02307967282831669,
        -0.02820849046111107,
        0.0070461309514939785,
        -0.003936486318707466,
        0.002868482144549489,
        -0.011509878560900688,
        -0.06696221232414246,
        0.03889751806855202,
        -0.015698011964559555,
        -0.04153382405638695,
        0.04491309076547623,
        -0.0067944834008812904,
        0.049035318195819855,
        -0.003112640231847763,
        0.021605737507343292,
        -0.01786697469651699,
        0.03549428656697273,
        0.026794470846652985,
        0.015194717794656754,
        -0.014415808022022247,
        0.00535949319601059,
        -0.004074293188750744,
        -0.013325335457921028,
        0.0012020663125440478,
        0.0038675828836858273,
        0.023954447358846664,
        0.012917906045913696,
        0.012402628548443317,
        -0.01071898639202118,
        0.019664457067847252,
        0.0194008257240057,
        -0.03364887088537216,
        0.01805870607495308,
        -0.018633900210261345,
        0.022612327709794044,
        0.006147389765828848,
        -0.029838206246495247,
        0.01582982763648033,
        0.0075134760700166225,
        0.030629098415374756,
        -0.029430776834487915,
        0.03163569048047066,
        -0.002531454199925065,
        0.030365468934178352,
        -0.00015849675401113927,
        -0.012822040356695652,
        -0.06154579669237137,
        0.028735751286149025,
        0.007357694208621979,
        0.01900538057088852,
        -0.012929889373481274,
        0.021234259009361267,
        0.06140199676156044,
        0.013145587407052517,
        -0.030437367036938667,
        0.009340916760265827,
        -0.018022757023572922,
        0.011384055018424988,
        0.02597961202263832,
        -0.032666247338056564,
        -0.01657278649508953,
        -0.014499691314995289,
        0.006650684867054224,
        -0.03537445142865181,
        -0.007094063796103001,
        0.04989811033010483,
        -0.024014364928007126,
        -0.005847809370607138,
        -0.012630308978259563,
        0.0004489961138460785,
        0.062120988965034485,
        0.01936487667262554,
        0.029430776834487915,
        0.01246254425495863,
        0.027297765016555786,
        -0.006476928014308214,
        -0.006932290270924568,
        0.0025149774737656116,
        -0.01167165208607912,
        -0.023139588534832,
        0.0064709363505244255,
        -0.04119829460978508,
        0.011533845216035843,
        -0.01944875903427601,
        -0.029478710144758224,
        0.0022138990461826324,
        -0.005026958882808685,
        -0.0029358877800405025,
        -0.007849005982279778,
        -0.032067086547613144,
        0.010065901093184948,
        -0.00470041623339057,
        0.001481425017118454,
        -0.0044158147647976875,
        -0.0055482289753854275,
        -0.0003574368602130562,
        -0.02009585313498974,
        -0.03367283567786217,
        0.008705805987119675,
        -0.01781904138624668,
        -0.049131184816360474,
        0.02677050419151783,
        -0.04452962800860405,
        0.06044333800673485,
        0.03223485127091408,
        0.022180931642651558,
        -0.017447562888264656,
        0.015134801156818867,
        0.011132407002151012,
        0.022971823811531067,
        -0.020563198253512383,
        0.026458939537405968,
        0.007094063796103001,
        -0.00017899928207043558,
        0.07429593801498413,
        0.021929284557700157,
        0.002729177474975586,
        0.001118183834478259,
        -0.02174953557550907,
        -0.02667463757097721,
        -0.030724965035915375,
        0.029191114008426666,
        0.035398419946432114,
        -0.00012198538752272725,
        0.023067690432071686,
        -0.020335517823696136,
        -0.012294779531657696,
        0.007597358897328377,
        0.001094217412173748,
        -0.009730370715260506,
        -0.014044328592717648,
        0.013457151129841805,
        -0.055602122098207474,
        0.0066926260478794575,
        0.023594951257109642,
        0.007064105477184057,
        -0.027801061049103737,
        0.00975433737039566,
        0.01209106482565403,
        0.009484714828431606,
        0.0427800789475441,
        -0.021485906094312668,
        -0.0014716886216774583,
        -0.05080883577466011,
        -0.03472735732793808,
        0.009137202054262161,
        0.00385559955611825,
        0.03199518471956253,
        0.01611742563545704,
        -0.015266616828739643,
        0.001403534086421132,
        -0.006800475064665079,
        0.00029901869129389524,
        0.02830435521900654,
        -0.0026782487984746695,
        -0.014859187416732311,
        0.012426594272255898,
        0.0343199297785759,
        -0.013684832490980625,
        0.006012578494846821,
        -0.03952064365148544,
        0.025811847299337387,
        0.0016417005099356174,
        -0.0029194108210504055,
        -0.015733962878584862,
        -0.06231272220611572,
        0.0062372637912631035,
        -0.02727379836142063,
        0.023127606138586998,
        0.029838206246495247,
        0.013145587407052517,
        -0.02830435521900654,
        -0.010677045211195946,
        0.0015922697493806481,
        0.002375672571361065,
        -0.03161172196269035,
        -0.023163555189967155,
        -0.037435565143823624,
        -0.03393646702170372,
        -0.016249241307377815,
        0.042660247534513474,
        0.005692027509212494,
        0.012450560927391052,
        -0.01772317662835121,
        0.02039543353021145,
        0.00805871281772852,
        0.03606947883963585,
        -0.0368364043533802,
        0.018897531554102898,
        -0.008867579512298107,
        0.028088657185435295,
        0.004979026038199663,
        -0.03537445142865181,
        -0.025212686508893967,
        -0.005575191229581833,
        -0.0261234100908041,
        -0.006632709875702858,
        -0.01906529627740383,
        -0.0003293511981610209,
        0.02139003947377205,
        -0.003238464007154107,
        -0.008202510885894299,
        -0.0027007171884179115,
        0.0036339100915938616,
        -0.025907712057232857,
        -0.027010168880224228,
        0.025787880644202232,
        -0.004676450043916702,
        0.018238455057144165,
        0.029742341488599777,
        -0.03705210238695145,
        0.012210897170007229,
        -0.052965812385082245,
        0.016932284459471703,
        -0.01328938640654087,
        -0.009514673613011837,
        -0.0010994600597769022,
        -0.004361890722066164,
        -0.03841818869113922,
        0.014919103123247623,
        -0.012750141322612762,
        0.009532648138701916,
        0.0266267042607069,
        6.0150126955704764e-05,
        0.00685439957305789,
        -0.005949666723608971,
        0.01400837954133749,
        -0.007627316750586033,
        0.019388843327760696,
        -0.007195921149104834,
        -0.028448153287172318,
        -0.01445175800472498,
        -0.01527860015630722,
        0.02293587476015091,
        -0.03911321610212326,
        0.0036309142597019672,
        -0.022863974794745445,
        -0.016381055116653442,
        -0.009988009929656982,
        0.01052725501358509,
        0.014943069778382778,
        -0.02318752184510231,
        0.03750746324658394,
        -0.0035799855832010508,
        -0.014787288382649422,
        0.008244452066719532,
        0.0030766907148063183,
        0.015961643308401108,
        0.0024745340924710035,
        0.00247004022821784,
        -0.02230076491832733,
        -0.015338515862822533,
        -0.0016731565119698644,
        -0.006704609375447035,
        -0.017699209973216057,
        0.006177347619086504,
        0.06585974991321564,
        -0.023702800273895264,
        0.02756139636039734,
        -0.04613538086414337,
        0.006201314274221659,
        0.022204898297786713,
        0.01403234526515007,
        -0.03786696121096611,
        0.055410388857126236,
        0.028783684596419334,
        -0.004817252513021231,
        -0.010275606997311115,
        0.018849598243832588,
        -0.023163555189967155,
        -0.00505092553794384,
        -0.004601554945111275,
        -0.0018079676665365696,
        -0.00962851382791996,
        -0.015110834501683712,
        -0.0015413410728797317,
        0.01736367866396904,
        0.030077870935201645,
        -0.00469142897054553,
        0.003708805190399289,
        0.012019164860248566,
        0.00650688586756587,
        0.013085671700537205,
        0.015518263913691044,
        -0.021282190456986427,
        0.01475133839994669,
        0.012258829548954964,
        0.0008028754382394254,
        0.01149190403521061,
        0.042324718087911606,
        -0.016093458980321884,
        0.008550024591386318,
        -0.002801076741889119,
        -0.030077870935201645,
        0.011186331510543823,
        0.010221682488918304,
        0.0015308557776734233,
        0.003957456909120083,
        -0.015961643308401108,
        -0.017147982493042946,
        0.0049730343744158745,
        0.01771119236946106,
        -0.014140194281935692,
        -0.007082080468535423,
        -0.0043019745498895645,
        0.037435565143823624,
        0.03424803167581558,
        -0.03170758858323097,
        -0.0037657255306839943,
        -0.010269615799188614,
        -0.0008882558322511613,
        -0.02333131991326809,
        0.009269017726182938,
        0.00649490300565958,
        0.037315733730793,
        0.031180327758193016,
        -0.004868181422352791,
        -0.01348111778497696,
        0.004775311332195997,
        -0.013768714852631092,
        0.03328937292098999,
        0.02926301211118698,
        -0.0078370226547122,
        -0.0015563201159238815,
        -0.023463135585188866,
        0.013996396213769913,
        0.057950831949710846,
        -0.003205510089173913,
        0.021210292354226112,
        -0.003864587051793933,
        0.018717782571911812,
        0.0383223220705986,
        0.003544036066159606,
        0.04340320825576782,
        0.02542838267982006,
        0.023906515911221504,
        0.004631512798368931,
        0.026602739468216896,
        -0.016009576618671417,
        0.01576991192996502,
        -0.021677637472748756,
        0.0368124395608902,
        -0.02432592771947384,
        0.021581770852208138,
        0.012486510910093784,
        0.0032804051879793406,
        -0.03355300426483154,
        0.08781300485134125,
        -0.003466145135462284,
        0.05114436522126198,
        -8.570807403884828e-05,
        0.003753742203116417,
        0.014020361937582493,
        -0.0017944865394383669,
        0.04467342793941498,
        0.035350486636161804,
        -0.008454158902168274,
        -0.0007691726787015796,
        0.007555417250841856,
        -0.02279207669198513,
        0.015386449173092842,
        0.028927482664585114,
        0.006291188299655914,
        -0.020419400185346603,
        -0.032618314027786255,
        -0.026051510125398636,
        0.002679746598005295,
        0.021629704162478447,
        -0.010281599126756191,
        0.02991010621190071,
        0.008873571641743183,
        -0.02991010621190071,
        -0.010041934438049793,
        -0.007351703010499477,
        -0.007561408914625645,
        0.003505090484395623,
        -0.004319949075579643,
        0.011084474623203278,
        0.01539843250066042,
        0.023846598342061043,
        -0.002679746598005295,
        -0.023714784532785416,
        0.03357696905732155,
        -0.0014012872707098722,
        -0.02931094542145729,
        -0.011977223679423332,
        0.02432592771947384,
        0.04558415338397026,
        -0.014559607021510601,
        -0.007986812852323055,
        0.022432580590248108,
        0.015901727601885796,
        0.021126409992575645,
        -0.01186338346451521,
        -0.03369680419564247,
        -0.032810043543577194,
        -0.006303171627223492,
        -0.013672849163413048,
        -0.04517672210931778,
        0.008753739297389984,
        0.013373268768191338,
        0.02482922188937664,
        0.023115623742341995,
        -0.017890941351652145,
        0.03810662403702736,
        0.005125820636749268,
        -0.02916714735329151,
        -0.005293585360050201,
        0.035949647426605225,
        -0.007243853993713856,
        -0.009796278551220894,
        -0.02811262384057045,
        -0.0047693196684122086,
        -0.036452941596508026,
        -0.043906502425670624,
        0.02124624140560627,
        0.0034391828812658787,
        0.007759131956845522,
        0.029334912076592445,
        0.028879549354314804,
        0.02732173167169094,
        0.0022019159514456987,
        -0.01072497759014368,
        -0.002697721356526017,
        -0.004254041705280542,
        -0.021857384592294693,
        0.011701609939336777,
        -0.02378668263554573,
        0.006147389765828848,
        0.006428995169699192,
        0.0661952868103981,
        -0.019664457067847252,
        0.005287593696266413,
        -0.021521855145692825,
        -0.01572197861969471,
        0.0005276359734125435,
        -0.055362455546855927,
        -0.018777698278427124,
        0.001912820851430297,
        0.003582981415092945,
        -0.004170158877968788,
        0.029574576765298843,
        0.019832221791148186,
        0.009370874613523483,
        0.027705194428563118,
        -0.024469725787639618,
        0.01127021387219429,
        -0.03065306507050991,
        -0.009988009929656982,
        0.006012578494846821,
        0.03372076898813248,
        0.010191724635660648,
        0.02050328254699707,
        0.017351696267724037,
        -0.040479302406311035,
        -0.010629111900925636,
        0.013097655028104782,
        0.010113834403455257,
        0.010239657945930958,
        0.04150985926389694,
        -0.013265419751405716,
        0.012750141322612762,
        -0.013828630559146404,
        0.010203707963228226,
        -0.04323544353246689,
        -0.020659063011407852,
        -0.03791489452123642,
        0.02075492963194847,
        0.022732160985469818,
        -0.0011309159453958273,
        -0.0028804654721170664,
        0.005218690261244774,
        -0.021557804197072983,
        -0.009436782449483871,
        -0.02358296886086464,
        -0.015074885450303555,
        0.011132407002151012,
        0.027681227773427963,
        0.027705194428563118,
        0.03889751806855202,
        0.014092261902987957,
        -0.0024880152195692062,
        0.0005340020288713276,
        -0.00835829321295023,
        -0.009514673613011837,
        0.04584778472781181,
        0.02995803952217102,
        0.014140194281935692,
        0.005991607904434204,
        0.00020577428222168237,
        0.01101856678724289,
        -0.011923299171030521,
        -0.008669856935739517,
        -0.007429593708366156,
        -0.007974830456078053,
        0.008633906953036785,
        -0.02119830809533596,
        0.005533250048756599,
        -0.006393045652657747,
        0.00020352742285467684,
        -0.019940070807933807,
        -0.03379266709089279,
        0.010143792256712914,
        -0.0006714345654472709,
        -0.010137800127267838,
        -0.03089272975921631,
        -0.0062552387826144695,
        -0.021414006128907204,
        -0.009664463810622692,
        -0.031324125826358795,
        0.045056890696287155,
        0.0076153334230184555,
        -0.01040143147110939,
        -0.019868170842528343,
        0.006962248124182224,
        -0.0016656669322401285,
        -0.025739947333931923,
        -0.00145895651075989,
        -0.04110242798924446,
        -0.052869945764541626,
        0.0191491786390543,
        -0.021605737507343292,
        -0.03372076898813248,
        0.007477526552975178,
        -0.03319350630044937,
        -0.043163541704416275,
        -0.02080286294221878,
        0.004709403961896896,
        -0.008316352032124996,
        -0.0001788120425771922,
        0.014619522728025913,
        0.022432580590248108,
        -0.004295982886105776,
        0.01433192566037178,
        -0.002242359332740307,
        0.025596149265766144,
        -0.03158775717020035,
        0.004613537807017565,
        -0.007986812852323055,
        -0.022708194330334663,
        0.025787880644202232,
        -0.03949667885899544,
        0.030125804245471954,
        -0.026051510125398636,
        0.012294779531657696,
        0.00895745400339365,
        -0.004457756411284208,
        -0.013804664835333824,
        -0.02995803952217102,
        -0.020766912028193474,
        -0.016692619770765305,
        0.014595557004213333,
        0.003603952005505562,
        0.01985618844628334,
        -0.0007350954110734165,
        -0.01946074143052101,
        0.002577889245003462,
        -0.023163555189967155,
        -0.04596761614084244,
        0.010659070685505867,
        0.030820829793810844,
        -0.019676439464092255,
        0.008190527558326721,
        0.008394242264330387,
        0.0006800474948249757,
        -0.035997580736875534,
        0.004904130939394236,
        0.04467342793941498,
        0.02602754347026348,
        0.002531454199925065,
        0.022360680624842644,
        -0.029574576765298843,
        0.022073082625865936,
        0.03060513362288475,
        0.0026602738071233034,
        0.006231272127479315,
        0.0008725278894416988,
        -0.01246254425495863,
        -0.011258231475949287,
        -0.0008905027061700821,
        -0.05061710253357887,
        -0.0026617718394845724,
        0.010263624601066113,
        -0.001653683721087873,
        0.01331335213035345,
        0.010395439341664314,
        -0.04766923189163208,
        0.033409204334020615,
        -0.0023082669358700514,
        -0.0015787886222824454,
        -0.001968243159353733,
        0.014511673711240292,
        0.033313337713479996,
        0.032162949442863464,
        0.0003233595925848931,
        -0.030173737555742264,
        -0.007441577035933733,
        -0.0019742348231375217,
        0.0018618921749293804,
        0.01681245118379593,
        -0.012222879566252232,
        0.004191129468381405,
        0.029071280732750893,
        0.017938874661922455,
        -0.013576983474195004,
        -0.022420596331357956,
        -0.01597362570464611,
        0.014607539400458336,
        -0.02369081787765026,
        0.0114439707249403,
        -0.003873574547469616,
        0.0012911914382129908,
        0.004445773083716631,
        0.009766320697963238,
        0.006039540749043226,
        -0.00334032136015594,
        0.026458939537405968,
        0.03225881606340408,
        -0.006440978497266769,
        -0.00698022311553359,
        0.028328321874141693,
        -0.009670455008745193,
        0.024996988475322723,
        0.014583573676645756,
        -0.016560804098844528,
        0.0002286172821186483,
        -0.04841219261288643,
        0.0256201159209013,
        -0.007777106948196888,
        0.01756739430129528,
        -0.0077351657673716545,
        -0.030820829793810844,
        -0.05080883577466011,
        0.01475133839994669,
        0.026746537536382675,
        0.011012575589120388,
        -0.007597358897328377,
        -0.022456545382738113,
        0.010233665816485882,
        0.027753127738833427,
        -0.002416115952655673,
        0.01860993355512619,
        -0.012306762859225273,
        -0.009634505026042461,
        0.027729161083698273,
        0.022372663021087646,
        -0.03161172196269035,
        0.025835812091827393,
        -0.0013780697481706738,
        -0.020659063011407852,
        0.0021614725701510906,
        0.03070099838078022,
        -0.029215078800916672,
        -0.0003600581840146333,
        -0.0118154501542449,
        0.022408613935112953,
        0.014895137399435043,
        -0.020071886479854584,
        0.012750141322612762,
        -0.005491308402270079,
        0.004709403961896896,
        -0.006758533418178558,
        0.016692619770765305,
        0.016692619770765305,
        0.01197123248130083,
        -0.0036339100915938616,
        0.0017375663155689836,
        0.00548531673848629,
        0.015290583483874798,
        -0.0034691409673541784,
        0.005458354949951172,
        -0.006048528011888266,
        0.02364288456737995,
        -0.03523065522313118,
        -0.0423007495701313,
        -0.027992792427539825,
        0.007303769700229168,
        -0.0007976327906362712,
        -0.014212093316018581,
        0.013097655028104782,
        -0.041126396507024765,
        -0.030269602313637733,
        0.0025763914454728365,
        -0.011102449148893356,
        -0.02069501392543316,
        -0.0015293578617274761,
        -0.03796282783150673,
        0.00404133927077055,
        -0.02885558269917965,
        -0.016644686460494995,
        0.012798074632883072,
        -0.013720781542360783,
        0.0018274403410032392,
        -0.01482323743402958,
        0.02736966498196125,
        0.007843014784157276,
        -0.007878963835537434,
        0.024565592408180237,
        -0.03278607875108719,
        -0.011210298165678978,
        -0.03290591016411781,
        0.011941274628043175,
        0.005635106936097145,
        0.008831629529595375,
        0.011875366792082787,
        0.04584778472781181,
        -0.021881351247429848,
        -0.024301961064338684,
        0.00439184857532382,
        -0.023858582600951195,
        0.013888547196984291,
        -0.02284000813961029,
        0.009215093217790127,
        0.008190527558326721,
        0.017998790368437767,
        0.00825643539428711,
        0.017507478594779968,
        -0.01954462379217148,
        -0.025500282645225525,
        -0.016644686460494995,
        -0.001238764962181449,
        -0.0026647676713764668,
        -0.006884357426315546,
        0.014056311920285225,
        0.016992200165987015,
        0.028328321874141693,
        -0.01512281782925129,
        0.0077351657673716545,
        0.026339108124375343,
        -0.011084474623203278,
        -0.00873576384037733,
        -0.04258834943175316,
        -0.008328334428369999,
        -0.027753127738833427,
        -0.012330728583037853,
        -0.0014200110454112291
      ],
      "url": "https://www.sciencedaily.com/releases/2025/07/250722035653.htm",
      "source": "Latest Science News -- ScienceDaily",
      "published": "2025-07-23",
      "sentiment_score": 0.75,
      "reasoning": "While the earthquake itself is a natural disaster, the story focuses on the groundbreaking scientific and technological achievement of capturing real-time footage of fault slip, which advances earthquake science and could improve future prediction and safety measures.",
      "category": "Technology",
      "personality_title": "Stunning footage captures Earth's powerful split in seconds",
      "personality_presentation": "**Context**\nIn March 2025, central Myanmar experienced a major earthquake measuring 7.7 on the Richter scale—the strongest in over a hundred years. This quake happened along the Sagaing Fault, where two large sections of the Earth’s crust slide past each other horizontally.\n\n**What happened**\nA CCTV camera near the fault line recorded the earthquake’s fault slipping by 2.5 meters in just seconds. Researchers at Kyoto University studied this rare video and discovered the fault moved in a quick, pulse-like way with a slight curve, revealing new details about how earthquakes unfold.\n\n**Impact**\nThis real-time footage is a breakthrough for earthquake science. By seeing exactly how the fault shifted during the quake, scientists can better understand the mechanics of earthquakes, which may lead to improved prediction methods and safety plans that save lives.\n\n**What's next step**\nScientists plan to gather more real-time data from fault lines worldwide using similar cameras. They will use this information to refine models that predict earthquake behavior and help communities prepare better for future quakes.\n\n**One-sentence takeaway**\nA rare video of a fault slipping during a powerful earthquake offers new hope for improving how we understand and predict these natural events.",
      "personality_title_fr": "Des images impressionnantes capturent la puissante fissure de la Terre en quelques secondes",
      "personality_presentation_fr": "**Contexte**\nEn mars 2025, le centre du Myanmar a subi un important séisme de magnitude 7,7, le plus fort depuis plus d’un siècle. Ce tremblement de terre s’est produit le long de la faille de Sagaing, où deux grandes plaques terrestres glissent horizontalement l’une contre l’autre.\n\n**Ce qui s’est passé**\nUne caméra de vidéosurveillance près de la faille a filmé un glissement de 2,5 mètres en seulement quelques secondes. Les chercheurs de l’université de Kyoto ont étudié cette vidéo rare et découvert que la faille bougeait par impulsions rapides avec une légère courbure, révélant de nouveaux détails sur le déroulement des séismes.\n\n**Impact**\nCette vidéo en temps réel est une avancée majeure pour la science des séismes. En voyant comment la faille s’est déplacée exactement, les scientifiques peuvent mieux comprendre les mécanismes des tremblements de terre, ce qui pourrait améliorer la prédiction et les plans de sécurité pour sauver des vies.\n\n**Prochaine étape**\nLes chercheurs prévoient de collecter davantage de données en temps réel sur des failles du monde entier grâce à des caméras similaires. Ils utiliseront ces informations pour affiner les modèles de prévision et aider les communautés à mieux se préparer.\n\n**Conclusion en une phrase**\nUne vidéo rare d’un glissement de faille pendant un puissant séisme offre un nouvel espoir pour mieux comprendre et prévoir ces événements naturels.",
      "personality_title_es": "Impresionantes imágenes capturan la poderosa fisura de la Tierra en segundos",
      "personality_presentation_es": "**Contexto**\nEn marzo de 2025, el centro de Myanmar sufrió un gran terremoto de magnitud 7.7, el más fuerte en más de un siglo. Este sismo ocurrió a lo largo de la falla de Sagaing, donde dos grandes placas terrestres se deslizan horizontalmente una junto a la otra.\n\n**Qué pasó**\nUna cámara de CCTV cerca de la falla grabó un deslizamiento de 2,5 metros en solo segundos. Investigadores de la Universidad de Kioto estudiaron este video raro y descubrieron que la falla se movió de forma rápida y pulsante con una ligera curva, revelando nuevos detalles sobre cómo se desarrollan los terremotos.\n\n**Impacto**\nEste video en tiempo real es un avance para la ciencia de los terremotos. Al ver exactamente cómo se movió la falla durante el sismo, los científicos pueden entender mejor los mecanismos del mismo, lo que podría mejorar las predicciones y los planes de seguridad para salvar vidas.\n\n**Próximo paso**\nLos científicos planean recopilar más datos en tiempo real de fallas en todo el mundo utilizando cámaras similares. Usarán esta información para perfeccionar modelos que predigan el comportamiento sísmico y ayuden a las comunidades a prepararse mejor.\n\n**Resumen en una frase**\nUn video raro de un deslizamiento de falla durante un terremoto poderoso ofrece nueva esperanza para mejorar la comprensión y predicción de estos eventos naturales.",
      "image_url": "public/images/news_image_Watch-the-Earth-split-in-real-time-Stunning-footag.png",
      "image_prompt": "A detailed, warm painting of a cracked earth landscape showing two large, gently curved fault lines slipping sideways past each other by a clear 2.5-meter gap, with soft earth tones and subtle motion lines suggesting a quick pulse-like ripple traveling along the fault, set against a calm sky over a distant silhouette of Mandalay’s hills."
    },
    {
      "title": "Giant laser heats solid gold to 14 times its melting point",
      "summary": "Nature, Published online: 23 July 2025; doi:10.1038/d41586-025-02344-wA 50 nm thick sheet of solid gold was heated well beyond a theoretical limit, suggests new study — plus, what researchers think about the threat of nuclear war.",
      "content": "A 50 nm thick sheet of solid gold was heated well beyond a theoretical limit, suggests new study — plus, what researchers think about the threat of nuclear war.\n\nYou have full access to this article via your institution.\n\nDownload the Nature Podcast 23 July 2025\n\nIn this episode:\n\n00:46 How hot can solid gold get?\n\nA new study suggests that gold can be superheated far beyond its melting point without it becoming a liquid. Using an intense burst from a laser, a team heated a gold foil to 14 times its melting point, far beyond a theoretical limit put forward in previous studies. The team suggest that the speed at which they heated the gold allowed them to shoot past this limit, but there is scepticism about whether the team actually achieved the level of heating they report.\n\nResearch Article: White et al.\n\nNews and Views: Solid gold superheated to 14 times its melting temperature\n\n10:05 Research Highlights\n\nHow island life led to huge wingspans for flying foxes, and how a sugary diet ‘rewires’ a mouse’s brain.\n\nResearch Highlight: How the world’s biggest bats got their enormous wingspans\n\nResearch Highlight: How sugar overload in early life affects the brain later\n\n12:30 Researchers warn about the threat of nuclear war\n\nWith increasing political polarisation and more nuclear-armed nations, researchers are warning about the threat of nuclear war. Reporter Alex Witze has been speaking to scientists, and she told us about their chief concerns and how to avoid a conflict in an era of AI and misinformation.\n\nNews Feature: How to avoid nuclear war in an era of AI and misinformation\n\n23:22 Briefing Chat\n\nWhat a new AI model from China means for science, and why some dolphins use sponges to hunt.\n\nNature: ‘Another DeepSeek moment’: Chinese AI model Kimi K2 stirs excitement\n\nAssociated Press: Some Australian dolphins use sponges to hunt fish, but it’s harder than it looks\n\nSubscribe to Nature Briefing, an unmissable daily round-up of science news, opinion and analysis free in your inbox every weekday.\n\nNever miss an episode. Subscribe to the Nature Podcast on Apple Podcasts, Spotify, YouTube Music or your favourite podcast app. An RSS feed for the Nature Podcast is available too.",
      "embedding": [
        0.01656106300652027,
        0.0049593946896493435,
        0.004306003917008638,
        0.008127542212605476,
        0.005934699904173613,
        0.012372988276183605,
        -0.015362649224698544,
        4.803318006452173e-05,
        -0.020934000611305237,
        -0.042403463274240494,
        0.0032637661788612604,
        -0.011639916338026524,
        -0.019072633236646652,
        -0.018384182825684547,
        0.02095949836075306,
        0.0347285121679306,
        -0.01884314976632595,
        -0.016586560755968094,
        0.0004625527944881469,
        -0.020245550200343132,
        -0.0015745122218504548,
        0.013463035225868225,
        -0.0005342664080671966,
        0.021737191826105118,
        0.010173770599067211,
        -0.027920499444007874,
        -0.003243048908188939,
        0.03319862112402916,
        0.052424244582653046,
        -0.021278224885463715,
        0.02906791679561138,
        -0.026339612901210785,
        -0.011710035614669323,
        -0.025727655738592148,
        -0.06823311001062393,
        0.02585514821112156,
        0.05813583359122276,
        -0.0303428266197443,
        -0.0057657742872834206,
        0.010868595913052559,
        0.027716513723134995,
        -0.028022492304444313,
        0.0063107977621257305,
        0.06767214834690094,
        -0.015770619735121727,
        9.785919974092394e-05,
        -0.013475784100592136,
        -0.02380254492163658,
        0.011219196021556854,
        0.010683734901249409,
        0.013577776961028576,
        0.028557954356074333,
        0.005615972448140383,
        -0.02441450022161007,
        -0.0009338706149719656,
        0.01478894054889679,
        0.004124329425394535,
        0.021035993471741676,
        -0.06491834670305252,
        -0.007107615936547518,
        -0.04349988326430321,
        -0.03513648360967636,
        -0.01803995668888092,
        0.034422535449266434,
        0.007050245068967342,
        -0.020194552838802338,
        -0.055178046226501465,
        0.002589658135548234,
        0.043576378375291824,
        0.03959866240620613,
        0.019455106928944588,
        -0.022106915712356567,
        -0.030266331508755684,
        -0.026467103511095047,
        -0.028685444965958595,
        -0.015439143404364586,
        -0.03735482320189476,
        0.005287683568894863,
        0.02947588823735714,
        -0.0030151589307934046,
        0.017619237303733826,
        -0.006272550672292709,
        0.012647094205021858,
        -0.01027576345950365,
        -0.009906040504574776,
        -0.00016175404016394168,
        0.022451141849160194,
        0.017249513417482376,
        -0.028965923935174942,
        -0.02451649308204651,
        -0.004968956578522921,
        -0.025663910433650017,
        0.01803995668888092,
        0.012589722871780396,
        -0.047834571450948715,
        -0.022272653877735138,
        -0.01239211205393076,
        0.038374751806259155,
        0.007152237463742495,
        0.018065456300973892,
        -0.03202570602297783,
        0.029399393126368523,
        0.019085383042693138,
        -0.00252750632353127,
        0.039547666907310486,
        -0.0018518047872930765,
        -0.019034385681152344,
        -0.02189018204808235,
        -0.0024621672928333282,
        -0.004822342190891504,
        0.04298992082476616,
        0.0077323210425674915,
        -0.020730014890432358,
        0.004819154739379883,
        -0.04500427469611168,
        0.009580938145518303,
        -0.05798284709453583,
        0.02330533042550087,
        0.005972946994006634,
        0.024452747777104378,
        -0.024988209828734398,
        -0.006317172199487686,
        0.02776751108467579,
        -0.012086134403944016,
        0.02682407759130001,
        -0.03926718607544899,
        0.019404109567403793,
        -0.020067062228918076,
        -0.02809898741543293,
        0.01173553429543972,
        -0.03429504111409187,
        0.05178678780794144,
        0.03268865868449211,
        -0.012666217051446438,
        0.022412894293665886,
        -0.004717161878943443,
        0.01240486092865467,
        -0.005319556221365929,
        0.03924168646335602,
        -0.03483050316572189,
        0.015668626874685287,
        -0.018702909350395203,
        0.05023140087723732,
        -0.0038693477399647236,
        -0.0047012255527079105,
        0.012213625013828278,
        0.03365758806467056,
        0.07807540893554688,
        0.033045630902051926,
        0.03554445505142212,
        0.011875773780047894,
        0.017963463440537453,
        0.06196055933833122,
        0.03513648360967636,
        0.025957141071558,
        -0.0048892744816839695,
        0.020462283864617348,
        0.0482170470058918,
        -0.0038342878688126802,
        -0.003515560645610094,
        -0.0060526286251842976,
        0.02702806331217289,
        -0.07246580719947815,
        -0.0014701290056109428,
        0.07644352316856384,
        0.04877800494432449,
        0.011588919907808304,
        -0.05915576219558716,
        -0.06257251650094986,
        -0.009466196410357952,
        0.0026310926768928766,
        0.022323651239275932,
        -0.022145163267850876,
        0.02947588823735714,
        0.004149827640503645,
        0.0045673600398004055,
        0.0036558005958795547,
        0.034524526447057724,
        -0.007655826397240162,
        0.009976159781217575,
        0.01659931056201458,
        0.016204088926315308,
        -0.016752298921346664,
        -0.037303827702999115,
        -0.04324490204453468,
        -0.0034996243193745613,
        0.011550672352313995,
        -0.029220907017588615,
        -0.0016255085356533527,
        0.015337151475250721,
        -0.04413733631372452,
        0.016688553616404533,
        0.026339612901210785,
        -0.0231395922601223,
        -0.004984892904758453,
        -0.06445938348770142,
        0.026314115151762962,
        -0.019238371402025223,
        0.0143172238022089,
        -0.0022852737456560135,
        0.001258175470866263,
        0.04107755795121193,
        -0.012653468176722527,
        -0.01871565915644169,
        -0.00226774369366467,
        -0.02320333756506443,
        0.006062190514057875,
        0.03998113423585892,
        -0.01156979613006115,
        0.014508460648357868,
        0.043576378375291824,
        -0.010231141932308674,
        0.001170525560155511,
        0.02293560653924942,
        0.021010493859648705,
        -0.03862973302602768,
        -0.004149827640503645,
        -0.004114767536520958,
        0.028073487803339958,
        0.07144588232040405,
        -0.03457552194595337,
        0.03511098399758339,
        0.021010493859648705,
        0.04972143843770027,
        -0.013488533906638622,
        0.015349900349974632,
        0.0749136358499527,
        0.012321991845965385,
        0.014164235442876816,
        -0.0127235883846879,
        0.004219947848469019,
        -0.02860894985496998,
        -0.04385685920715332,
        -0.04811505228281021,
        -0.050384391099214554,
        0.0399046391248703,
        0.006910005118697882,
        0.03791578486561775,
        -0.029730869457125664,
        -0.008076546713709831,
        -0.03819626197218895,
        0.009670182131230831,
        -0.008898862637579441,
        0.024529242888092995,
        -0.008962607942521572,
        0.01857541874051094,
        -0.008229535073041916,
        -0.025498172268271446,
        0.03340260684490204,
        0.010345883667469025,
        0.025102950632572174,
        -0.04309191182255745,
        0.02515394799411297,
        -0.034754008054733276,
        -0.004299629479646683,
        -0.0822061076760292,
        -0.02779300883412361,
        0.04140903428196907,
        0.03508548438549042,
        -0.015273405238986015,
        -0.029756367206573486,
        -0.027181051671504974,
        -0.0700179859995842,
        -0.008745873346924782,
        0.02182643674314022,
        0.02297385409474373,
        0.005462983623147011,
        0.03248467296361923,
        0.018384182825684547,
        -0.06966100633144379,
        0.02507745288312435,
        -0.019072633236646652,
        0.03615640848875046,
        -0.043474383652210236,
        -0.046330180019140244,
        -0.01991407386958599,
        -0.005692467093467712,
        0.04120504856109619,
        0.0015434363158419728,
        0.006986499298363924,
        -0.00532274367287755,
        0.024937212467193604,
        0.016816044226288795,
        -0.025574667379260063,
        -0.023993780836462975,
        -0.008025550283491611,
        -0.006795262917876244,
        0.031439248472452164,
        0.008012800477445126,
        -0.06461237370967865,
        0.02947588823735714,
        0.04265844449400902,
        0.03947117179632187,
        0.021443963050842285,
        -0.02628861553966999,
        -0.010549869388341904,
        -0.01948060467839241,
        0.022820865735411644,
        -0.054668083786964417,
        -0.037201832979917526,
        -0.02289735898375511,
        0.04191899672150612,
        0.06746816635131836,
        -0.004506802186369896,
        -0.03286714479327202,
        0.06389842182397842,
        0.01760648936033249,
        -0.02058977447450161,
        0.006224741693586111,
        0.006521157920360565,
        0.0076622008346021175,
        -0.0005952229839749634,
        -0.03556995093822479,
        -0.035697441548109055,
        -0.01234111562371254,
        0.020564276725053787,
        0.00080478610470891,
        0.05609598010778427,
        -0.028353968635201454,
        0.024032028391957283,
        0.08256308734416962,
        0.021469460800290108,
        0.03855323791503906,
        0.044749293476343155,
        0.016943536698818207,
        0.02873644046485424,
        0.064102403819561,
        0.0029036044143140316,
        0.003604804165661335,
        -0.023496566340327263,
        -0.02092125080525875,
        -0.017886968329548836,
        0.07501562684774399,
        -0.03319862112402916,
        -0.014100490137934685,
        -0.025102950632572174,
        -0.0057370890863239765,
        0.04885450005531311,
        0.006967375986278057,
        -0.002463761018589139,
        -0.025791402906179428,
        -0.025243191048502922,
        -0.004841465502977371,
        0.03829825669527054,
        -0.011174574494361877,
        0.06491834670305252,
        0.02957788109779358,
        -0.05706490948796272,
        -0.009421574883162975,
        0.022349148988723755,
        0.0008940296829678118,
        -0.011397683061659336,
        -0.04291342571377754,
        0.038782719522714615,
        0.02404477633535862,
        -0.05619797483086586,
        0.026212122291326523,
        -0.05415812134742737,
        0.040057629346847534,
        -0.00039542088052257895,
        -0.0296033788472414,
        0.032076701521873474,
        0.0342695452272892,
        0.02404477633535862,
        -0.023445570841431618,
        0.0007008013781160116,
        -0.06206255406141281,
        0.027104558423161507,
        -0.015145914629101753,
        -0.035289470106363297,
        -0.030368324369192123,
        0.057931847870349884,
        0.027410535141825676,
        -0.009536316618323326,
        -0.03651338443160057,
        -0.0085673863068223,
        0.05303620174527168,
        0.008815993554890156,
        0.01927661895751953,
        -0.0656832903623581,
        0.03562094643712044,
        0.05334217846393585,
        0.009510818868875504,
        0.012079759500920773,
        -0.00900085549801588,
        0.0121690034866333,
        -0.002342644613236189,
        0.033147625625133514,
        -0.07715747505426407,
        -0.06063465401530266,
        0.038374751806259155,
        0.010199269279837608,
        -0.01135306153446436,
        -0.015541136264801025,
        0.0007577738142572343,
        0.013832759112119675,
        -0.03801777586340904,
        0.03638589382171631,
        0.012532352469861507,
        0.028379466384649277,
        -0.038043275475502014,
        -0.015158663503825665,
        -0.004589671269059181,
        -0.019429607316851616,
        0.03717633709311485,
        -0.009625560604035854,
        0.048370033502578735,
        -0.017721230164170265,
        -0.01240486092865467,
        -0.009179342538118362,
        -0.010320385918021202,
        0.01069648377597332,
        0.022004922851920128,
        -0.0020286983344703913,
        0.03508548438549042,
        -0.00622155424207449,
        0.004749034531414509,
        0.04796206206083298,
        -0.040618591010570526,
        0.011614417657256126,
        -0.008911611512303352,
        0.028583452105522156,
        -0.001819932134822011,
        -0.0009115596767514944,
        0.022451141849160194,
        0.03085278905928135,
        0.023369075730443,
        -0.04056759178638458,
        0.018996138125658035,
        -0.07374071329832077,
        -0.030572310090065002,
        0.06655023247003555,
        0.057523880153894424,
        0.003601616946980357,
        -0.006256614346057177,
        0.01800171099603176,
        -0.031133269891142845,
        0.004745847545564175,
        0.024656733497977257,
        0.0028302972204983234,
        0.01453395839780569,
        -0.006103625055402517,
        -0.05558601766824722,
        0.02947588823735714,
        -0.007955430075526237,
        -0.012717213481664658,
        0.031107770279049873,
        -0.007011997513473034,
        -0.001238255063071847,
        -0.06940602511167526,
        0.09133445471525192,
        -0.029220907017588615,
        0.02373879961669445,
        -0.016012853011488914,
        -0.020309295505285263,
        0.016548315063118935,
        0.010416003875434399,
        -0.018524423241615295,
        0.003977715037763119,
        0.03523847460746765,
        0.03972615301609039,
        -0.013310045935213566,
        -0.03947117179632187,
        0.016318831592798233,
        0.004729911219328642,
        0.031235262751579285,
        0.025702157989144325,
        0.022591380402445793,
        0.02672208473086357,
        0.0005549836787395179,
        -0.043168406933546066,
        -0.02025829814374447,
        0.013641522265970707,
        -0.001635070308111608,
        0.026671089231967926,
        -0.01190127246081829,
        -0.027844004333019257,
        0.010460625402629375,
        0.009408826008439064,
        0.009109222330152988,
        -0.0012972195399925113,
        -0.02531968615949154,
        0.058492809534072876,
        -0.002227902878075838,
        0.046891141682863235,
        -0.06471436470746994,
        -0.03766079992055893,
        0.008988105691969395,
        0.03419305011630058,
        -0.0477580763399601,
        0.030164338648319244,
        -0.025141198188066483,
        0.06721318513154984,
        -0.013335544615983963,
        0.06405141204595566,
        -0.02980736456811428,
        -0.07598455250263214,
        -0.017083775252103806,
        0.02598263882100582,
        0.031031277030706406,
        0.01619133912026882,
        -0.01797621138393879,
        -0.005472545512020588,
        -0.04021061956882477,
        -0.0020972248166799545,
        0.016586560755968094,
        0.01991407386958599,
        0.02089575305581093,
        -0.00450998917222023,
        0.05278121680021286,
        -0.024299759417772293,
        0.02528143860399723,
        0.02373879961669445,
        0.013488533906638622,
        -0.01141680683940649,
        0.008063796907663345,
        0.054107122123241425,
        0.04862501472234726,
        -0.012621595524251461,
        0.006505221594125032,
        -0.02203042060136795,
        0.0031761161517351866,
        0.023751547560095787,
        -0.004758596420288086,
        -0.011384934186935425,
        0.00975942611694336,
        -0.023279832676053047,
        0.0032892643939703703,
        0.007056619506329298,
        0.007388095837086439,
        -0.017224015668034554,
        -0.059563733637332916,
        0.016739550977945328,
        -0.000402393052354455,
        -0.002398421987891197,
        -0.058798786252737045,
        -0.000978492433205247,
        -0.019977819174528122,
        -0.007101241033524275,
        -0.015872612595558167,
        0.02243839204311371,
        -0.007738695479929447,
        -0.007592081092298031,
        -0.0376862995326519,
        0.01800171099603176,
        -0.02250213734805584,
        0.030470317229628563,
        -0.00950444396585226,
        -0.013960249722003937,
        0.015910860151052475,
        0.019353114068508148,
        -0.0056032235734164715,
        -0.02616112492978573,
        -0.01569412462413311,
        -0.015477390959858894,
        0.015719624236226082,
        0.0143172238022089,
        0.016510067507624626,
        0.0003035876143258065,
        0.03562094643712044,
        -0.02464398369193077,
        -0.012793708592653275,
        0.0019394548144191504,
        -0.002390453824773431,
        -0.011850276030600071,
        -0.02478422410786152,
        0.024937212467193604,
        -0.05543302744626999,
        -0.0074454667046666145,
        0.024134021252393723,
        0.0059888833202421665,
        -0.02820098027586937,
        0.01837143301963806,
        -0.03243367746472359,
        0.023075846955180168,
        -0.000854188809171319,
        0.008573760278522968,
        0.02766551822423935,
        -0.007011997513473034,
        0.013858256861567497,
        -0.003719545900821686,
        -0.015808867290616035,
        -0.05558601766824722,
        0.0015251095173880458,
        -0.030903786420822144,
        0.04459630325436592,
        0.038706228137016296,
        -0.04324490204453468,
        -0.012372988276183605,
        -0.001909175654873252,
        -0.020041564479470253,
        0.011614417657256126,
        0.03424404561519623,
        0.005819958169013262,
        0.035289470106363297,
        -0.009638309478759766,
        0.014189733192324638,
        -0.026773082092404366,
        -0.010976963676512241,
        0.008280531503260136,
        -0.003356196917593479,
        -0.03044481948018074,
        -0.0006908411160111427,
        5.692267950507812e-05,
        0.0017880593659356236,
        -0.0029275089036673307,
        -0.01653556525707245,
        0.004809592850506306,
        0.008459018543362617,
        -0.03416755050420761,
        -0.020373040810227394,
        0.020602524280548096,
        -0.016420822590589523,
        -0.019238371402025223,
        -0.016408074647188187,
        -0.0044494313187897205,
        0.024465497583150864,
        0.010371382348239422,
        -0.011219196021556854,
        -0.0073753464967012405,
        -0.0025800964795053005,
        0.044647302478551865,
        -0.01999056711792946,
        0.004025524016469717,
        -0.002992848167195916,
        -0.0039936513639986515,
        0.019557097926735878,
        0.02776751108467579,
        -0.03771179914474487,
        0.017695732414722443,
        0.009988909587264061,
        -0.0486760139465332,
        -0.010320385918021202,
        0.023152340203523636,
        -0.01463595125824213,
        0.013705267570912838,
        -0.006572153884917498,
        -0.03852773830294609,
        -0.02069176733493805,
        -0.02538343146443367,
        0.030470317229628563,
        0.008357026614248753,
        0.013832759112119675,
        0.020194552838802338,
        0.0100909024477005,
        0.03222969174385071,
        -0.012532352469861507,
        -0.06828410923480988,
        -0.015043921768665314,
        -0.04179150611162186,
        0.022310901433229446,
        -0.01622958667576313,
        -0.05833981931209564,
        -0.030572310090065002,
        0.0018741156673058867,
        -0.011474178172647953,
        -0.006352232303470373,
        -0.04013412445783615,
        -0.04140903428196907,
        -0.011435930617153645,
        -0.01098333764821291,
        -0.005236687138676643,
        -0.022323651239275932,
        0.014011246152222157,
        -0.003977715037763119,
        0.002266150200739503,
        0.003579305950552225,
        0.0364878848195076,
        0.009561815299093723,
        0.02246388979256153,
        0.06471436470746994,
        0.019467854872345924,
        -0.018651913851499557,
        0.025357933714985847,
        0.01500567514449358,
        0.00048765254905447364,
        -0.012800082564353943,
        0.004943458363413811,
        -0.03200020641088486,
        0.04650866612792015,
        -0.006591277662664652,
        -0.02398103103041649,
        -0.0011840714141726494,
        -0.017593739554286003,
        0.01857541874051094,
        -0.019123630598187447,
        -0.0013450286351144314,
        0.009096473455429077,
        0.023050349205732346,
        -0.016548315063118935,
        -0.030036848038434982,
        -0.003735482459887862,
        -0.006788888480514288,
        -0.007974553853273392,
        0.02454199083149433,
        0.010071778669953346,
        0.009421574883162975,
        0.018753906711935997,
        0.00032171522616408765,
        -0.01569412462413311,
        -0.0075984555296599865,
        0.024197766557335854,
        -0.039318181574344635,
        -0.001455786288715899,
        -0.032714154571294785,
        -0.021469460800290108,
        -0.023330828174948692,
        -0.029016921296715736,
        0.023190587759017944,
        0.025498172268271446,
        -0.0023346764501184225,
        0.025727655738592148,
        -0.019353114068508148,
        0.012538726441562176,
        -0.0019362674793228507,
        -0.014100490137934685,
        -0.009931538254022598,
        0.03340260684490204,
        -0.007700448390096426,
        -0.014623202383518219,
        0.016012853011488914,
        -0.01818019710481167,
        -0.013577776961028576,
        -0.012576973997056484,
        0.04620268940925598,
        0.022247156128287315,
        -0.028047990053892136,
        0.035595450550317764,
        -0.02820098027586937,
        -0.008866989985108376,
        0.023662304505705833,
        -0.00145419267937541,
        0.028481459245085716,
        -0.023050349205732346,
        0.02662009187042713,
        0.022808115929365158,
        0.026671089231967926,
        -0.03998113423585892,
        0.014049493707716465,
        -0.0004418355238158256,
        0.0286344476044178,
        0.00371317146345973,
        0.01162079256027937,
        -0.0037099842447787523,
        0.04589671269059181,
        0.004392060451209545,
        -0.013118810020387173,
        -0.010390505194664001,
        0.0019043948268517852,
        0.02850695699453354,
        -0.052424244582653046,
        0.010014407336711884,
        0.024503745138645172,
        -0.03108227252960205,
        0.004133891314268112,
        -0.02628861553966999,
        -0.019327614456415176,
        0.03238267824053764,
        -0.032306186854839325,
        0.0019282993162050843,
        -0.01027576345950365,
        -0.026416108012199402,
        0.006476535927504301,
        0.03467751666903496,
        0.036538880318403244,
        0.005026327446103096,
        0.01131481397897005,
        0.018116451799869537,
        -0.006878132000565529,
        -0.016637558117508888,
        -0.008809618651866913,
        -0.012551475316286087,
        -0.011244694702327251,
        -0.009077349677681923,
        -0.00031394624966196716,
        -0.024350754916667938,
        -0.01756824180483818,
        0.04732460901141167,
        0.019340364262461662,
        -0.020296545699238777,
        -0.006511596031486988,
        -0.02192842960357666,
        -0.007317975629121065,
        0.040899068117141724,
        -0.028761940076947212,
        -0.0023745172657072544,
        0.03957316279411316,
        -0.025408929213881493,
        -0.019442357122898102,
        -0.02441450022161007,
        -0.03717633709311485,
        0.0033020135015249252,
        -0.01565587893128395,
        0.007987302727997303,
        -0.010741105303168297,
        0.004905210807919502,
        -0.009351454675197601,
        -0.08608183264732361,
        -0.037099841982126236,
        0.01999056711792946,
        0.00458648381754756,
        -0.07088492065668106,
        -0.00324464263394475,
        -0.019837578758597374,
        -0.019365862011909485,
        -0.034320540726184845,
        -0.021239977329969406,
        0.04681464657187462,
        -0.0224001444876194,
        -0.0018900521099567413,
        0.017377004027366638,
        -0.0066040270030498505,
        0.009141094982624054,
        0.00502951443195343,
        -0.01964634284377098,
        -0.019327614456415176,
        0.04000663384795189,
        -0.0023968282621353865,
        0.016076598316431046,
        -0.02223440632224083,
        0.03128625825047493,
        -0.008548262529075146,
        -0.018358685076236725,
        -0.004921147599816322,
        -0.032612163573503494,
        0.006148247048258781,
        -0.03332611173391342,
        0.011671788990497589,
        0.006922753993421793,
        0.012538726441562176,
        0.024860719218850136,
        -0.03526397421956062,
        -0.044545307755470276,
        -0.013169806450605392,
        0.007789691910147667,
        0.04712062329053879,
        -0.0010438314639031887,
        0.02957788109779358,
        0.0010510027641430497,
        0.054311107844114304,
        0.010728356428444386,
        0.021303724497556686,
        -0.016051100566983223,
        0.008165789768099785,
        0.0015952294925227761,
        0.002750615356490016,
        0.012500478886067867,
        -0.018129201605916023,
        0.013832759112119675,
        -0.010052654892206192,
        -0.011531548574566841,
        -0.020717265084385872,
        0.017950713634490967,
        -0.024439997971057892,
        0.02820098027586937,
        -0.007043870165944099,
        0.01948060467839241,
        0.013922002166509628,
        0.014138736762106419,
        -0.021176232025027275,
        -0.0008446269785054028,
        0.0061769322492182255,
        -0.00923671294003725,
        0.031107770279049873,
        0.035059988498687744,
        -0.008866989985108376,
        -0.023687802255153656,
        0.043882355093955994,
        0.026314115151762962,
        0.007802440784871578,
        0.030674302950501442,
        0.006744266953319311,
        -0.004369749221950769,
        -0.010632738471031189,
        0.008535513654351234,
        -0.004800030961632729,
        0.008656629361212254,
        -0.04342338815331459,
        -0.03001135028898716,
        0.003416755236685276,
        0.00728610297665,
        0.012914824299514294,
        -0.0036111788358539343,
        0.02507745288312435,
        0.018435178324580193,
        0.0145722059533,
        -0.011448679491877556,
        0.009587313048541546,
        -0.021278224885463715,
        0.01837143301963806,
        -0.005262185353785753,
        -0.0033753206953406334,
        -0.01500567514449358,
        -0.0338105782866478,
        -0.020373040810227394,
        0.022425644099712372,
        0.011850276030600071,
        0.016637558117508888,
        0.0182439424097538,
        -0.017988961189985275,
        -0.012959446758031845,
        -0.001958578359335661,
        0.028047990053892136,
        0.0021370656322687864,
        0.005268559791147709,
        -0.0013912441208958626,
        -0.008975356817245483,
        0.006527532357722521,
        0.04566722735762596,
        -0.002798424568027258,
        0.008771371096372604,
        0.01136581040918827,
        -0.0006159402546472847,
        0.009542691521346569,
        0.048599518835544586,
        -8.376548066735268e-05,
        0.023649554699659348,
        0.03386157378554344,
        -0.03885921463370323,
        -0.00428369315341115,
        -0.003700422355905175,
        -0.005051825661212206,
        -0.00723510654643178,
        0.0350089929997921,
        0.04574372246861458,
        -0.03924168646335602,
        0.00425819493830204,
        -0.009536316618323326,
        0.008140292018651962,
        0.004102018661797047,
        0.012296494096517563,
        0.027155553922057152,
        -0.05232224985957146,
        0.011346686631441116,
        0.023649554699659348,
        -0.0033338861539959908,
        0.022387396544218063,
        0.006071752402931452,
        -0.03024083375930786,
        0.0372273325920105,
        -0.0291444119066,
        -0.002776113571599126,
        -0.008994480594992638,
        0.0027394599746912718,
        -0.01900888793170452,
        0.03919069096446037,
        0.012258246541023254,
        0.0254471767693758,
        -0.04291342571377754,
        0.003968153148889542,
        0.018562670797109604,
        -0.0039044078439474106,
        0.015949107706546783,
        -0.0293738953769207,
        0.026097379624843597,
        -0.026569096371531487,
        0.06206255406141281,
        0.034550026059150696,
        0.028787437826395035,
        -0.007553833536803722,
        0.02116348408162594,
        0.028022492304444313,
        -0.012213625013828278,
        -9.823270374909043e-06,
        -0.0315922349691391,
        -0.02209416776895523,
        -0.017262263223528862,
        0.013195304200053215,
        -0.028557954356074333,
        0.010218393057584763,
        -0.006180119700729847,
        0.0011928364401683211,
        0.03460102155804634,
        -0.004223134834319353,
        -0.010237516835331917,
        -0.003706796793267131,
        0.05094534903764725,
        -0.04403534531593323,
        -0.010938716121017933,
        0.0019872637931257486,
        0.0025832836981862783,
        0.06119561567902565,
        -0.028022492304444313,
        -0.03266315907239914,
        0.019327614456415176,
        0.024057526141405106,
        -0.004608794581145048,
        0.019875826314091682,
        0.00361755327321589,
        0.0014788940316066146,
        -0.032510168850421906,
        0.005338679999113083,
        -0.01151879969984293,
        0.009797672741115093,
        0.01425347849726677,
        -0.01608934812247753,
        0.009950662031769753,
        -0.009026353247463703,
        -0.0038916587363928556,
        -0.0038438495248556137,
        -0.006167370826005936,
        -0.01495467871427536,
        0.009249461814761162,
        0.017695732414722443,
        -0.030266331508755684,
        -0.011563421227037907,
        0.002218340989202261,
        -0.010976963676512241,
        0.009466196410357952,
        -0.03444803133606911,
        0.004035085905343294,
        0.00307252979837358,
        -0.010001658461987972,
        -0.01820569485425949,
        0.07154787331819534,
        -0.013781762681901455,
        -0.01958259753882885,
        0.014661449939012527,
        -0.04727361351251602,
        0.03434604033827782,
        0.015324401669204235,
        -0.03977714851498604,
        0.030164338648319244,
        0.007317975629121065,
        0.04298992082476616,
        0.01069648377597332,
        0.0005274934810586274,
        0.024159519001841545,
        0.03319862112402916,
        -0.012219998985528946,
        0.01021201815456152,
        0.006441475823521614,
        -0.01173553429543972,
        0.009032728150486946,
        0.012800082564353943,
        0.002589658135548234,
        0.0448002889752388,
        -0.0030406571459025145,
        -0.027436034753918648,
        0.017287760972976685,
        -0.03317312151193619,
        -0.057727862149477005,
        0.017580989748239517,
        -0.007509212009608746,
        -0.0001621524424990639,
        -0.021112486720085144,
        -0.008764997124671936,
        -0.036538880318403244,
        -0.01453395839780569,
        -0.014495711773633957,
        0.02799699455499649,
        -0.0051920656114816666,
        0.04959394782781601,
        0.014189733192324638,
        -0.004835091065615416,
        -0.030189836397767067,
        0.030597807839512825,
        -0.004908398259431124,
        0.034856002777814865,
        -0.03771179914474487,
        0.007439091801643372,
        0.01877940446138382,
        -0.011773781850934029,
        0.013310045935213566,
        -0.012181752361357212,
        0.03671737015247345,
        -0.033275116235017776,
        -0.0189833901822567,
        0.028455961495637894,
        -0.032306186854839325,
        0.025306936353445053,
        -0.005150631070137024,
        -0.032739654183387756,
        -0.009969785809516907,
        -0.028863931074738503,
        0.0448002889752388,
        0.01606384851038456,
        0.0076622008346021175,
        0.010224767029285431,
        0.019773833453655243,
        -0.012143504805862904,
        0.0024701354559510946,
        -0.011480552144348621,
        -0.005144256632775068,
        -0.03903770446777344,
        0.0014111645286902785,
        0.0073116011917591095,
        0.013526780530810356,
        0.009568189270794392,
        -0.008911611512303352,
        -0.009332330897450447,
        -0.009670182131230831,
        -0.013412038795650005,
        0.012634344398975372,
        0.041868001222610474,
        0.02756352536380291,
        0.01612759381532669,
        0.0014127581380307674,
        0.00866937916725874,
        0.022412894293665886,
        -0.010409628972411156,
        -0.003901220392435789,
        -0.007789691910147667,
        -0.0030183461494743824,
        -0.007343473844230175,
        -0.002897229976952076,
        -0.00034940463956445456,
        0.0004338673606980592,
        -0.0171347726136446,
        -0.009109222330152988,
        -0.032331682741642,
        -0.04140903428196907,
        -0.005360990762710571,
        0.04237796366214752,
        0.012857453897595406,
        0.0061578089371323586,
        -0.014329973608255386,
        0.005125132855027914,
        -0.013144307769834995,
        0.005364178214222193,
        0.025370681658387184,
        -0.011678162962198257,
        0.027614520862698555,
        0.006699644960463047,
        -0.024325257167220116,
        0.017275013029575348,
        -0.025128450244665146,
        0.012379363179206848,
        -0.003480500541627407,
        0.00016016040171962231,
        0.004420745652168989,
        0.01890689507126808,
        0.029756367206573486,
        -0.04352538287639618,
        0.022553134709596634,
        -0.02007981203496456,
        0.0036621750332415104,
        -0.043372392654418945,
        -0.001629492617212236,
        -0.017147520557045937,
        0.03490699827671051,
        -0.016510067507624626,
        -0.00814666599035263,
        -0.040185119956731796,
        -0.031541239470243454,
        -0.01709652505815029,
        -0.023789795115590096,
        0.080727219581604,
        -0.006055816076695919,
        -0.001486862194724381,
        -0.01130206510424614,
        0.0031267134472727776,
        0.014049493707716465,
        0.012143504805862904,
        -0.028659947216510773,
        -0.0011514018988236785,
        0.013297297060489655,
        0.0035474332980811596,
        -0.007751444820314646,
        -0.03182172030210495,
        0.007553833536803722,
        0.012067010626196861,
        0.03363208845257759,
        -0.020105309784412384,
        -0.006916379556059837,
        -0.013169806450605392,
        0.008828742429614067,
        0.0038852840662002563,
        0.00949169509112835,
        -0.000748212041798979,
        -0.00747733935713768,
        0.021418465301394463,
        -0.0020239173900336027,
        0.030801793560385704,
        0.01229011919349432,
        -0.03256116807460785,
        0.009045477025210857,
        -0.010715607553720474,
        0.019340364262461662,
        -0.004165763966739178,
        0.030827291309833527,
        0.0074454667046666145,
        0.008548262529075146,
        0.017555491998791695,
        0.014291726052761078,
        -0.02427426166832447,
        0.017020029947161674,
        -0.02102324366569519,
        -0.011875773780047894,
        0.02649260126054287,
        0.01003990601748228,
        -0.008369775488972664,
        0.011965017765760422,
        -0.03467751666903496,
        0.004755409434437752,
        0.007273353636264801,
        -0.01234111562371254,
        -0.007993677631020546,
        -0.045055270195007324,
        2.6519095627008937e-05,
        0.007853437215089798,
        0.026314115151762962,
        0.0034836879931390285,
        -0.010173770599067211,
        0.02223440632224083,
        0.017657484859228134,
        0.00662952521815896,
        0.016102096065878868,
        0.006030317861586809,
        -0.04255644977092743,
        0.027614520862698555,
        -0.045284755527973175,
        -0.00319364620372653,
        -0.01436822023242712,
        -0.004385685548186302,
        -0.007713197264820337,
        -0.015745121985673904,
        0.01793796382844448,
        -0.011595293879508972,
        0.019123630598187447,
        0.019200123846530914,
        0.02515394799411297,
        0.017644735053181648,
        0.011212822049856186,
        0.020972248166799545,
        -0.03743131831288338,
        0.013565028086304665,
        -0.013463035225868225,
        -0.007764193695038557,
        0.013233551755547523,
        0.03880821913480759,
        0.008510014973580837,
        -0.037405818700790405,
        -0.0376862995326519,
        0.020870255306363106,
        -0.024988209828734398,
        -0.019557097926735878,
        -0.007694073487073183,
        -0.01800171099603176,
        0.006718768738210201,
        0.04691663756966591,
        0.018728408962488174,
        0.0049243345856666565,
        -0.03658987954258919,
        0.010709232650697231,
        0.011850276030600071,
        0.020513279363512993,
        0.007394470274448395,
        -0.0034454406704753637,
        0.033147625625133514,
        -0.0025195381604135036,
        0.018894147127866745,
        0.007802440784871578,
        -0.018231194466352463,
        -0.04500427469611168,
        0.005026327446103096,
        0.0009306833380833268,
        -0.0038948459550738335,
        0.018855899572372437,
        0.06430639326572418,
        -0.03041931986808777,
        -0.04704412817955017,
        0.00404146034270525,
        -0.020271047949790955,
        -0.018894147127866745,
        -0.027614520862698555,
        -0.02651810087263584,
        0.013412038795650005,
        0.03556995093822479,
        0.006527532357722521,
        -0.02108698897063732,
        -0.025090202689170837,
        -0.020105309784412384,
        0.0026231245137751102,
        -0.03393806889653206,
        -0.017122022807598114,
        -0.01951885223388672,
        0.04077157750725746,
        0.00965743325650692,
        0.034957993775606155,
        -0.002887668088078499,
        0.004006400238722563,
        -0.025396181270480156,
        -0.00742634292691946,
        -0.024503745138645172,
        0.08042123913764954,
        -0.00032948420266620815,
        -0.010932342149317265,
        0.01659931056201458,
        -0.02276986837387085,
        -0.025357933714985847,
        0.02873644046485424,
        -0.013322795741260052,
        0.006795262917876244,
        -0.03202570602297783,
        0.001505188993178308,
        0.002874918980523944,
        0.00450042774900794,
        0.023343577980995178,
        -0.0025816899724304676,
        -0.03406555950641632,
        -0.03171972557902336,
        0.003505998756736517,
        -0.05150631070137024,
        -0.04811505228281021,
        -0.017313258722424507,
        0.010460625402629375,
        0.019365862011909485,
        0.015311652794480324,
        0.0011346687097102404,
        -0.004793656524270773,
        0.027589023113250732,
        -0.02166069857776165,
        -0.020028814673423767,
        -0.024287009611725807,
        0.023751547560095787,
        0.016306081786751747,
        0.03778829425573349,
        0.022004922851920128,
        0.012430359609425068,
        0.006377730518579483,
        0.01974833570420742,
        -0.03939467668533325,
        0.001108373748138547,
        0.0096064368262887,
        -0.010167396627366543,
        0.019174626097083092,
        -0.020449534058570862,
        -0.011206447146832943,
        -0.012143504805862904,
        -0.010192894376814365,
        -0.039522167295217514,
        0.05477007478475571,
        -0.012016014195978642,
        -0.018294939771294594,
        0.018894147127866745,
        -0.023114094510674477,
        -0.003541058860719204,
        -0.00617055781185627,
        -0.024567490443587303,
        0.020436786115169525,
        0.015502889640629292,
        0.010486124083399773,
        -0.012028763070702553,
        0.0112000722438097,
        -0.0012525977799668908,
        0.010173770599067211,
        -0.04513176530599594,
        -0.018384182825684547,
        0.004659791011363268,
        -0.015082169324159622,
        0.010894094593822956,
        0.00922396406531334,
        0.021788189187645912,
        0.028379466384649277,
        -0.02608463168144226,
        -0.013118810020387173,
        -0.024529242888092995,
        0.010792101733386517,
        0.007419968489557505,
        0.00539923831820488,
        0.05640196055173874,
        -0.012576973997056484,
        -0.006871757563203573,
        0.004481303971260786,
        -0.020666269585490227,
        -0.016790546476840973,
        0.01207338459789753,
        -0.0005601629964075983,
        0.021252727136015892,
        0.0068016378208994865,
        -0.029246404767036438,
        0.0014948303578421474,
        -0.001931486651301384,
        -0.026212122291326523,
        -0.008382524363696575,
        -0.0012709245784208179,
        0.0011729159159585834,
        -0.014138736762106419,
        0.00750283757224679,
        -0.032204192131757736,
        -0.013386541046202183,
        -0.004051022231578827,
        -0.01807820424437523,
        0.028277473524212837,
        0.004012775141745806,
        -0.026135627180337906,
        -0.03194921091198921,
        -0.006243865005671978,
        0.006109999492764473,
        0.03330061584711075,
        -0.03266315907239914,
        0.00987416785210371,
        0.011531548574566841,
        0.013794511556625366,
        0.008592884056270123,
        0.045080769807100296,
        -0.008439895696938038,
        0.04477479308843613,
        -0.026951568201184273,
        0.014125987887382507,
        0.016471819952130318,
        0.0019330802606418729,
        -0.012137130834162235,
        -0.028557954356074333,
        0.01151879969984293,
        -0.010549869388341904,
        0.011882148683071136,
        -0.011659039184451103,
        -0.014890933409333229,
        0.018919644877314568,
        -0.005912388674914837,
        -0.0025291000492870808,
        -0.004576921928673983,
        0.00713311368599534,
        0.01026301458477974,
        -0.011066206730902195,
        -0.004000025801360607,
        -0.041230544447898865,
        -0.01937861181795597,
        0.007050245068967342,
        -0.013361042365431786,
        0.003230299800634384,
        -0.0075984555296599865,
        -0.03554445505142212,
        0.002600813750177622,
        -0.02779300883412361,
        -0.020105309784412384,
        -0.025192195549607277,
        0.007228732109069824,
        0.0007876544841565192,
        -0.011104454286396503,
        0.017045529559254646,
        -0.009083724580705166,
        -0.01874115690588951,
        -0.015617631375789642,
        0.032331682741642,
        -0.006001632660627365,
        0.0035761187318712473,
        0.021074239164590836,
        -0.0012414422817528248,
        0.017428001388907433,
        0.02062802202999592,
        -0.002651809947565198,
        0.04831903800368309,
        0.013934751972556114,
        0.00453548738732934,
        -0.026365110650658607,
        -0.004841465502977371,
        -0.04663615673780441,
        0.019085383042693138,
        0.00046175598981790245,
        0.03225518763065338,
        0.0063107977621257305,
        -0.0007278931443579495,
        0.00359205505810678,
        -0.02186468429863453,
        -0.013922002166509628,
        -0.02662009187042713,
        0.0034008189104497433,
        0.019136378541588783,
        0.01573237217962742,
        -0.010887719690799713,
        0.012570599094033241,
        0.0016207275912165642,
        -0.023458318784832954,
        -0.015133165754377842,
        0.013208054006099701,
        -0.024185016751289368,
        0.022540384903550148,
        -0.04352538287639618,
        0.01863916404545307,
        0.008554637432098389,
        -0.033683087676763535,
        -0.015145914629101753,
        -0.011225570924580097,
        -0.006224741693586111,
        -0.016012853011488914,
        0.010957839898765087,
        0.03704884648323059,
        -0.02799699455499649,
        -0.02843046374619007,
        -0.024490995332598686,
        -0.03541696071624756,
        0.009179342538118362,
        0.010052654892206192,
        -0.020105309784412384,
        0.002924321684986353,
        0.023050349205732346,
        0.009402451105415821,
        -0.04938996210694313,
        0.022859111428260803,
        0.02651810087263584,
        0.0085673863068223,
        -0.003920344170182943,
        -0.05046088621020317,
        0.009262211620807648,
        -0.015987355262041092,
        -0.020105309784412384,
        -0.004745847545564175,
        -0.03526397421956062,
        -0.04225047305226326,
        -0.015808867290616035,
        0.01890689507126808,
        -0.011359436437487602,
        0.025995386764407158,
        -0.020181804895401,
        0.010970588773488998,
        0.010792101733386517,
        0.025357933714985847,
        -0.0032637661788612604,
        -0.004098831210285425,
        0.013807260431349277,
        -0.0027283045928925276,
        -0.02048778161406517,
        0.007917182520031929,
        -0.001894832937978208,
        0.013552279211580753,
        -0.0023601746652275324,
        -0.041128553450107574,
        -0.03947117179632187,
        -0.010199269279837608,
        -0.029756367206573486,
        0.006368168629705906,
        -0.03913969546556473,
        -0.022119665518403053,
        0.006285299547016621,
        -0.007171361241489649,
        0.006278925109654665,
        0.025561917573213577,
        -0.011926770210266113,
        0.024465497583150864,
        -0.005341867450624704,
        -0.01877940446138382,
        0.0033848825842142105,
        0.0028669508174061775
      ],
      "url": "https://www.nature.com/articles/d41586-025-02344-w",
      "source": "Nature",
      "published": "2025-07-24",
      "sentiment_score": 0.75,
      "reasoning": "The article highlights a scientific breakthrough involving the heating of solid gold beyond theoretical limits, which represents progress in materials science and technology. Although it mentions concerns about nuclear war, the primary focus is on the advancement in understanding material properties under extreme conditions, which is positive and could have future technological applications.",
      "category": "Technology",
      "personality_title": "Scientists heat solid gold to record-breaking temperatures using giant laser",
      "personality_presentation": "**Context**\nScientists have long believed there’s a limit to how hot solid gold can get before it melts. Gold usually melts at around 1,064°C (1,947°F). Pushing beyond that temperature while keeping it solid seemed impossible—until now.\n\n**What happened**\nA new study used a powerful laser to heat an ultra-thin sheet of solid gold, just 50 nanometers thick, to a staggering 14 times its melting point. This means the gold reached temperatures far beyond what was thought possible without turning into liquid. The laser’s intense, quick burst supplied energy so fast that the gold’s atoms didn’t have time to rearrange into a liquid form.\n\n**Impact**\nThis breakthrough helps scientists better understand how materials behave under extreme conditions. Knowing that gold can stay solid at such high heat opens doors to new technologies, like improved electronics and advanced manufacturing processes that require materials to withstand intense heat.\n\n**What's next step**\nResearchers plan to explore how other materials respond to extreme heat using similar laser techniques. They also want to study potential uses for this superheated state in real-world applications, including electronics, energy, and materials science.\n\n**One-sentence takeaway**\nA giant laser has shown that solid gold can survive heat far beyond its melting point, unlocking new possibilities for science and technology.",
      "personality_title_fr": "Des scientifiques chauffent de l'or solide à des températures record grâce à un laser géant",
      "personality_presentation_fr": "**Contexte**\nLes scientifiques pensaient depuis longtemps qu’il y avait une limite à la température que l’or solide pouvait atteindre avant de fondre. L’or fond normalement à environ 1 064°C. Aller au-delà tout en restant solide semblait impossible, jusqu’à aujourd’hui.\n\n**Ce qui s’est passé**\nUne nouvelle étude a utilisé un laser puissant pour chauffer une feuille ultra-fine d’or solide, de seulement 50 nanomètres d’épaisseur, à une température 14 fois supérieure à son point de fusion. Cela signifie que l’or a atteint des températures bien plus élevées que prévu sans devenir liquide. L’impulsion brève et intense du laser a donné de l’énergie si rapidement que les atomes d’or n’ont pas eu le temps de se réarranger en liquide.\n\n**Impact**\nCette avancée aide les scientifiques à mieux comprendre le comportement des matériaux dans des conditions extrêmes. Savoir que l’or peut rester solide à de telles chaleurs ouvre la voie à de nouvelles technologies, comme des composants électroniques améliorés et des procédés de fabrication avancés nécessitant des matériaux résistants à la chaleur intense.\n\n**Prochaine étape**\nLes chercheurs prévoient d’étudier comment d’autres matériaux réagissent à la chaleur extrême en utilisant des techniques laser similaires. Ils souhaitent aussi explorer les applications possibles de cet état de surchauffe dans la vie quotidienne, notamment en électronique, énergie et science des matériaux.\n\n**Conclusion en une phrase**\nUn laser géant a démontré que l’or solide peut supporter une chaleur bien supérieure à son point de fusion, ouvrant de nouvelles perspectives pour la science et la technologie.",
      "personality_title_es": "Científicos calientan oro sólido a temperaturas récord usando un láser gigante",
      "personality_presentation_es": "**Contexto**\nDurante mucho tiempo, los científicos creyeron que había un límite a qué tan caliente podía ponerse el oro sólido antes de derretirse. El oro normalmente se derrite a unos 1,064°C. Superar esa temperatura sin que se vuelva líquido parecía imposible, hasta ahora.\n\n**Qué pasó**\nUn nuevo estudio utilizó un láser potente para calentar una lámina ultra delgada de oro sólido, de solo 50 nanómetros de grosor, a una temperatura 14 veces mayor que su punto de fusión. Esto significa que el oro alcanzó temperaturas mucho más altas de lo pensado sin fundirse. El pulso rápido y fuerte del láser entregó energía tan rápido que los átomos del oro no tuvieron tiempo de reorganizarse en líquido.\n\n**Impacto**\nEste avance ayuda a los científicos a entender mejor cómo se comportan los materiales en condiciones extremas. Saber que el oro puede permanecer sólido a temperaturas tan altas abre nuevas oportunidades para tecnologías, como la mejora de electrónicos y procesos avanzados de fabricación que requieren materiales resistentes al calor intenso.\n\n**Próximo paso**\nLos investigadores planean estudiar cómo otros materiales responden al calor extremo usando técnicas similares con láser. También quieren explorar posibles usos para este estado de sobrecalentamiento en aplicaciones reales, incluyendo electrónica, energía y ciencia de materiales.\n\n**Conclusión en una frase**\nUn láser gigante ha demostrado que el oro sólido puede soportar calor mucho más allá de su punto de fusión, abriendo nuevas posibilidades para la ciencia y la tecnología.",
      "image_url": "public/images/news_image_Giant-laser-heats-solid-gold-to-14-times-its-melti.png",
      "image_prompt": "A detailed, warm-toned painting of a thin, glowing gold foil sheet suspended mid-air, radiating intense heat with swirling, abstract waves of energy around it symbolizing superheating well beyond its melting point, set against a calm, softly colored background that evokes both the power of advanced laser technology and the delicate balance of scientific discovery."
    }
  ]
}