{
  "personality": null,
  "timestamp": "2025-12-18T04:50:50.515050",
  "category": "Technology",
  "news_summary": "Today's technology news highlights significant breakthroughs in quantum computing, including advancements in silicon-based processors, feasible Earth-to-space quantum communication, resolution of longstanding quantum puzzles, and innovative photonic computing architectures.",
  "news_summary_fr": "L'actualité technologique d'aujourd'hui met en lumière des avancées significatives dans le domaine de l'informatique quantique, notamment des progrès dans les processeurs à base de silicium, la faisabilité d'une communication quantique Terre-espace, la résolution d'énigmes quantiques de longue date et des architectures informatiques photoniques novatrices.",
  "news_summary_es": "Las noticias tecnológicas de hoy destacan avances significativos en computación cuántica, incluidos avances en procesadores basados en silicio, comunicación cuántica Tierra-espacio factible, resolución de antiguos enigmas cuánticos y arquitecturas innovadoras de computación fotónica.",
  "articles": [
    {
      "title": "An 11-qubit atom processor in silicon",
      "summary": "Nature, Published online: 17 December 2025; doi:10.1038/s41586-025-09827-wAn 11-qubit atom processor comprising two precision-placed nuclear spin registers of phosphorus in silicon is shown to achieve state-of-the-art Bell-state fidelities of up to 99.5%.",
      "content": "The predominant material in modern classical computers, silicon, is also a strong contender for the practical implementation of quantum processors3,6,7,8. To unlock the promised computational benefits of quantum computing, the qubit count needs to scale while maintaining high operation fidelity and connectivity. In terms of qubit numbers, the lead is at present held by superconducting9,10, ion-trap11 and neutral-atom12 processors, which approach hundreds of interconnected qubits. Further scale-up faces platform-specific challenges related to manufacturing, control-systems miniaturization and materials engineering. In this context, silicon quantum processors are emerging as a promising platform owing to their small footprint and materials compatibility with industrial manufacturing8,13,14.\n\nIn semiconductor devices, the number of individual qubits is increasing, with gate-defined arrays hosting up to 16 quantum dots14,15. So far, however, no more than four interconnected spin qubits were used in the execution of quantum circuits owing to challenges associated with multi-qubit control16,17,18,19. In this context, quantum computing with precision-placed phosphorus atoms in silicon, which we refer to as the 14|15 platform (according to the respective positions in the periodic table), is attracting growing interest driven by industry-leading physical-level metrics3 with exceptional, second-long coherence times2,20. The 14|15 platform uses precision manufacturing21 to place individual phosphorus atoms in close proximity (≲3 nm) to each other, in which a single loaded electron exhibits a hyperfine interaction with several nuclei. Such spin registers provide a unique set of advantages: the shared electron naturally acts as an ancilla qubit enabling quantum non-demolition (QND) readout of the nuclear spins and native multi-qubit (Toffoli) gates4,5. Combined with recent advances in silicon purification with sub-200 ppm of 29Si (ref. 22), these features enabled nuclear–nuclear CZ operations with fidelities exceeding 99% and the execution of three-qubit algorithms on a single multi-spin register5.\n\nTo enable the scaling of the 14|15 platform, it is essential to develop fast interconnects between quantum processing nodes without compromising performance23. The coupling of spin qubits is achievable by various mechanisms, such as dipolar interaction24 or spin–photon conversion in superconducting cavities25. The fastest coupling mechanism is provided by exchange interaction, as demonstrated with a 0.8-ns \\(\\sqrt{{\\rm{SWAP}}}\\) gate between atomic qubits in natural silicon26. Exchange gates on electron spins have also been implemented with gate-defined quantum dots in isotopically pure silicon with fidelities greater than 99% (refs. 27,28,29,30). Successful implementation of exchange gates in atom qubits have already been achieved in purified silicon-28 (ref. 31), yet the limited two-qubit gate fidelity challenges the applicability of quantum-error-correction protocols32,33.\n\nHere we report a precision-placed 11-qubit atom processor in isotopically purified silicon-28 that runs on a fast and efficient exchange-based link. Compared with the previous atom-based implementations with nuclear spin qubits4,5,22, we triple the number of coupled data qubits while maintaining the performance of single-qubit and two-qubit gates well above 99% fidelity. This achievement is enabled by systematic investigations of qubit stability, contextual errors and crosstalk, which informed the development of scalable calibration and control protocols. After outlining the basic set-up of the 11-qubit atom processor, we report the key metrics of single-qubit and two-qubit gates, assess pairwise entanglement for all combinations of nuclear spins and benchmark all-to-all connectivity through multi-qubit entanglement.\n\nThe connectivity of the nuclei and electrons both within each register and across registers is central to the operation of the 11-qubit atom processor (Fig. 1a). Each spin register contains nuclei (n 1 –n 4 and n 5 –n 9 ) that are hyperfine-coupled to a common electron (e 1 and e 2 ). Notably, these electrons are also exchange-coupled to each other, enabling non-local connectivity across the registers (Fig. 1b). The strength of electron exchange coupling J is tunable by the voltage detuning ε across in-plane control gates (Fig. 1c and Supplementary Information Section I). The Hamiltonian of the system is described in Supplementary Information Section II. Here we operate in a weak exchange-coupled regime with J ≈ 1.55 MHz (Fig. 1c). In this regime, the controlled rotations (CROT) on the electron are less susceptible to charge noise and not conditional on the nuclear spins in the other register26,34,35,36. We note that the CROT operation on the electron spin has the advantage of implementing a native multi-qubit Toffoli gate that is conditional on the nuclear spins.\n\nFig. 1: Single-qubit characteristics of the 11-qubit atom processor. a, Connectivity of nuclear spins (n 1 –n 9 ) and electron spins (e 1 and e 2 ) through hyperfine and exchange coupling with energies in MHz. b, Scanning tunnelling micrograph of the processor core after hydrogen lithography showing the 4P register hosting n 1 –n 4 and e 1 (square) and the 5P register hosting n 5 –n 9 and e 2 (pentagon). The distance 13(1) nm (centre to centre) between the nuclear spin registers is atomically engineered to enable exchange coupling26,54. Scale bar, 10 nm. c, Exchange-coupled ESR spectrum of e 2 as a function of voltage detuning ε with indications on the resonance frequencies corresponding to CROT and zCROT. d, Rabi oscillations along one period T Rabi for all spins of the processor. We measure the spin-up probability of the nucleus P ⇑ (electron P ↑ ) as a function of the coherent NMR (ESR) drive duration. e, Phase coherence times measured for each spin through Ramsey (open symbols) and Hahn-echo (filled symbols) measurements. f, 1Q-RB results for each qubit showing average physical gate fidelities. SET, single-electron transistor. Full size image\n\nThe initial calibration of the 11-qubit atom processor requires the characterization of 24 + 25 = 48 electron spin resonances (ESRs), which is doubled to 96 in the presence of electron exchange interaction. Analysing the stability of the ESR peaks (Supplementary Information Section III), we find that the frequencies within each register shift collectively. Accordingly, we can implement an efficient recalibration protocol that scales linearly with the number of coupled spin registers. By characterizing the ESR frequency for a single reference configuration of the nuclear spins, we infer the exact positions of all other ESR transitions of the register from the frequency offsets of the initial calibration. As a result, recalibrating all 96 ESR frequencies requires only two measurements, that is, one per register.\n\nThe state of the individual nuclear spins is controlled using nuclear magnetic resonance (NMR), similar to molecules in solution37 and nitrogen-vacancy centres in diamond38,39. The readout of an individual nuclear spin is performed through QND readout using the ancillary electron (Supplementary Information Section IV). For nuclear spin initialization, we combine this ESR-based approach with conditional NMR π pulses (Supplementary Information Section V). To maximize the fidelity of the initialized state, we perform QND readout of the nuclear spin configuration of each register before each experiment and apply post-selection on the desired nuclear spin configuration (Supplementary Information Section VI). For all experiments, unless stated otherwise, spectator qubits—that is, spins not actively involved in a given gate or quantum circuit—are initialized in the ⇓ state, and spin manipulations are performed conditional on these initialized states. The large contrast observed in Rabi oscillations (Fig. 1d) across all data qubits shows the performance of the nuclear-spin readout and initialization procedure.\n\nThe coherence times for both nuclear and electron spins are characterized by means of Ramsey and Hahn-echo measurements (Fig. 1e). For the nuclear spins, the phase coherence time extracted from Ramsey measurements, \\({T}_{2}^{\\star }\\), ranges from 1 to 46 ms. Refocusing with Hahn echo greatly extends such a phase coherence, \\({T}_{2}^{{\\rm{Hahn}}}\\), to values between 3 and 660 ms. We observe that the phase coherence of the data qubits is related to its hyperfine Stark coefficient (Supplementary Information Section VII). Accordingly, we note that deterministic atom placement will provide a way to improve coherence by tailoring the spin registers for smaller susceptibility to electric field fluctuations. For the electrons e 1 and e 2 , we measure similar phase coherence times of \\({T}_{2}^{\\star }\\approx 20\\,{\\rm{\\mu }}{\\rm{s}}\\) and \\({T}_{2}^{{\\rm{Hahn}}}\\approx 350\\,{\\rm{\\mu }}{\\rm{s}}\\). Overall, our investigations affirm the potential of refocusing techniques to substantially improve the performance of our 11-qubit atom processor.\n\nSingle-qubit randomized benchmarking (1Q-RB) reveals that all qubits except n 4 operate with gate fidelities greater than 99.90% and as high as 99.99% for n 5 (see Supplementary Information Section VIII for optimization details). We attribute this excellent performance to long coherence times and minimal frequency drifts in both ESR and NMR (Supplementary Information Sections III and VII). These single-qubit metrics are on par with our recent results using a single spin register5, indicating consistency in atomic-scale fabrication.\n\nTo perform multi-qubit operations with any data qubit across our atom processor, we now establish a quantum link between the nuclear spin registers through the exchange interaction of the electrons. We first assess the performance of this link with interleaved two-qubit randomized benchmarking (2Q-RB) of the electron CROT gate (see Methods). To minimize off-resonant population transfer between the zero-controlled rotation (zCROT) and CROT resonances, the Rabi frequency is optimized to f Rabi ≈ 400 kHz for the chosen exchange coupling J ≈ 1.55 MHz (ref. 40) (Supplementary Information Section VIII.C). This choice sets the duration of the CROT π rotation to approximately 1.25 μs. Also, we calibrate the phase offsets of the CROT gates and implement a compensation protocol30 (Supplementary Information Section VIII.C). Figure 2a shows the reference and interleaved 2Q-RB data for e 2 when all nuclear spins are initialized to down (⇓⇓⇓⇓, ⇓⇓⇓⇓⇓), which we denote for simplicity as (⇓4, ⇓5). The extracted electron–electron CROT gate fidelity of 99.64(8)% indicates excellent performance that is relevant for the application of quantum-error-correction protocols.\n\nFig. 2: High-fidelity two-qubit operation between nuclear (CZ) and electron (CROT) spins. a, Normalized 2Q-RB of the electron–electron CROT gate from the reference (black) and interleaved procedure (CROT e 2 ) showing the Clifford fidelity. b, Normalized 2Q-RB of the geometric CZ operation on the nuclear-spin pair n 6 and n 9 from the reference (black) and interleaved procedure (CZ). All other nuclear spins are initialized to down ⇓ in this experiment. c, Summary of the nuclear (CZ) and electron 2Q-RB (zCROT and CROT of e 1 and e 2 ) fidelities. For the electron CROT gate, the primitive fidelities (reference for interleaved 2Q-RB) are also shown for different nuclear spin configurations, with the corresponding frequency gap ΔE z = |f CROT e1 − f CROT e2 | indicated at the top. Full size image\n\nAccording to ref. 35, the fidelity of the two-qubit CROT gate depends on the Larmor-frequency splitting ΔE z = |f CROT e1 − f CROT e2 |, which is defined by the nuclear-spin configuration. In particular, when ΔE z is similar to the exchange interaction strength J, the fidelity is lower owing to hybridization with the singlet–triplet eigenbasis. By choosing small exchange of J = 1.55 MHz, we operate at a large ΔE z /J ratio and obtain CROT gate fidelities exceeding 99% across different nuclear-spin configurations, as shown in Fig. 2c.\n\nA key task of the ancilla electron in our 14|15 platform is to entangle nuclear data qubits by means of a geometric CZ gate that is implemented through a 2π-ESR rotation4,5,41 (for a detailed derivation, see Supplementary Information Section II). Figure 2b shows interleaved 2Q-RB results for the nuclear CZ gate applied on two nuclear spins n 6 and n 9 on the 5P register, giving a nuclear two-qubit-gate fidelity of 99.90(4)%. The nuclear CZ gate strongly outperforms the CROT gate and thus allows local multi-qubit operation on a spin register with high fidelity.\n\nBefore applying this electron-exchange-based link to entangle nuclear spins across the two registers, we first benchmark the generation of local Bell states within a single spin register. As an example, we entangle the nuclear spins n 6 and n 9 of the 5P register through the electron e 2 (see schematic in Fig. 3a). An exemplary quantum circuit to prepare the Bell state is shown in Fig. 3b, which uses this nuclear CZ gate to entangle the nuclear-spin pair. Accordingly, the four maximally entangled Bell states, \\(| {\\Phi }^{\\pm }\\rangle =(| \\Downarrow \\Downarrow \\rangle \\pm | \\Uparrow \\Uparrow \\rangle )/\\sqrt{2}\\) and \\(| {\\Psi }^{\\pm }\\rangle =(| \\Downarrow \\Uparrow \\rangle \\pm | \\Uparrow \\Downarrow \\rangle )/\\sqrt{2}\\) can be generated by adjusting the phase of the initial −Y/2 NMR pulses, by inverting their respective signs. We remind that the gate operations used are conditional on the spectator data qubits in the system, which are initialized to ⇓. We perform quantum state tomography (QST) using a complete set of nine projections (all combinations of X, Y and Z for the two data qubits) and reconstruct the corresponding density matrix (Methods and Fig. 3c). Here the experiments are performed with J ≈ 1.69 MHz, which sets the optimal Rabi frequency for CROT operations to 436 kHz. Without removal of state preparation and measurement (SPAM) errors, we obtain an average state fidelity of 99.2(3)% for all Bell states (see table in Fig. 3c). To characterize the local Φ+ state across all nuclear-spin pairs from the two registers, we reconstruct the density matrix from a reduced set of three projections (XX, YY and ZZ). This way, we can increase the measurement speed with similar accuracy42 (Supplementary Information Section IX). For nuclear spins with smaller hyperfine coupling than J, we reduce f Rabi for CROT gates to minimize off-resonance driving (Supplementary Information Section VIII.C). Figure 3d shows the local Φ+ state fidelities for all local combinations of data qubits on the respective registers ranging from 91.4(5)% to 99.5(1)%. To the best of our knowledge, the peak Bell-state fidelity surpassing 99% represents the highest value reported in semiconductor devices so far.\n\nFig. 3: Bell states within a register (left, local) and across registers (right, non-local). a (e), Connectivity of a local (non-local) Bell state. b (f), Circuit for generation and measurement of a Φ+ Bell state using local (non-local) CZ gate and QST. Open (filled) circles indicate whether the operation is conditional on the down (up) state. c (g), Reconstructed density matrix for a local (non-local) Φ+ Bell state. The table shows the fidelities for all local (non-local) Bell states. Here a complete set of nine projections is used to reconstruct the density matrix. d (h), Generation fidelities of local (non-local) Φ+ Bell state for all combinations of nuclear spins. As we use a reduced set of three projections, small deviations in the generation fidelities occur. Full size image\n\nThe variation in Bell-state fidelities observed arises from the interplay between several effects, including the Stark coefficient, the operational speed, the stability of the qubit frequencies, microwave-induced frequency shifts and the coherence time of the qubits involved (compare Supplementary Information Sections III, VII and VIII). For instance, Bell states involving n 5 exhibit lower fidelities (see the corresponding row in Fig. 3d). This reduction is primarily caused by its small hyperfine coupling, which sets the CROT gate speed approximately three times slower than for the other nuclear spins (n 6 –n 9 ) in the same register (Supplementary Information Section VIII.D).\n\nAs a next step, we now interconnect the spin registers and implement non-local Bell states over the electron-exchange-based link. To demonstrate the approach, we entangle nuclear spins n 4 and n 9 through both electrons e 1 and e 2 (see connectivity in Fig. 3e). To implement the non-local CZ gate in the regime in which J ≪ ΔE z , we project the targeted nuclear state on the electron e 1 through X gates (π rotation), sandwiching the 2X operation on e 2 (see circuit in Fig. 3f for the example of the Φ+ state). Again, we perform QST using a complete set of nine projections to maximize measurement accuracy. Figure 3g shows the density matrix of the non-local Bell state Φ+ with a table listing the extracted fidelities for Φ+, Φ−, Ψ+ and Ψ−, with an average of 97.2(9)%.\n\nWe characterize the non-local Φ+ state for all combinations of nuclear-spin pairs across the registers. Figure 3h shows the obtained state fidelities ranging from 87.0(4)% to 97.0(2)%. The observed reduction in fidelity compared with local Bell states is primarily attributed to the increased operation time of the non-local CZ gate. In particular, entanglement involving nuclear spins with smaller hyperfine coupling (n 1 , n 2 or n 5 ) exhibits slightly lower performance, underscoring the importance of engineering hyperfine couplings larger than the exchange strength J in future devices. These results demonstrate the ability to generate pairwise entanglement between arbitrary nuclear-spin pairs, highlighting the potential of the 14|15 platform to realize efficient all-to-all connectivity.\n\nA straightforward approach to benchmarking the all-to-all connectivity of a quantum processor is the generation of GHZ states with an increasing number of qubits. Accordingly, we investigate in the following non-local multi-qubit entanglement with an increasing number of nuclear spins. First, we generate a GHZ state with three nuclear spins: n 4 on the 4P register and n 6 and n 9 on the 5P register (Fig. 4a). We implement a combination of local and non-local Bell states and concatenate the corresponding entanglement circuits as shown in Fig. 4b. The density matrix shown in Fig. 4c is reconstructed from a full set of QST measurements. Without SPAM removal, we report a GHZ state fidelity of 90.8(3)%.\n\nFig. 4: Non-local multi-qubit GHZ states. a, Connectivity of the three-qubit GHZ state comprising n 4 , n 6 and n 9 . b, Circuit for the generation and measurement of the three-qubit GHZ state using the local and non-local CZ gate and QST through the ancilla qubits e 1 and e 2 . Open (filled) circles indicate whether the operation is conditional on the down (up) state. c, Reconstructed density matrix for the GHZ state with N = 3 entangled nuclear spins. d, Normalized QST counts in the z projection—that is, diagonal of density matrix—for GHZ states with increasing qubit count N. The bars on the left (right) show matrix elements in which all nuclear spins are down ⇓…⇓ (up ⇑…⇑). All other elements with mixed states (with ⇓ and ⇑) are combined via their sum in the bars in the middle. e, Generation fidelity as a function of the number of qubits N in the GHZ state. Full size image\n\nTo prepare a GHZ state with more than three qubits, we now extend the circuit shown in Fig. 4b by adding the local entanglement sequence—NMR −Y/2, local ESR 2X and NMR Y/2—for each extra qubit. For the 5P (4P) register, we add these local entanglement operations before (after) the non-local CZ. Because the number of tomography bases grows exponentially (3N, in which N is the number of qubits), we use a reduced measurement strategy that requires only N + 1 bases to estimate the state fidelity42,43. Figure 4d shows the counts in the z basis of GHZ states with an increasing number of entangled nuclear spins. In the ideal GHZ state, measurement outcomes are equally distributed between the states in which all nuclear spins are either down (⇓…⇓) or up (⇑…⇑). Increasing the number of qubits in the GHZ state (N), we observe a gradual increase in the probability of all other states, that is, mixed combinations of ⇓ and ⇑. The corresponding GHZ fidelities are plotted in Fig. 4e. The three-qubit GHZ fidelity is 92(2)%, consistent with the value of 90.8(3)% obtained from full QST. Because a fidelity greater 50% is sufficient to witness genuine N-qubit entanglement44, the data demonstrate that entanglement is maintained for up to eight nuclear spins. Further performance improvements are anticipated by coherent control optimization45, frequency crosstalk mitigation and the incorporation of refocusing pulses. Building on this progress, the present results demonstrate efficient connectivity across nuclear data qubits in our atom processor, representing an important step towards future implementations of quantum error correction on the 14|15 platform.",
      "url": "https://www.nature.com/articles/s41586-025-09827-w",
      "source": "Nature",
      "published": "2025-12-18",
      "sentiment_score": 0.95,
      "reasoning": "The article reports a significant breakthrough in quantum computing technology with the development of an 11-qubit atom processor in silicon achieving state-of-the-art gate fidelities above 99%. This advancement demonstrates scalable, high-fidelity multi-qubit operations and entanglement, which are critical for practical quantum computing and error correction. The impact is broad and meaningful for the future of computing and technology, with detailed experimental results and clear implications for scaling quantum processors.",
      "category": "Technology",
      "personality_title": "Scientists build an 11-qubit quantum processor using silicon atoms",
      "personality_presentation": "**Context** – Quantum computers use qubits to perform complex calculations faster than regular computers. Silicon, the material used in most computers today, is also being explored to build quantum processors. However, making many qubits work together without losing accuracy has been a big challenge.\n\n**What happened** – Researchers created a quantum processor with 11 qubits made from phosphorus atoms placed precisely inside pure silicon. This processor uses special interactions between electrons and atomic nuclei to connect and control the qubits. The team achieved very high accuracy, with gate operations working correctly more than 99% of the time. They also created entangled states, where qubits are strongly linked, both inside single groups of atoms and between two groups.\n\n**Impact** – This is the largest silicon-based quantum processor with such high accuracy reported so far. The high-quality connections and controls among multiple qubits show that scaling up quantum processors in silicon is possible. This work is important because it uses materials and techniques compatible with current computer manufacturing, making future quantum devices easier to produce.\n\n**What's next step** – The researchers plan to improve the processor by reducing errors, speeding up operations, and linking even more qubits. These improvements will help build larger and more reliable quantum computers that can correct mistakes and perform practical tasks.\n\n**One-sentence takeaway** – Scientists have built a precise 11-qubit quantum processor in silicon, achieving over 99% accuracy, marking an important step toward scalable quantum computing using existing materials.\n",
      "personality_title_fr": "Des scientifiques créent un processeur quantique à 11 qubits utilisant des atomes de silicium",
      "personality_presentation_fr": "**Contexte** – Les ordinateurs quantiques utilisent des qubits pour effectuer des calculs complexes plus rapidement que les ordinateurs classiques. Le silicium, matériau utilisé dans la plupart des ordinateurs actuels, est aussi exploré pour construire des processeurs quantiques. Cependant, faire fonctionner ensemble de nombreux qubits sans perdre en précision est un grand défi.\n\n**Ce qui s’est passé** – Des chercheurs ont créé un processeur quantique avec 11 qubits fabriqués à partir d’atomes de phosphore placés précisément dans du silicium pur. Ce processeur utilise des interactions spéciales entre électrons et noyaux atomiques pour connecter et contrôler les qubits. L’équipe a atteint une très haute précision, avec des opérations réussissant plus de 99% du temps. Ils ont aussi créé des états intriqués, où les qubits sont fortement liés, à l’intérieur d’un même groupe d’atomes et entre deux groupes.\n\n**Impact** – C’est le plus grand processeur quantique basé sur le silicium avec une telle précision jamais rapporté. La qualité des connexions et du contrôle entre plusieurs qubits montre que l’on peut augmenter la taille des processeurs quantiques en silicium. Ce travail est important car il utilise des matériaux et techniques compatibles avec la fabrication informatique actuelle, facilitant la production future d’appareils quantiques.\n\n**Prochaine étape** – Les chercheurs prévoient d’améliorer le processeur en réduisant les erreurs, en accélérant les opérations et en connectant encore plus de qubits. Ces améliorations aideront à construire des ordinateurs quantiques plus grands et fiables capables de corriger les erreurs et de réaliser des tâches pratiques.\n\n**Résumé en une phrase** – Des scientifiques ont construit un processeur quantique précis à 11 qubits en silicium, atteignant plus de 99% de précision, marquant une étape clé vers l’informatique quantique évolutive avec des matériaux existants.\n",
      "personality_title_es": "Científicos crean un procesador cuántico de 11 qubits usando átomos de silicio",
      "personality_presentation_es": "**Contexto** – Las computadoras cuánticas usan qubits para realizar cálculos complejos más rápido que las computadoras normales. El silicio, material usado en la mayoría de las computadoras actuales, también se estudia para construir procesadores cuánticos. Sin embargo, hacer que muchos qubits funcionen juntos sin perder precisión ha sido un gran desafío.\n\n**Qué pasó** – Investigadores crearon un procesador cuántico con 11 qubits hechos de átomos de fósforo colocados con precisión dentro de silicio puro. Este procesador usa interacciones especiales entre electrones y núcleos atómicos para conectar y controlar los qubits. El equipo logró una alta precisión, con operaciones que funcionan correctamente más del 99% de las veces. También crearon estados entrelazados, donde los qubits están fuertemente ligados, tanto dentro de grupos de átomos como entre dos grupos.\n\n**Impacto** – Este es el procesador cuántico más grande basado en silicio con tal precisión reportado hasta ahora. Las conexiones y controles de alta calidad entre varios qubits muestran que es posible escalar procesadores cuánticos en silicio. Este trabajo es importante porque usa materiales y técnicas compatibles con la fabricación actual de computadoras, facilitando la producción futura de dispositivos cuánticos.\n\n**Próximo paso** – Los investigadores planean mejorar el procesador reduciendo errores, acelerando operaciones y conectando aún más qubits. Estas mejoras ayudarán a construir computadoras cuánticas más grandes y confiables que puedan corregir errores y realizar tareas prácticas.\n\n**Conclusión en una frase** – Científicos han construido un procesador cuántico preciso de 11 qubits en silicio, con más del 99% de precisión, marcando un paso importante hacia la computación cuántica escalable usando materiales existentes.\n",
      "image_url": "public/images/news_image_An-11-qubit-atom-processor-in-silicon.png",
      "image_prompt": "A detailed, warm-toned painting of two intricately crafted silicon crystal lattices, each holding clusters of glowing, precisely placed phosphorus atoms represented as softly illuminated spheres interconnected by delicate, shimmering threads symbolizing quantum spin and exchange interactions, set against a calm, neutral background that emphasizes the atomic-scale precision and harmonious connectivity of an 11-qubit quantum processor."
    },
    {
      "title": "Scientists prove “impossible” Earth-to-space quantum link is feasible",
      "summary": "Researchers have shown that quantum signals can be sent from Earth up to satellites, not just down from space as previously believed. This breakthrough could make global quantum networks far more powerful, affordable, and practical.",
      "content": "Quantum satellites are best known for sending entangled particles of light from orbit down to ground stations, a method used to create extremely secure communication links. New research now shows that the process can also work in reverse, with quantum signals sent from Earth up to a satellite, an approach long considered impractical.\n\nThis finding removes several major limitations facing today's quantum satellite systems. Equipment on the ground can draw on far more power, is simpler to service, and can produce much stronger signals. These advantages could be critical for building future networks that link quantum computers through satellites acting as relays.\n\nStudy Details and Recent Milestones\n\nThe research, titled \"Quantum entanglement distribution via uplink satellite channels,\" by Professor Simon Devitt, Professor Alexander Solntsev and a research team from the University of Technology Sydney (UTS), was recently published in the journal Physical Review Research.\n\nQuantum satellite communication has already seen important advances. China's Micius satellite, launched in 2016, enabled the first demonstrations of quantum-encrypted data sent from space. In 2025, the Jinan-1 microsatellite pushed this work further by establishing a 12,900 km quantum connection between China and South Africa.\n\nWhy Uplink Quantum Communication Was Dismissed\n\n\"Current quantum satellites create entangled pairs in space and then send each half of the pair down to two places on Earth -- called a 'downlink',\" said Professor Solntsev. \"It's mostly used for cryptography, where only a few photons (particles of light) are needed to generate a secret key.\"\n\nScientists largely ignored the opposite approach, in which entangled photons are produced on Earth and transmitted upward. This idea was seen as unrealistic because of expected losses, interference, and the scattering of light as it travels through the atmosphere.\n\nModeling the \"Impossible\" Scenario\n\n\"The idea is to fire two single particles of light from separate ground stations to a satellite orbiting 500 km above Earth, traveling at about 20,000 km per hour, so that they meet so perfectly as to undergo quantum interference. Is this even possible?\" said Professor Devitt.\n\nAccording to the researchers, careful modeling suggests the answer is yes. \"Surprisingly, our modeling showed that an uplink is feasible. We included real-world effects such as background light from the Earth and sunlight reflections from the Moon, atmospheric effects and the imperfect alignment of optical systems,\" he said.\n\nToward a Scalable Quantum Internet\n\nThe team says the idea could be tested soon using drones or balloon-mounted receivers, providing a stepping stone toward large-scale quantum networks that span nations and continents using small satellites in low Earth orbit.\n\n\"A quantum internet is a very different beast from current nascent cryptographic applications. It's the same primary mechanism but you need significantly more photons -- more bandwidth -- to connect quantum computers,\" said Professor Devitt.\n\nThe uplink strategy may offer a practical solution. \"The uplink method could provide that bandwidth. The satellite only needs a compact optical unit to interfere incoming photons and report the result, rather than quantum hardware to produce the trillions upon trillions of photons per second needed to overcome losses to the ground, allowing for a high-bandwidth quantum link. That keeps costs and size down and makes the approach more practical.\"\n\nQuantum Entanglement as Everyday Infrastructure\n\nProfessor Devitt compares the long-term vision to modern electricity. \"In the future, quantum entanglement is going to be a bit like electricity. A commodity that we talk about that powers other things. It's generated and transmitted in a way that is often invisible to the user; we just plug in our appliances and use it. This will ultimately be the same for large quantum entanglement networks. There will be quantum devices that plug into an entanglement source as well as a power source, utilizing both to do something useful,\" he said.\n\nThe project combines expertise from the UTS Faculty of Engineering and IT and the Faculty of Science, bringing together specialists in quantum networking, systems modeling, and photonics. It demonstrates how collaboration across disciplines at UTS is helping address some of the most demanding challenges in emerging technology.",
      "url": "https://www.sciencedaily.com/releases/2025/12/251217082515.htm",
      "source": "Latest Science News -- ScienceDaily",
      "published": "2025-12-17",
      "sentiment_score": 0.9,
      "reasoning": "The article reports a significant scientific breakthrough proving that quantum signals can be sent from Earth to satellites, overcoming previous limitations. This advancement has broad implications for building scalable, affordable, and practical global quantum networks, potentially revolutionizing secure communication and quantum computing connectivity worldwide. The story is focused, detailed, and highlights a meaningful technological achievement with large-scale societal benefits.",
      "category": "Technology",
      "personality_title": "Scientists show quantum signals can be sent from Earth to satellites",
      "personality_presentation": "**Context** – Until now, quantum satellites were known only for sending special light particles called entangled photons from space down to Earth. This method helps create very secure communication links.\n\n**What happened** – Researchers from the University of Technology Sydney proved that quantum signals can also travel the other way: from Earth up to satellites. They used detailed models to show that sending particles of light from ground stations to a fast-moving satellite 500 km above Earth is possible, even with challenges like atmospheric interference and light scattering.\n\n**Impact** – This discovery removes big problems in quantum satellite systems. Ground equipment can be more powerful, easier to fix, and send stronger signals. This could help build large quantum networks connecting quantum computers worldwide using satellites as relays. The uplink method also makes satellites simpler and cheaper because they don’t need to create many photons themselves.\n\n**What's next step** – The team plans to test this idea soon with drones or balloons carrying receivers. This will help develop larger quantum networks that cover entire countries or continents with small satellites orbiting close to Earth.\n\n**One-sentence takeaway** – Scientists have proven that quantum signals can be sent from Earth to satellites, paving the way for stronger and more practical global quantum networks.\n\n",
      "personality_title_fr": "Des scientifiques prouvent que les signaux quantiques peuvent être envoyés de la Terre aux satellites",
      "personality_presentation_fr": "**Contexte** – Jusqu'à présent, les satellites quantiques étaient connus pour envoyer des particules de lumière intriquées de l'espace vers la Terre. Cette méthode permet de créer des communications très sécurisées.\n\n**Ce qui s'est passé** – Des chercheurs de l'Université de Technologie de Sydney ont prouvé que les signaux quantiques peuvent aussi être envoyés dans l'autre sens : de la Terre vers les satellites. Ils ont utilisé des modèles précis pour montrer que l'envoi de particules de lumière depuis des stations au sol vers un satellite en mouvement rapide à 500 km d'altitude est possible, malgré les défis comme l'interférence atmosphérique.\n\n**Impact** – Cette découverte élimine de grands obstacles dans les systèmes de satellites quantiques. L'équipement au sol peut être plus puissant, plus facile à réparer et envoyer des signaux plus forts. Cela pourrait aider à construire de grands réseaux quantiques reliant des ordinateurs quantiques dans le monde entier grâce à des satellites relais. La méthode d'envoi vers le haut rend aussi les satellites plus simples et moins chers.\n\n**Prochaine étape** – L'équipe prévoit de tester bientôt cette idée avec des drones ou des ballons portant des récepteurs. Cela aidera à développer des réseaux quantiques plus grands couvrant des pays ou des continents avec de petits satellites en orbite basse.\n\n**Conclusion en une phrase** – Des scientifiques ont prouvé que les signaux quantiques peuvent être envoyés de la Terre aux satellites, ouvrant la voie à des réseaux quantiques mondiaux plus puissants et pratiques.\n\n",
      "personality_title_es": "Científicos demuestran que se pueden enviar señales cuánticas de la Tierra a los satélites",
      "personality_presentation_es": "**Contexto** – Hasta ahora, los satélites cuánticos solo enviaban partículas de luz entrelazadas desde el espacio hacia la Tierra, creando comunicaciones muy seguras.\n\n**Qué pasó** – Investigadores de la Universidad de Tecnología de Sídney demostraron que las señales cuánticas también pueden enviarse en sentido contrario: desde la Tierra hacia los satélites. Usaron modelos detallados para mostrar que es posible enviar partículas de luz desde estaciones terrestres a un satélite que se mueve rápido a 500 km sobre la Tierra, a pesar de problemas como la interferencia atmosférica.\n\n**Impacto** – Este descubrimiento elimina grandes limitaciones en los sistemas de satélites cuánticos. Los equipos en tierra pueden ser más potentes, fáciles de reparar y enviar señales más fuertes. Esto podría ayudar a construir grandes redes cuánticas que conecten computadoras cuánticas en todo el mundo usando satélites como repetidores. Además, el método de envío hacia arriba hace que los satélites sean más simples y baratos.\n\n**Próximo paso** – El equipo planea probar esta idea pronto con drones o globos que lleven receptores. Esto ayudará a crear redes cuánticas grandes que cubran países o continentes con pequeños satélites en órbita baja.\n\n**Conclusión en una frase** – Científicos han demostrado que se pueden enviar señales cuánticas de la Tierra a los satélites, abriendo el camino para redes cuánticas globales más fuertes y prácticas.\n\n",
      "image_url": "public/images/news_image_Scientists-prove-impossible-Earth-to-space-quantum.png",
      "image_prompt": "A serene night sky over a softly glowing Earth horizon with two radiant beams of light—each composed of delicate, intertwined particles—ascending from distinct ground stations and converging high above at a sleek, stylized satellite orbiting quietly; the scene is rendered in gentle, natural tones with detailed, harmonious brushstrokes evoking cutting-edge quantum connection and seamless communication between Earth and space."
    },
    {
      "title": "A quantum mystery that stumped scientists for decades is solved",
      "summary": "A long-standing physics mystery has been solved with the discovery of emergent photon-like behavior inside a strange quantum material. The finding confirms a true 3D quantum spin liquid and unlocks a new way to study deeply entangled matter.",
      "content": "A global research team led by Rice University physicist Pengcheng Dai has verified the presence of emergent photons and fractionalized spin excitations in an unusual quantum spin liquid. Reported in Nature Physics, the work points to the crystal cerium zirconium oxide (Ce2Zr2O 7 ) as a clean three-dimensional example of this exotic state of matter.\n\nQuantum spin liquids have fascinated physicists for years because they could eventually support transformative technologies, including quantum computing and dissipationless energy transmission. Unlike ordinary magnets that settle into an orderly pattern, these materials avoid conventional magnetic order. Instead, their magnetic moments remain strongly quantum-entangled and in constant collective motion at temperatures close to absolute zero, producing behavior that resembles emergent quantum electrodynamics.\n\n\"We've answered a major open question by directly detecting these excitations,\" said Dai, the Sam and Helen Worden Professor of Physics and Astronomy. \"This confirms that Ce2Zr2O 7 behaves as a true quantum spin ice, a special class of quantum spin liquids in three dimensions.\"\n\nCleaner Measurements With Polarized Neutron Scattering\n\nTo pin down these elusive signatures, the researchers relied on advanced polarized neutron scattering. This approach helped them isolate the magnetic scattering they cared about while filtering out other signals, even as the system approached the zero temperature limit.\n\nTheir measurements also revealed emergent photon signals near zero energy -- a defining trait that separates quantum spin ice from more familiar phases found in conventional magnets. Additional evidence came from specific heat measurements, which supported the idea that these predicted emergent photons follow a dispersion resembling the way sound moves through a solid.\n\nEarlier attempts to confirm this kind of behavior were often undermined by technical noise and incomplete data. The Rice-led team addressed those challenges through improved sample preparation and high-precision instruments, supported by an international effort involving major laboratories across Europe and North America.\n\nFirst-of-Its-Kind Observation With Big Implications\n\nIn this three-dimensional candidate material, the researchers observed both emergent photons and spinons -- key hallmarks of quantum spin ice. The result resolves a long-running debate in condensed matter physics and gives scientists a strong platform for studying next-generation quantum phenomena and potential technology pathways.\n\nBin Gao, a research scientist in Rice's Department of Physics and Astronomy and the study's first author, said the findings back up decades of theoretical expectations.\n\n\"This surprising result encourages scientists to look deeper into such unique materials, potentially changing how we understand magnets and the behavior of materials in the extreme quantum regime,\" Gao said.\n\nResearch Team and Funding\n\nCo-authors of this study include Félix Desrochers and Yong Baek Kim of the University of Toronto; Rice alumnus David Tam of the Paul Scherrer Institut; Silke Paschen, Diana Kirschbaum and Duy Ha Nguyen of Vienna University of Technology; Paul Steffens and Arno Hiess of the Institut Laue-Langevin; Yixi Su of Jülich Centre of Heinz Maier-Leibnitz Zentrum; and Sang-Wook Cheong of Rutgers University.\n\nThe U.S. Department of Energy, the Gordon and Betty Moore Foundation and the Robert A. Welch Foundation supported this study.",
      "url": "https://www.sciencedaily.com/releases/2025/12/251217082509.htm",
      "source": "Latest Science News -- ScienceDaily",
      "published": "2025-12-17",
      "sentiment_score": 0.85,
      "reasoning": "The article reports a significant scientific breakthrough in physics with the first direct observation of emergent photon-like behavior in a 3D quantum spin liquid material. This discovery resolves a decades-long mystery, confirms theoretical predictions, and opens new avenues for studying quantum phenomena that could impact future technologies like quantum computing and energy transmission. The research involves a global collaboration and advanced experimental techniques, indicating broad scientific significance and potential real-world technological benefits.",
      "category": "Technology",
      "personality_title": "Scientists confirm new quantum state in 3D material after decades of research",
      "personality_presentation": "**Context** – Scientists have long studied a strange state of matter called a quantum spin liquid. Unlike normal magnets, these materials don’t settle into an ordered pattern. Instead, their tiny magnetic parts stay in constant, quantum motion, which is hard to observe and understand.\n\n**What happened** – A team led by physicist Pengcheng Dai at Rice University discovered clear signs of special particles called emergent photons inside a crystal named cerium zirconium oxide (Ce2Zr2O7). Using a technique called polarized neutron scattering, they measured magnetic signals very precisely at nearly absolute zero temperature. This proved that the crystal is a true three-dimensional quantum spin liquid, a rare and unique form of matter.\n\n**Impact** – This discovery solves a mystery that has puzzled scientists for decades. It confirms theories about quantum spin ice, a special kind of quantum spin liquid, by showing both emergent photons and spinon particles exist in a real material. This understanding could help scientists study new quantum effects and develop future technologies like quantum computers or better ways to transmit energy.\n\n**What's next step** – Researchers will continue exploring materials like Ce2Zr2O7 to learn more about quantum spin liquids. The precise methods used here will help uncover other unusual quantum states. This work may lead to new materials that can be used in advanced technology or provide insights into how matter behaves at extremely low temperatures.\n\n**One-sentence takeaway** – For the first time, scientists have directly observed emergent photons in a three-dimensional quantum spin liquid, confirming a major physics theory and opening new paths for quantum research.",
      "personality_title_fr": "Les scientifiques confirment un nouvel état quantique dans un matériau 3D après des décennies de recherche",
      "personality_presentation_fr": "**Contexte** – Les scientifiques étudient depuis longtemps un état étrange de la matière appelé liquide de spin quantique. Contrairement aux aimants normaux, ces matériaux ne forment pas de motifs ordonnés. Au lieu de cela, leurs petites parties magnétiques restent en mouvement quantique constant, ce qui est difficile à observer et comprendre.\n\n**Ce qui s’est passé** – Une équipe dirigée par le physicien Pengcheng Dai de l’Université Rice a découvert des signes clairs de particules spéciales appelées photons émergents à l’intérieur d’un cristal nommé oxyde de cérium zirconium (Ce2Zr2O7). En utilisant une technique appelée diffusion neutronique polarisée, ils ont mesuré très précisément des signaux magnétiques près du zéro absolu. Cela prouve que ce cristal est un véritable liquide de spin quantique tridimensionnel, une forme rare et unique de matière.\n\n**Impact** – Cette découverte résout un mystère qui a intrigué les scientifiques pendant des décennies. Elle confirme les théories sur la glace quantique de spin, un type spécial de liquide de spin quantique, en montrant que des photons émergents et des particules spinon existent dans un matériau réel. Cette compréhension pourrait aider à étudier de nouveaux effets quantiques et à développer des technologies futures comme les ordinateurs quantiques ou de meilleures façons de transmettre l’énergie.\n\n**Prochaine étape** – Les chercheurs vont continuer à explorer des matériaux comme Ce2Zr2O7 pour mieux comprendre les liquides de spin quantiques. Les méthodes précises utilisées ici aideront à découvrir d’autres états quantiques inhabituels. Ce travail pourrait mener à de nouveaux matériaux pour des technologies avancées ou donner des idées sur le comportement de la matière à très basse température.\n\n**Résumé en une phrase** – Pour la première fois, des scientifiques ont observé directement des photons émergents dans un liquide de spin quantique tridimensionnel, confirmant une grande théorie physique et ouvrant de nouvelles voies pour la recherche quantique.",
      "personality_title_es": "Científicos confirman un nuevo estado cuántico en un material 3D tras décadas de investigación",
      "personality_presentation_es": "**Contexto** – Los científicos han estudiado durante mucho tiempo un extraño estado de la materia llamado líquido de espín cuántico. A diferencia de los imanes normales, estos materiales no forman un patrón ordenado. En cambio, sus pequeñas partes magnéticas permanecen en movimiento cuántico constante, lo que es difícil de observar y entender.\n\n**Qué sucedió** – Un equipo dirigido por el físico Pengcheng Dai de la Universidad Rice descubrió señales claras de partículas especiales llamadas fotones emergentes dentro de un cristal llamado óxido de cerio zirconio (Ce2Zr2O7). Usando una técnica llamada dispersión de neutrones polarizados, midieron señales magnéticas con mucha precisión cerca del cero absoluto. Esto probó que el cristal es un verdadero líquido de espín cuántico tridimensional, una forma rara y única de materia.\n\n**Impacto** – Este descubrimiento resuelve un misterio que ha desconcertado a los científicos durante décadas. Confirma teorías sobre el hielo de espín cuántico, un tipo especial de líquido de espín cuántico, mostrando que existen fotones emergentes y partículas espinón en un material real. Este conocimiento podría ayudar a estudiar nuevos efectos cuánticos y desarrollar tecnologías futuras como computadoras cuánticas o mejores formas de transmitir energía.\n\n**Próximo paso** – Los investigadores seguirán explorando materiales como Ce2Zr2O7 para aprender más sobre líquidos de espín cuántico. Los métodos precisos usados aquí ayudarán a descubrir otros estados cuánticos inusuales. Este trabajo podría llevar a nuevos materiales para tecnología avanzada o dar ideas sobre cómo se comporta la materia a temperaturas extremadamente bajas.\n\n**Conclusión en una frase** – Por primera vez, los científicos observaron directamente fotones emergentes en un líquido de espín cuántico tridimensional, confirmando una teoría importante de la física y abriendo nuevos caminos para la investigación cuántica.",
      "image_url": "public/images/news_image_A-quantum-mystery-that-stumped-scientists-for-deca.png",
      "image_prompt": "A detailed, warm-toned painting of an abstract crystalline lattice glowing softly in gentle golds and blues, with delicate, shimmering wave-like patterns weaving through it to symbolize emergent photons and fractionalized spin excitations, set against a dark background that evokes the quantum realm near absolute zero."
    },
    {
      "title": "Programmable 200 GOPS Hopfield-inspired photonic Ising machine",
      "summary": "Nature, Published online: 17 December 2025; doi:10.1038/s41586-025-09838-7An architecture inspired by Hopfield networks based on a programmable, stable, room-temperature optoelectronic oscillator-based photonics Ising machine is introduced that can be used to efficiently address optimization and combinatorics problems.",
      "content": "Ising machines offer a compelling approach to addressing NP-hard problems1, but physical realizations that are simultaneously scalable, reconfigurable, fast and stable remain elusive. Quantum annealers, such as D-Wave’s cryogenic hardware, target combinatorial optimization tasks, but quadratic scaling of qubit requirements with problem size limits their scalability on dense graphs2. Here we introduce a programmable, stable, room-temperature optoelectronic oscillator (OEO)-based Ising machine with linear scaling in spin representation. Inspired by Hopfield networks3, our architecture solves fully connected problems with up to 256 spins (65,536 couplings) and >41,000 spins (205,000+ couplings) if sparse. Our system makes use of cascaded thin-film lithium niobate (TFLN) modulators, a semiconductor optical amplifier (SOA) and a digital signal processing (DSP) engine in a recurrent time-encoded loop, demonstrating potential >200 giga operations per second (GOPS) for spin coupling and nonlinearity. This platform achieves the largest spin configuration in an OEO-based photonic Ising machine, enabled by high intrinsic speed. We experimentally demonstrate best-in-class solution quality for max-cut problems of arbitrary graph topologies (2,000 and 20,000 spins) among photonic Ising machines and obtain ground-state solutions for number partitioning4 and lattice protein folding5—benchmarks previously unaddressed by photonic systems. Our system uses inherent noise from high baud rates to escape local minima and accelerate convergence. Finally, we show that embedding DSP—traditionally used in optical communications—within optical computation enhances convergence and solution quality, opening new frontiers in scalable, ultrafast computing for optimization, neuromorphic processing and analogue artificial intelligence.",
      "url": "https://www.nature.com/articles/s41586-025-09838-7",
      "source": "Nature",
      "published": "2025-12-18",
      "sentiment_score": 0.85,
      "reasoning": "The article reports a significant breakthrough in photonic Ising machines, demonstrating a scalable, fast, and stable architecture that can solve complex optimization problems efficiently. This advancement has broad implications for computing, optimization, neuromorphic processing, and AI, representing a meaningful technological progress with potential large-scale benefits.",
      "category": "Technology",
      "personality_title": "New photonic Ising machine solves complex problems faster and at room temperature",
      "personality_presentation": "**Context** – Scientists are working on special computers called Ising machines to solve very hard problems that involve finding the best solution from many possibilities. These problems appear in fields like logistics, biology, and artificial intelligence. Previous machines either needed very cold temperatures or could not handle large problems efficiently.\n\n**What happened** – Researchers developed a new photonic Ising machine that works at room temperature using light and electronics. Inspired by brain-like Hopfield networks, this machine can handle up to 256 connected parts or more if the connections are fewer. It uses a combination of optical components and digital processing to perform over 200 billion operations per second, making it very fast and stable.\n\n**Impact** – This machine is the largest and fastest of its kind, solving problems that other photonic systems could not, like large graph cuts, number partitioning, and protein folding. It cleverly uses natural noise to avoid getting stuck in wrong answers and improves solution quality by combining optical and digital technologies. This breakthrough shows a new way to build powerful, energy-efficient computers for tasks like optimization and artificial intelligence.\n\n**What's next step** – The team plans to explore more complex problems and improve the machine’s design further. They hope this technology will lead to faster and more scalable computing systems that can help in many areas, including smarter AI and better ways to process information similar to the human brain.\n\n**One-sentence takeaway** – A new room-temperature photonic Ising machine uses light and electronics to solve complex optimization problems faster and more efficiently than before.",
      "personality_title_fr": "Nouvelle machine Ising photonique résout des problèmes complexes rapidement à température ambiante",
      "personality_presentation_fr": "**Contexte** – Les scientifiques développent des ordinateurs spéciaux appelés machines Ising pour résoudre des problèmes très difficiles qui demandent de trouver la meilleure solution parmi beaucoup de possibilités. Ces problèmes apparaissent dans des domaines comme la logistique, la biologie et l’intelligence artificielle. Les machines précédentes nécessitaient souvent des températures très basses ou ne pouvaient pas gérer de gros problèmes efficacement.\n\n**Ce qui s’est passé** – Des chercheurs ont créé une nouvelle machine Ising photonique qui fonctionne à température ambiante en utilisant la lumière et l’électronique. Inspirée des réseaux de Hopfield, cette machine peut gérer jusqu’à 256 parties connectées, ou plus si les connexions sont moins nombreuses. Elle combine des composants optiques et un traitement numérique pour réaliser plus de 200 milliards d’opérations par seconde, ce qui la rend très rapide et stable.\n\n**Impact** – Cette machine est la plus grande et la plus rapide de ce type, capable de résoudre des problèmes que d’autres systèmes photoniques ne pouvaient pas, comme les coupes de graphes importantes, la partition de nombres et le repliement de protéines. Elle utilise intelligemment le bruit naturel pour éviter les mauvaises solutions et améliore la qualité des résultats en combinant technologies optiques et numériques. Cette avancée ouvre une nouvelle voie pour construire des ordinateurs puissants et économes en énergie pour l’optimisation et l’intelligence artificielle.\n\n**Prochaine étape** – L’équipe prévoit d’étudier des problèmes plus complexes et d’améliorer encore la machine. Ils espèrent que cette technologie conduira à des systèmes informatiques plus rapides et évolutifs, utiles pour une intelligence artificielle plus avancée et un traitement de l’information inspiré du cerveau humain.\n\n**Résumé en une phrase** – Une nouvelle machine Ising photonique à température ambiante utilise la lumière et l’électronique pour résoudre plus rapidement et efficacement des problèmes d’optimisation complexes.",
      "personality_title_es": "Nueva máquina Ising fotónica resuelve problemas complejos rápidamente a temperatura ambiente",
      "personality_presentation_es": "**Contexto** – Los científicos están desarrollando computadoras especiales llamadas máquinas Ising para resolver problemas muy difíciles que consisten en encontrar la mejor solución entre muchas opciones. Estos problemas se presentan en áreas como logística, biología e inteligencia artificial. Las máquinas anteriores necesitaban temperaturas muy frías o no podían manejar problemas grandes de manera eficiente.\n\n**Qué pasó** – Investigadores crearon una nueva máquina Ising fotónica que funciona a temperatura ambiente usando luz y electrónica. Inspirada en redes de Hopfield, esta máquina puede manejar hasta 256 partes conectadas, o más si las conexiones son menos. Usa componentes ópticos y procesamiento digital para realizar más de 200 mil millones de operaciones por segundo, siendo muy rápida y estable.\n\n**Impacto** – Esta máquina es la más grande y rápida de su tipo, capaz de resolver problemas que otros sistemas fotónicos no podían, como cortes grandes en grafos, partición de números y plegamiento de proteínas. Aprovecha el ruido natural para evitar soluciones incorrectas y mejora la calidad combinando tecnologías ópticas y digitales. Este avance muestra una nueva forma de construir computadoras potentes y eficientes para optimización e inteligencia artificial.\n\n**Próximo paso** – El equipo planea estudiar problemas más complejos y mejorar el diseño de la máquina. Esperan que esta tecnología lleve a sistemas de computación más rápidos y escalables, útiles para IA más inteligente y procesamiento de información similar al cerebro humano.\n\n**Resumen en una frase** – Una nueva máquina Ising fotónica a temperatura ambiente usa luz y electrónica para resolver problemas complejos de optimización más rápido y eficientemente que antes.",
      "image_url": "public/images/news_image_Programmable-200-GOPS-Hopfield-inspired-photonic-I.png",
      "image_prompt": "A detailed, warm-toned painting of an intricate network of glowing interconnected nodes and delicate light beams flowing through thin-film waveguides and optical loops, symbolizing a high-speed photonic Ising machine solving complex optimization problems, with subtle abstract representations of digital signal processing as softly pulsing circuits weaving through the network, all rendered in natural, soft colors without human figures."
    }
  ]
}