{
  "personality": null,
  "timestamp": "2025-09-18T04:38:54.468821",
  "category": "Technology",
  "news_summary": "Advancements in technology showcase innovative analogue speech recognition and enhanced safety measures for next-generation batteries.",
  "news_summary_fr": "Les avancées technologiques présentent une reconnaissance vocale analogique innovante et des mesures de sécurité renforcées pour les batteries de nouvelle génération.",
  "news_summary_es": "Los avances tecnológicos muestran un innovador reconocimiento analógico de voz y medidas de seguridad mejoradas para las baterías de nueva generación.",
  "articles": [
    {
      "title": "Analogue speech recognition based on physical computing",
      "summary": "Nature, Published online: 17 September 2025; doi:10.1038/s41586-025-09501-1A temporal-signal processor based on two in-materia computing hardware platforms—reconfigurable nonlinear-processing units (RNPUs) and analogue in-memory computing (AIMC)—is used for both feature extraction and classification, advancing compactness, efficiency, and performance of heterogeneous smart edge devices.",
      "content": "RNPU fabrication and room-temperature operation\n\nA lightly n-doped silicon wafer (resistivity ρ ≈ 5 Ω cm) is cleaned and heated for 4 h in a furnace at 1,100 °C for dry oxidation, producing a 280-nm thick SiO 2 layer. Photolithography and chemical etching are used to selectively remove the silicon oxide. A second, 35 nm SiO 2 layer is needed for the desired dopant concentration. Ion implantation of B+ ions is performed at 9 keV with a dose of 3.5 × 1014 cm−2. After implantation, rapid thermal annealing (1,050 °C for 7 s) is carried out to activate the dopants. The second oxide layer is removed by buffered hydrofluoric acid (1:7; 45 s) and then the wafer is diced into 1 cm × 1 cm pieces. E-beam lithography and e-beam evaporation are used, respectively, for creating the (1.5 nm Ti/25 nm Pd) electrodes. Finally, reactive-ion etching (CHF 3 and O 2 , (25:5)) is used to etch (30–40 nm) the silicon until the desired dopant concentration is obtained.\n\nWe have consistently realized room-temperature functionality for both B-doped and As-doped RNPUs using a fabrication process that is slightly different from the previous work3. The main difference is that we do not hydrofluoric acid-etch the top layer of the RNPU after reactive-ion etching, which we expect to lead to an increased role of P b centres54. The observed activation energy of roughly 0.4 eV for both B-doped and As-doped devices agrees with their position in the Si bandgap and their ambipolar electronic activity. Depending on the relative concentration of intentional and unintentional dopants, and the voltages applied, we argue that both trap-assisted transport and trap-limited space-charge-limited-current55 transport mechanisms can play a role and contribute to the observed nonlinearity at room temperature. A detailed study of the charge transport mechanisms involved will be presented elsewhere.\n\nRNPU measurement circuitry\n\nWe use a National Instruments C-series voltage output module (NI-9264) to apply input and control voltages to the RNPU. The NI-9264 is a 16-bit digital-to-analogue converter with a slew rate of 4 V μs−1 and a settling time of 15 μs for a 100-pF capacitive load and 1 V step. As shown in Fig. 2a, a small parasitic capacitance (roughly 10–100 pF) to ground is present at the RNPU output. In contrast to the previous study3, we do not measure the RNPU output current but the output voltage, without amplification. In refs. 3,4,31, the device output was virtually grounded by the operational amplifier used for current-to-voltage conversion (Extended Data Fig. 1). Thus, the external capacitance was essentially short-circuited to ground, and no time dynamics was observed. In the present study, we directly measure and digitize the RNPU output voltage with the National Instruments C-series voltage input module (NI-9223; input impedance greater than 1 GΩ). A large input impedance, that is, more than ten times the RNPU resistance, is necessary to ensure that the time dynamics of the RNPU circuit is measurable.\n\nRecurrent fading memory in RNPU circuit\n\nIn an RNPU, the potential landscape of the active region, which is dependent on the potential of the surrounding electrodes, determines the output voltage. In the static measurement model, the output electrode is virtually grounded. In the dynamic measurement mode (this work), however, the output electrode has a finite potential that we read with the ADC. This potential is the charge stored on the capacitor divided by the capacitance \\(\\left({V}_{{\\rm{out}}}=\\frac{Q}{{C}_{{\\rm{ext}}}}\\right)\\). The charge on the capacitor, and hence V out , depends on the previous inputs. The short-term (fading) memory of the circuit is therefore recurrent in nature, that is, previous inputs influence the present physical characteristics of the circuit over a typical timescale given by the time constant. More specifically, as shown in Fig. 3, an RNPU circuit is a stateful system in which the current behaviour is influenced by past events within a range of tens of milliseconds.\n\nExtended Data Fig. 2a shows an input pulse series with a magnitude of 1 V (orange) and the output measured from the RNPU (blue). Extended Data Fig. 2b,c zoom in on the RNPU response. For each panel, we fit an exponential to extract the time constant. The time constant changes over time for the same repetitive input stimulus. We explain this by the output capacitor holding some charge from previous input pulses when the next input pulse arrives. On its turn, the potential landscape of the device is affected by the stored charge, resulting in different intrinsic RNPU impedance values.\n\nExtended Data Fig. 3 emphasizes the nonlinearity of the RNPU response, which affects the (dis)charging rate of the RNPU circuit. A series of step functions are fed to the device (orange), and the output is measured and normalized to 1 V for better visualization (blue). Each step function has a 200 mV larger magnitude compared with the previous one. The charge stored on the capacitance, read as ADC voltage, is different for each step function, indicating that the RNPU responds to the input nonlinearly, and thus, the time constant for each input step is different. In summary, these two experiments show that the RNPU behaviour is nonlinear, dependent on both the input at t = t 0 and on preceding inputs.\n\nTI-46-Word spoken digit dataset\n\nThe audio fragments of spoken digits are obtained from the TI-46-Word dataset1, available at https://catalogue.ldc.upenn.edu/LDC93S9. To reduce the measurement time, we use the female subset, which contains a total of 2,075 clean utterances from 8 female speakers, covering the digits 0 to 9. The audio samples have been amplified to an amplitude range of −0.75 V to 0.75 V to match the RNPU input range and trimmed to minimize the silent parts by removing data points smaller than 50 mV (again for reducing measurement time). We used stratified randomized split to divide the dataset into train (90%) and test (10%) subsets.\n\nGSC dataset\n\nThe GSC2 dataset (available at https://www.tensorflow.org/datasets/catalog/speech_commands), is an open-source dataset containing 65,000 1-s audio recordings spoken by more than 1,800 speakers. Although the dataset comprises thousands of audio recordings, to reduce our measurement time, we selected a subset of 6,000 recordings (100 min of audio, total 64 × 100 ≈ 106 h of measurement), comprising 200 recordings per class (total 30 classes). Then, we used 11 classes as keywords and the rest as unknown (shown in Fig. 4f). No preprocessing, such as trimming silence or normalizing data, was applied to this subset before RNPU measurements. The dataset was divided into training (90%) and testing (10%) sets to assess the performance of our system. It is worth mentioning that the GSC dataset is commonly used to evaluate KWS systems that are tuned for high precision, that is, low false-positive rates. The analysis of our HWA trained model reveals that in addition to the high classification accuracy of roughly 90% (shown in Fig. 3e), the weighted F1-score for false-positive detections is roughly 91.3%.\n\nRNPU optimization\n\nThe RNPU control electrodes are used to tune the functionality for both the linear and nonlinear operation regimes. Applying control voltages greater than or roughly equal to 500 mV pushes the RNPU into its linear regime. Furthermore, higher control voltages make the device more conductive, leading to a faster discharge of the external capacitor and, thus, a smaller time constant. In this work, we randomly choose control voltages between −0.4 V and 0.4 V except for the end-to-end training of neural networks with RNPUs in the loop (Extended Data Fig. 4). For electrodes directly next to the output, we reduce this range by a factor of two because these control voltages have a stronger influence on the output voltage.\n\nSoftware-based feedforward-neural network training and inference\n\nTo evaluate the RNPU performance in reducing the classification complexity, we combined the RNPU preprocessing with two shallow ANNs: (1) a one-layer feedforward, and (2) a one-layer CNN. We trained these two models for the TI-46-Word spoken digits dataset with both the original (raw) dataset and the 32-channel RNPU-preprocessed data. For all evaluations, we used the AdamW optimizer56 with a learning rate of 10−3 and a weight decay of 10−5 and trained the network for 200 epochs.\n\nLinear layer with the original dataset. Each digit (0 to 9) in the dataset consists of an audio signal of 1 s length sampled at a 12.5 kS s −1 rate. Thus, 12,500 samples have to be mapped into 1 of 10 classes. The linear layer, therefore, has 12,500 × 10 = 125,000 learnable parameters followed by 10 log-sigmoid functions.\n\nLinear layer with the RNPU-preprocessed data. A 10-channel RNPU preprocessing layer with a downsampling rate of 10× converts an audio signal with a shape of 12,500 × 1 into 1,250 × 10. Then, the linear layer with 1,250 × 10 × 10 = 125,000 learnable parameters is trained. This model gives roughly 57% accuracy, which is 2% less than the 32-channel result reported in Fig. 3.\n\nCNN with the original dataset. The CNN model contains a 1D convolution layer with one input channel and 32 output channels, kernel size of 8, with a stride of 1, followed by a linear layer and log-sigmoid activation functions mapping the output of the convolution layer into 10 classes. The 1-layer CNN with 32 input and output channels has roughly 4,500 learnable parameters.\n\nCNNs with the RNPU-processed data. The CNN models used with RNPU-preprocessed data contain 1 (or 2) convolution layers with 16, 32 and 64 input channels and 32 output channels followed by a linear layer. Similar to the previous model, we used a kernel size of eight with a stride of one for each convolution kernel. The 1-layer CNN with 16, 32 and 64 channels has roughly 4,500, 8,600 and 16,900 learnable parameters, respectively.\n\nComparison with filterbanks and reservoir computing\n\nLow-pass and band-pass filterbanks\n\nThe RNPU circuit of Fig. 2a would behave like an ordinary low-pass filter if the RNPU is assumed to be an adjustable linear resistor. If so, RNPUs with different control voltages could be used to realize filters with different cut-off frequencies, thus forming a low-pass filterbank. However, as argued above, the RNPU cannot be considered merely a simple linear resistive element.\n\nFigure 2b shows the time constant of the voltage output of the circuit when the input stimulus is a voltage step of 1 V. When converting the time constants into frequency assuming a linear response, the cut-off frequency of corresponding low-pass filters can be calculated as \\({f}_{{\\rm{cut}}-{\\rm{off}}}=\\frac{1}{2{\\rm{\\pi }}RC}\\), where R and C are the values of the device resistance and the capacitance, respectively. Given the range of the time constants in Fig. 2b, the highest and lowest cut-off frequencies of such filters are\n\n$$\\begin{array}{c}{f}_{{\\rm{cut}}-{\\rm{off}},{\\rm{high}}}=\\frac{1}{2{\\rm{\\pi }}RC}=\\frac{1}{2{\\rm{\\pi }}\\times 12\\times {10}^{-3}}=13\\,{\\rm{Hz}},\\\\ {f}_{{\\rm{cut}}-{\\rm{off}},{\\rm{low}}}\\frac{1}{2{\\rm{\\pi }}\\times 34\\times {10}^{-3}}=4\\,{\\rm{Hz}},\\end{array}$$\n\nwhich are below the lowest frequency the human ear can detect (20 Hz). We used this cut-off frequency range to evaluate the classification accuracy when using a linear low-pass filterbank as feature extractor (Extended Data Table 1). However, the simulation results give roughly 75% classification accuracy. This indicates that the RNPU circuit does not simply construct a linear low-pass filter with the control voltages only changing the cut-off frequency, but rather a nonlinear filterbank that mimics biological cochlea by generating distortion products.\n\nNonlinear low-pass filterbanks\n\nTo study the effects of nonlinear filtering on the feature extraction step, and consecutively, on the classifier performance, we have introduced biologically inspired distortion products to the output of a linear filter, more specifically, distortion products of progressively higher frequency and lower magnitude. These properties are similar to the nonlinear properties of the RNPUs. Note that we only intend to qualitatively describe the effect of distortion products on the classification accuracy here, and not to quantitatively represent the RNPU circuit.\n\nThe nonlinear filterbanks are constructed by adding nonlinear components to the output of a linear time-invariant (LTI) filter. These nonlinear components include (1) harmonic or subharmonic addition and (2) delayed input. In the frequency domain, we progressively decrease the magnitude of the nonlinear components as their frequency increase (Extended Data Table 3).\n\n(1) Harmonic or subharmonic: given the input audio signal of x in (t), first, we calculate the Fourier transform of the output of the LTI low-pass filter F(LPF(x in (t))). Then, for a specific range of frequencies, for example, from the first to the hundredth frequency bin ([f 0 , f 100 ]), we add that frequency component to the frequency harmonic at the harmonic or subharmonic position (2 × f 0 , 3 × f 0 , …) divided by the order of the harmonic (1/n for n × f 0 ). The pseudo-code of this approach is shown in Extended Data Table 3. (2) Delayed inputs: the second nonlinear property of this nonlinear filtering is to add the delayed output of each filter (with 30% of the magnitude) to the next filter channel for a channel greater than one. Although this nonlinear inter-channel crosstalk does not occur in the RNPU circuit, our experiments have shown that this nonlinearity can help improve the classification accuracy. The time delayed has been chosen to be 10 samples, given the 1,250 S s−1 sampling rate (which is the rate after downsampling the filtered signal).\n\nTo evaluate the capability of linear and nonlinear low-pass filterbanks in acoustic feature extraction, we used a similar pipeline for RNPU-processed data, that is, a 1-layer CNN with a kernel size of 3, a tanh activation function trained for 500 epochs with the AdamW57 optimizer and a learning rate and weight decay of 0.001. We have also used the OneCycleLR scheduler58 with a maximum learning rate of 0.1 and a cosine annealing strategy. The classifier model has been intentionally kept simple to limit its feature-extraction capabilities so that we can better evaluate different preprocessing methods.\n\nWe examined linear low-pass filterbanks under two scenarios: (1) setting the cut-off frequencies according to the RNPU circuit time constants, that is, 4 Hz and 13 Hz, for lower and higher limits, respectively, and (2) setting a wider range of cut-off frequencies, that is, 20 and 625 for the lower and higher limits, respectively. The higher limit for the latter case is based on the Nyquist frequency given the 1,250 S s−1 sampling rate. The inference accuracy results for the same TI-46-Word benchmark test are summarized in Extended Data Table 1.\n\nNonlinear band-pass filterbanks\n\nThe hair cells of the basilar membrane in the cochlea convert acoustic vibrations into electrical signals nonlinearly, in which small displacements cause a notable change in the output at first. However, as the displacements increase, this rate slows down and eventually approaches a limit. It has been proposed that this with nonlinearity (CN) can be modelled as a hyperbolic tangent (tanh) function. Similar to nonlinear low-pass filterbanks, we implemented a nonlinear band-pass filterbank as a model for auditory filters in the mammalian auditory system. The model is constructed by an LTI filterbank of band-pass filters (fb band-pass ) initialized with gammatone within 20 Hz to 625 Hz followed by the tanh nonlinearity described as follows:\n\n$${f}_{{\\rm{CN}}}(X)=\\frac{1}{2}\\times \\tanh ({{fb}}_{{\\rm{band}}-{\\rm{pass}}}(X)+1),$$\n\nwhere X represents the input audio signal. For simulations with this nonlinear band-pass filterbank, we use the same classifier model (1-layer CNN) with the same hyperparameters described before. The performance of this nonlinear filterbank is summarized in Extended Data Table 1. Adding the tanh nonlinearity increases the overall classification accuracy to more than 93%, which is notably higher than the LTI band-pass filterbank but still less than the value obtained with RNPU preprocessing.\n\nReservoir computing\n\nHere we make a comparison with reservoir computing, in particular with echo state networks (ESNs). ESNs are reservoir computing-based frameworks for time-series processing, which are essentially randomly initialized recurrent neural networks59. ESNs offer nonlinearity and short-term memory essential for projecting input data into a high-dimensional feature space, in which the classification of those features becomes simpler. As reported in the main text, most reservoir computing solutions for speech recognition rely on frequency-domain feature extraction. More specifically, a reservoir is normally used to project pre-extracted features into a higher-dimensional space and then a classifier, often a linear layer, is used to perform the classification.\n\nHere, we compare the efficacy of ESNs for acoustic feature extraction to RNPUs and filterbanks. Using the ReservoirPy Python package60, we modelled 64 different reservoirs initialized with random conditions for neuron leak rate (lr), spectral radius of recurrent weight matrix (sr), recurrent weight matrix connectivity (rc_connectivity) and reservoir activation noise (rc_noise). Then, the same dataset as described in the main text is fed to all these reservoir models, and the output is used for classification. The reservoir maps the input to output with a downsampling rate of ten times, the same as for RNPUs and filterbanks. The performance of using reservoirs as feature extractors is summarized in Extended Data Table 1. Notably, this approach performs the poorest among other feature extractors. We attribute this low classification rate to the absence of bio-plausible mechanisms for acoustic feature extraction in the reservoir system. More specifically, although a reservoir projects the input into a higher-dimensional space, the lack of compressive linearity, a recurrent form of feedback from the output, and frequency selectivity make acoustic feature extraction with reservoirs less effective compared with other solutions.\n\nAIMC CNN model development\n\nWe implemented two CNN models for classification of the TI-64-Word spoken digits dataset on the AIMC chip with 2-layer and 3-layer convolutional layers, trained with 32 and 64 channels of RNPU measurement data, respectively. Extended Data Fig. 3 illustrates the architecture of the 3-layer convolution layer with 64 RNPU channels (roughly 65,000 learnable parameters). The first AIMC convolution layer receives the data from the RNPU with dimensions of 64 × 1,250. To implement this layer with a kernel size of 8, 64 × 8 = 512 crossbar rows are required. To optimize crossbar array resource use, this layer has 96 output channels. Thus, in total, 512 rows and 96 columns of the AIMC chip are used (Fig. 4c) to implement this layer. The second and third convolution layers both have a kernel size of three. Considering the 96 output channels, each layer requires 96 × 3 = 288 crossbar rows (Fig. 4c). Finally, the fully connected layer is a 36 × 10 feedforward layer.\n\nAIMC training and inference\n\nThe AIMC training, done in software, consists of two phases: a full-precision phase and a retraining phase, each performed for 200 epochs. The retraining phase is performed to make the classifier robust to weight noise arising from the non-ideality of the PCM devices and the 8-bit input-quantization. During this second phase, we implement two steps: (1) in every forward pass, random Gaussian noise with a magnitude equalling 12% of the maximum weight is added to each layer of the network, as well as Gaussian noise with a standard deviation of 0.1 is added to the output of every MVM to make the model more robust to noise, and (2) after each training batch, weights and biases are clipped to 1.5 × σ W implementing the low-bit quantization, where σ W is the standard deviation of the distribution of weights.\n\nRNPU static power measurement\n\nTo estimate the RNPU energy efficiency, we measured the static power consumption, P static , for ten different sets of random control voltages and averaged the results. In every configuration, a constant d.c. voltage is applied to each electrode, and the resulting current through every electrode is measured sequentially using a Keithley 236 source measure unit. P static is calculated according to\n\n$${P}_{{\\rm{static}}}=\\mathop{\\sum }\\limits_{k=0}^{N-1}{V}_{i}{I}_{i},$$\n\nwhere N = 8 is the number of electrodes of the device.\n\nAs illustrated in Extended Data Fig. 2, the average static power consumption <P static > of the measured RNPU is roughly 1.9 nW. For an estimate of the RNPU power efficiency, we use a conservative value of 5 nW, leading to 320 nW for 64 RNPUs in parallel, which is roughly 3 times lower than realized with analogue filterbanks reported in ref. 25. However, it is worth emphasizing that the advantage of RNPU preprocessing extends beyond this improvement by simplifying the classification step, as illustrated in Fig. 2.\n\nSystem-level efficiency analysis\n\nThe 6-layer CNN model for the GSC dataset, implemented on the IBM HERMES project chip, possesses roughly 470,000 learnable parameters and requires 120 M MAC operations per RNPU-preprocessed audio recording (all audio recordings have a duration of 1 s). On deployment of the AIMC chip, the model occupies 18 out of the available 64 cores (28% of the total number of cores), as depicted in Fig. 4e. Since the present chip is not designed and optimized for the studied tasks, but rather serves a general purpose, in each core some memristive devices remain unused causing the efficiency to drop.\n\nIn this regard, it is necessary to mention that we use experimental measurement reports from ref. 5 when the chip operates in one-phase read mode, although the reported inference accuracies are for the four-phase mode. The latter approach reduces the chip’s maximum throughput and energy efficiency by roughly four times, while accounting for circuit and device non-idealities. Our decision to report the results based on the one-phase read mode is recently supported by the literature57, as evidenced by the experimental demonstration of a new analogue or digital calibration procedure on the same IBM HERMES project chip. This procedure has been shown to achieve comparable high-precision computations in the one-phase read mode as those achieved in the four-phase model.\n\nConvolution layers 0 to 3 in Fig. 4d of the main text require 1977, 492, 121 and 28 MVMs per number of occupied cores, respectively. Therefore, the total number of MVMs (including two fully connected layers) is \\(\\mathop{\\sum }\\limits_{l=0}^{5}{{\\rm{MVMs}}}_{l}\\times {\\rm{num}}\\_{\\rm{cores}}={\\rm{5,861}}\\). The IBM HERMES project chip consumes 0.86 µJ at full use (for all 64 cores) for MVM operations with a delay of 133 ns. Consequently, the classifier model consumes \\(\\frac{5,\\,861}{64}\\times 0.86\\,{\\rm{\\mu }}{\\rm{J}}=78.7\\,{\\rm{\\mu }}{\\rm{J}}\\). Similarly, the end-to-end latency can be calculated as \\(\\mathop{\\sum }\\limits_{l=0}^{5}{{\\rm{MVMs}}}_{l}\\times 133\\,{\\rm{ns}}=2,\\,619{\\rm{\\times }}133\\,{\\rm{ns}}=348.3\\,{\\rm{\\mu }}{\\rm{s}}\\). Note that a layer (weight) matrix is typically partitioned into submatrices to be fitted on the AIMC crossbar core57. In our calculations, we assume that these submatrices are mapped to different cores and, therefore, the partial block-wise MVMs are executed in parallel.\n\nOur evaluation approach stands on the conservative side for MVM energy consumption; for instance, we assume energy consumption of one core for linear layers with 17,152 learnable parameters (out of 262,144 memristive devices of a core, which is only 6.5% use). However, we assume negligible energy consumption due to (local) digital processing, which rounds for roughly 7% of the total energy consumption (28% core use × 27% local digital processing unit’s part out of total static power consumption). Further, because of batch-norm and maximum-pooling layers, we buffered MVM results of each layer on memory, which introduces extra delay to the computations. However, for real-world tasks, we can avoid CNNs but rather use large multilayer perceptrons or recurrent neural networks instead.\n\nComparing energy consumption and latency with state of the art\n\nWe conducted a comparative analysis of the system-level energy consumption and latency of our architecture with other state-of-the-art speech-recognition systems, summarized in Extended Data Table 2. Dedicated digital speech-recognition chips consume the lowest amount of energy per inference. Nevertheless, because of the long latency of computations, their energy-delay product) is markedly high. A recent KWS task implemented on an AIMC-based chip has shown classification latency reduction, specifically, 2.4 μs compared with a 16-ms delay of digital solutions. However, this approach is based on extensive preprocessing that includes extracting mel-frequency cepstral coefficient features and pruning the features to increase the classification accuracy. Furthermore, not reporting the energy consumption, and only considering the classification latency (excluding preprocessing) are the reasons that make a direct comparison impossible.\n\nIt is worth mentioning that our energy estimate for the AIMC classification stage is based on experimental measurements from a prototype AIMC tile5. Similar to any emerging technology, we anticipate that these energy figures will notably improve as the technology matures beyond the prototyping stage39. These improvements are expected to occur at not only the peripheral circuitries, but also at the PCM device level: active efforts are already underway in both areas.\n\nIn AIMC, integration time and the ADC power consumption are major sources of the total energy consumption. In the AIMC chip used in this work, clock transients and the bit-parallel vector encoding scheme limit the MVM latency to roughly 133 ns. However, bit-serial encoding scheme and increasing the clock frequency is now being explored to reduce the integration time below around 50 ns. Furthermore, ADCs at the moment account for up to 50% of the total power consumption5. Efforts are underway to adopt time-interleaved, voltage-based ADCs, potentially in a design that avoids power-hungry components, such as operational transimpedance amplifiers. These design improvements will substantially reduce power consumption while also further improving conversion speeds through a single ADC conversion for signed inputs. Furthermore, introducing power gating techniques, which are not implemented at present, can further reduce ADC energy usage during idle periods.\n\nAt the PCM device level optimization, research is being conducted to reduce the conductance values of the programmable non-volatile states. Recent experimental measurements have shown that a more than ten times reduction in the conductance values can be achieved61, which can lead to proportional improvements in energy efficiency at the crossbar level. Taking all these enhancements into account, a conservative future estimate places the energy per inference in the range of roughly 10 μJ, which would also make AIMC systems competitive with state-of-the-art ASR processors in terms of energy efficiency.",
      "url": "https://www.nature.com/articles/s41586-025-09501-1",
      "source": "Nature",
      "published": "2025-09-18",
      "sentiment_score": 0.85,
      "reasoning": "The article reports a significant technological advancement in analogue speech recognition using physical computing hardware platforms (RNPUs and AIMC). This innovation improves compactness, efficiency, and performance of smart edge devices for speech recognition, with demonstrated high classification accuracy and low power consumption. The technology has broad implications for energy-efficient, low-latency speech recognition systems that can benefit many users and applications, representing a meaningful breakthrough in AI hardware and edge computing.",
      "category": "Technology",
      "personality_title": "New analogue computing technology boosts speech recognition efficiency",
      "personality_presentation": "**Context** – Speech recognition technology helps devices understand spoken words. Most current systems use digital computing, which can be slow and use a lot of power. Scientists are exploring new hardware that works more like the human brain to improve speed and energy use.\n\n**What happened** – Researchers developed a new analogue speech recognition system using two special hardware platforms called reconfigurable nonlinear-processing units (RNPUs) and analogue in-memory computing (AIMC). These devices process sound signals directly in hardware at room temperature. They tested the system with datasets of spoken digits and commands, and combined it with simple neural network models to recognize speech. The system used very little power—around a few nanowatts per unit—and achieved high accuracy, about 90% or more.\n\n**Impact** – This work shows that analogue computing can handle complex speech tasks efficiently, using less energy and space than traditional digital methods. The RNPUs mimic how the human ear processes sounds with nonlinear filtering and memory of past inputs. This makes the system faster and more power-efficient, which is important for smart devices like voice assistants that need to work on battery power.\n\n**What's next step** – The researchers plan to improve the hardware further by reducing energy use and increasing speed. They also want to test the technology on more complex speech tasks and real-world devices. Advances in analogue computing components and better design of associated circuits could make this technology ready for everyday use in phones, smart speakers, and other edge devices.\n\n**One-sentence takeaway** – New analogue computing hardware combining RNPUs and AIMC efficiently recognizes speech with high accuracy and very low power, promising faster and smaller smart voice devices in the future.",
      "personality_title_fr": "Une nouvelle technologie de calcul analogique améliore l'efficacité de la reconnaissance vocale",
      "personality_presentation_fr": "**Contexte** – La reconnaissance vocale permet aux appareils de comprendre les mots prononcés. La plupart des systèmes actuels utilisent un calcul numérique, souvent lent et énergivore. Les chercheurs explorent des matériels qui fonctionnent davantage comme le cerveau humain pour améliorer la rapidité et la consommation d'énergie.\n\n**Ce qui s'est passé** – Des chercheurs ont développé un nouveau système de reconnaissance vocale analogique utilisant deux plateformes matérielles spéciales appelées unités de traitement non linéaires reconfigurables (RNPU) et calcul en mémoire analogique (AIMC). Ces dispositifs traitent les signaux sonores directement en matériel, à température ambiante. Ils ont testé le système avec des ensembles de données de chiffres et commandes parlés, combinés à des modèles simples de réseaux neuronaux pour reconnaître la parole. Le système consommait très peu d'énergie – quelques nanowatts par unité – et atteignait une grande précision, environ 90 % ou plus.\n\n**Impact** – Ce travail montre que le calcul analogique peut gérer des tâches complexes de parole efficacement, avec moins d'énergie et d'espace que les méthodes numériques traditionnelles. Les RNPU imitent la manière dont l'oreille humaine traite les sons grâce à un filtrage non linéaire et une mémoire des entrées passées. Cela rend le système plus rapide et plus économe en énergie, ce qui est important pour les appareils intelligents fonctionnant sur batterie.\n\n**Prochaine étape** – Les chercheurs prévoient d'améliorer encore le matériel en réduisant la consommation d'énergie et en augmentant la vitesse. Ils souhaitent aussi tester la technologie sur des tâches vocales plus complexes et dans des appareils réels. Les progrès dans les composants de calcul analogique et la conception des circuits associés pourraient rendre cette technologie prête pour un usage quotidien dans les téléphones, enceintes intelligentes et autres appareils périphériques.\n\n**Résumé en une phrase** – Un nouveau matériel de calcul analogique combinant RNPU et AIMC reconnaît efficacement la parole avec une grande précision et une très faible consommation d'énergie, promettant des appareils vocaux intelligents plus rapides et compacts à l'avenir.",
      "personality_title_es": "Nueva tecnología de computación analógica mejora la eficiencia del reconocimiento de voz",
      "personality_presentation_es": "**Contexto** – La tecnología de reconocimiento de voz ayuda a los dispositivos a entender las palabras habladas. La mayoría de los sistemas actuales usan computación digital, que puede ser lenta y consumir mucha energía. Los científicos buscan nuevos equipos que funcionen más como el cerebro humano para mejorar la velocidad y el consumo energético.\n\n**Qué pasó** – Investigadores desarrollaron un nuevo sistema de reconocimiento de voz analógico usando dos plataformas de hardware especiales llamadas unidades de procesamiento no lineales reconfigurables (RNPU) y computación en memoria analógica (AIMC). Estos dispositivos procesan señales de sonido directamente en hardware a temperatura ambiente. Probaron el sistema con conjuntos de datos de dígitos y comandos hablados, y lo combinaron con modelos simples de redes neuronales para reconocer voz. El sistema usó muy poca energía—alrededor de unos pocos nanovatios por unidad—y alcanzó alta precisión, cerca del 90% o más.\n\n**Impacto** – Este trabajo muestra que la computación analógica puede manejar tareas complejas de voz de manera eficiente, usando menos energía y espacio que los métodos digitales tradicionales. Las RNPU imitan cómo el oído humano procesa sonidos con filtrado no lineal y memoria de entradas pasadas. Esto hace que el sistema sea más rápido y eficiente en energía, importante para dispositivos inteligentes que funcionan con batería.\n\n**Próximo paso** – Los investigadores planean mejorar el hardware reduciendo el consumo energético y aumentando la velocidad. También quieren probar la tecnología en tareas de voz más complejas y en dispositivos reales. Los avances en componentes de computación analógica y mejor diseño de circuitos asociados podrían hacer que esta tecnología esté lista para uso diario en teléfonos, altavoces inteligentes y otros dispositivos de borde.\n\n**Conclusión en una frase** – Un nuevo hardware de computación analógica que combina RNPU y AIMC reconoce voz con alta precisión y muy bajo consumo energético, prometiendo dispositivos inteligentes de voz más rápidos y pequeños en el futuro.",
      "image_url": "public/images/news_image_Analogue-speech-recognition-based-on-physical-comp.png",
      "image_prompt": "A detailed, warm-toned painting of an intricate silicon wafer layered with delicate translucent oxide films, surrounded by softly glowing abstract circuits symbolizing analogue speech signals flowing through nonlinear pathways, with subtle hints of tiny glowing nodes representing dopants and electrodes, all rendered in natural muted colors to evoke advanced physical computing and room-temperature speech recognition technology."
    },
    {
      "title": "Addressing the safety of next-generation batteries",
      "summary": "Nature, Published online: 17 September 2025; doi:10.1038/s41586-025-09358-4Next-generation batteries will present different risks to conventional lithium-ion cells, emphasizing the need for efforts towards characterizing the abuse tolerance and hazards associated with next-generation battery materials over their life cycle and providing the data in the context of supporting affected professionals.",
      "content": "Xu, C. et al. Future material demand for automotive lithium-based batteries. Commun. Mater. 1, 99 (2020).\n\nLi, Z. et al. Revealing the thermal safety of Prussian blue cathode for safer nonaqueous batteries. Adv. Energy Mater. 11, 2101764 (2021).\n\nLee, J., Lee, T., Char, K., Kim, K. J. & Choi, J. W. Issues and advances in scaling up sulfide-based all-solid-state batteries. Acc. Chem. Res. 54, 3390–3402 (2021).\n\nWang, C. et al. All-solid-state lithium batteries enabled by sulfide electrolytes: from fundamental research to practical engineering design. Energy Environ. Sci. 14, 2577–2619 (2021).\n\nDarmet, N., Charbonnel, J., Reytier, M., Broche, L. & Vincent, R. First experimental assessment of all-solid-state battery thermal runaway propagation in a battery pack. ACS Appl. Energy Mater. 7, 4365–4375 (2024).\n\nCharbonnel, J. et al. Preliminary study of all-solid-state batteries: evaluation of blast formation during the thermal runaway. iScience 26, 108078 (2023).\n\nKim, T. et al. Thermal runaway behavior of Li 6 PS 5 Cl solid electrolytes for LiNi 0.8 Co 0.1 Mn 0.1 O 2 and LiFePO 4 in all-solid-state batteries. Chem. Mater. 34, 9159–9171 (2022).\n\nDuh, Y.-S., Theng, J.-H., Chen, C.-C. & Kao, C.-S. Comparative study on thermal runaway of commercial 14500, 18650 and 26650 LiFePO 4 batteries used in electric vehicles. J. Energy Storage 31, 101580 (2020).\n\nZhang, S. et al. Room-temperature, high-voltage solid-state lithium battery with composite solid polymer electrolyte with in-situ thermal safety study. Chem. Eng. J. 400, 125996 (2020).\n\nZeng, Z. et al. A safer sodium-ion battery based on nonflammable organic phosphate electrolyte. Adv. Sci. 3, 1600066 (2016).\n\nGribble, D. A. et al. Mechanistic elucidation of electronically conductive PEDOT:PSS tailored binder for a potassium-ion battery graphite anode: electrochemical, mechanical, and thermal safety aspects. Adv. Energy Mater. 12, 2103439 (2022).\n\nYang, H., Zhuang, G. V. & Ross, P. N. Thermal stability of LiPF 6 salt and Li-ion battery electrolytes containing LiPF 6 . J. Power Sources 161, 573–579 (2006).\n\nWu, Y., Wang, S., Li, H., Chen, L. & Wu, F. Progress in thermal stability of all-solid-state-Li-ion-batteries. InfoMat 3, 827–853 (2021).\n\nWang, J. et al. Advances in thermal-related analysis techniques for solid-state lithium batteries. InfoMat 5, e12401 (2023).\n\nAdams, R. A., Varma, A. & Pol, V. G. Mechanistic elucidation of thermal runaway in potassium-ion batteries. J. Power Sources 375, 131–137 (2018).\n\nCharbonnel, J. et al. Safety evaluation of all-solid-state batteries: an innovative methodology using in situ synchrotron X-ray radiography. ACS Appl. Energy Mater. 5, 10862–10871 (2022).\n\nOhneseit, S. et al. Thermal and mechanical safety assessment of type 21700 lithium-ion batteries with NMC, NCA and LFP cathodes–investigation of cell abuse by means of accelerating rate calorimetry (ARC). Batteries 9, 237 (2023).\n\nBugryniec, P. J. et al. Review of gas emissions from lithium-ion battery thermal runaway failure — considering toxic and flammable compounds. J. Energy Storage 87, 111288 (2024).\n\nLin, L. & Ezekoye, O. A. Time-resolved characterization of toxic and flammable gases during venting of Li-ion cylindrical cells with current interrupt devices. J. Loss Prev. Process Ind. 94, 105488 (2025).\n\nLiu, T., Kum, L. W., Singh, D. K. & Kumar, J. Thermal, electrical, and environmental safeties of sulfide electrolyte-based all-solid-state Li-ion batteries. ACS Omega 8, 12411–12417 (2023).\n\nPark, S. S. et al. Solid electrolyte: strategies to address the safety of all solid-state batteries. Adv. Energy Sustain. Res. 4, 2300074 (2023).\n\nWang, S. et al. Thermal stability between sulfide solid electrolytes and oxide cathode. ACS Nano 16, 16158–16176 (2022).\n\nSun, S. & Xu, J. Safety behaviors and degradation mechanisms of aged batteries: a review. Energy Mater. Devices 2, 9370048 (2024).\n\nYan, P. et al. Intragranular cracking as a critical barrier for high-voltage usage of layer-structured cathode for lithium-ion batteries. Nat. Commun. 8, 14101 (2017).\n\nHeenan, T. M. M. et al. Identifying the origins of microstructural defects such as cracking within Ni-rich NMC811 cathode particles for lithium-ion batteries. Adv. Energy Mater. 10, 2002655 (2020).\n\nSadd, M., Xiong, S., Bowen, J. R., Marone, F. & Matic, A. Investigating microstructure evolution of lithium metal during plating and stripping via operando X-ray tomographic microscopy. Nat. Commun. 14, 854 (2023).\n\nBörner, M. et al. Correlation of aging and thermal stability of commercial 18650-type lithium ion batteries. J. Power Sources 342, 382–392 (2017).\n\nLi, S. et al. Constant-rate heating-induced thermal runaway in 18650-type Li-ion cells charged/discharged at 1 °C: effect of undischargeable Li at anode. J. Power Sources 505, 230082 (2021).\n\nGabryelczyk, A., Ivanov, S., Bund, A. & Lota, G. Corrosion of aluminium current collector in lithium-ion batteries: a review. J. Energy Storage 43, 103226 (2021).\n\nMa, T. et al. Revisiting the corrosion of the aluminum current collector in lithium-ion batteries. J. Phys. Chem. Lett. 8, 1072–1077 (2017).\n\nWaldmann, T. et al. Electrochemical, post-mortem, and ARC analysis of Li-ion cell safety in second-life applications. J. Electrochem. Soc. 164, A3154 (2017). This paper pioneeringly demonstrates that the safety of aged cells is strongly correlated with the dominant ageing mechanism.\n\nPreger, Y., Torres-Castro, L., Rauhala, T. & Jeevarajan, J. Perspective—On the safety of aged lithium-ion batteries. J. Electrochem. Soc. 169, 030507 (2022).\n\nZhang, X., Zhu, J. & Sahraei, E. Degradation of battery separators under charge–discharge cycles. RSC Adv. 7, 56099–56107 (2017).\n\nNing, Z. et al. Visualizing plating-induced cracking in lithium-anode solid-electrolyte cells. Nat. Mater. 20, 1121–1129 (2021).\n\nLiang, Z. et al. Understanding the failure process of sulfide-based all-solid-state lithium batteries via operando nuclear magnetic resonance spectroscopy. Nat. Commun. 14, 259 (2023).\n\nJiang, F.-N. et al. Higher-order polysulfides induced thermal runaway for 1.0 Ah lithium sulfur pouch cells. Particuology 79, 10–17 (2023).\n\nXiang, Y. et al. Advanced separators for lithium‐ion and lithium–sulfur batteries: a review of recent progress. ChemSusChem 9, 3023–3039 (2016).\n\nRoth, E. P., Doughty, D. H. & Pile, D. L. Effects of separator breakdown on abuse response of 18650 Li-ion cells. J. Power Sources 174, 579–583 (2007).\n\nZhao, Q., Stalin, S., Zhao, C.-Z. & Archer, L. A. Designing solid-state electrolytes for safe, energy-dense batteries. Nat. Rev. Mater. 5, 229–252 (2020).\n\nFang, C. et al. Pressure-tailored lithium deposition and dissolution in lithium metal batteries. Nat. Energy 6, 987–994 (2021).\n\nSharifi-Asl, S., Lu, J., Amine, K. & Shahbazian-Yassar, R. Oxygen release degradation in Li-ion battery cathode materials: mechanisms and mitigating approaches. Adv. Energy Mater. 9, 1900551 (2019).\n\nKaur, G. & Gates, B. D. Review—Surface coatings for cathodes in lithium ion batteries: from crystal structures to electrochemical performance. J. Electrochem. Soc. 169, 043504 (2022).\n\nFinegan, D. P. et al. Modelling and experiments to identify high-risk failure scenarios for testing the safety of lithium-ion cells. J. Power Sources 417, 29–41 (2019).\n\nFinegan, D. P. et al. Identifying the cause of rupture of Li-ion batteries during thermal runaway. Adv. Sci. 5, 1700369 (2018).\n\nWalker, W. et al. Decoupling of heat generated from ejected and non-ejected contents of 18650-format lithium-ion cells using statistical methods. J. Power Sources 415, 207–218 (2019).\n\nWalker, W. Q. et al. The effect of cell geometry and trigger method on the risks associated with thermal runaway of lithium-ion batteries. J. Power Sources 524, 230645 (2022).\n\nFinegan, D. P. et al. Characterising thermal runaway within lithium-ion cells by inducing and monitoring internal short circuits. Energy Environ. Sci. 10, 1377–1388 (2017).\n\nFinegan, D. P. et al. In-operando high-speed tomography of lithium-ion batteries during thermal runaway. Nat. Commun. 6, 6924 (2015). To the best of our knowledge, this paper first demonstrated the use of high-speed synchrotron X-ray computed tomography and radiography, combined with thermal imaging, to monitor internal damage and thermal behaviour during thermal runaway in LIBs.\n\nWang, Y. et al. Progress and challenges in ultrasonic technology for state estimation and defect detection of lithium-ion batteries. Energy Storage Mater. 69, 103430 (2024).\n\nMcGee, T. M., Neath, B., Matthews, S., Ezekoye, O. A. & Haberman, M. R. Ultrasonic inspection of lithium-ion pouch cells subjected to localized thermal abuse. J. Power Sources 583, 233542 (2023).\n\nMcGee, T. M., Neath, B., Matthews, S., Ezekoye, O. A. & Haberman, M. R. Ultrasonic detection of pre-existing thermal abuse in lithium-ion pouch cells. J. Power Sources 595, 234035 (2024).\n\nDavies, G. et al. State of charge and state of health estimation using electrochemical acoustic time of flight analysis. J. Electrochem. Soc. 164, A2746–A2755 (2017).\n\nKim, J.-Y., Jo, J.-H. & Byeon, J.-W. Ultrasonic monitoring performance degradation of lithium ion battery. Microelectron. Reliab. 114, 113859 (2020).\n\nRobinson, J. B. et al. Spatially resolved ultrasound diagnostics of Li-ion battery electrodes. Phys. Chem. Chem. Phys. 21, 6354–6361 (2019).\n\nFinegan, D. P. et al. The Battery Failure Databank: insights from an open-access database of thermal runaway behaviors of Li-ion cells and a resource for benchmarking risks. J. Power Sources 597, 234106 (2024). This paper presents a pioneering battery failure database for understanding the variation in commercial cell behaviours during thermal runaway.\n\nMasalkovaitė, K., Gasper, P. & Finegan, D. P. Predicting the heat release variability of Li-ion cells under thermal runaway with few or no calorimetry data. Nat. Commun. 15, 8399 (2024).\n\nBates, A. et al. A multi-scale framework for advancing battery safety through early calorimetric analysis of materials and components. Electrochem. Soc. Interface 33, 69 (2024). This paper presented a new strategy to bridge battery material and component characterization with safety prediction of large-format cells through targeted experiments and validated modelling.\n\nLi, W., Zhu, J., Xia, Y., Gorji, M. B. & Wierzbicki, T. Data-driven safety envelope of lithium-ion batteries for electric vehicles. Joule 3, 2703–2715 (2019). To the best of our knowledge, this paper presents the first demonstration of combining numerical data generation with machine learning to predict the mechanical safety of battery systems for EV applications.\n\nHendricks, C., Williard, N., Mathew, S. & Pecht, M. A failure modes, mechanisms, and effects analysis (FMMEA) of lithium-ion batteries. J. Power Sources 297, 113–120 (2015).\n\nPremnath, V., Wang, Y., Wright, N., Khalek, I. & Uribe, S. Detailed characterization of particle emissions from battery fires. Aerosol Sci. Technol. 56, 337–354 (2022).\n\nFinegan, D. P. et al. Investigating lithium-ion battery materials during overcharge-induced thermal runaway: an operando and multi-scale X-ray CT study. Phys. Chem. Chem. Phys. 18, 30912–30919 (2016).\n\nFranqueville, J. I., Archibald, E. J. & Ezekoye, O. A. Data-driven modeling of downwind toxic gas dispersion in lithium-ion battery failures using computational fluid dynamics. J. Loss Prev. Process Ind. 86, 105201 (2023).\n\nLu, G., Nai, J., Luan, D., Tao, X. & Lou, X. W. Surface engineering toward stable lithium metal anodes. Sci. Adv. 9, eadf1550 (2023).\n\nZhao, C. et al. Polysulfide-incompatible additive suppresses spatial reaction heterogeneity of Li-S batteries. Joule 8, 3397–3411 (2024).\n\nKaur, A. P. et al. Overcharge protection of lithium-ion batteries above 4 V with a perfluorinated phenothiazine derivative. J. Mater. Chem. A 4, 5410–5414 (2016).\n\nTranter, T. G. et al. Probing heterogeneity in Li-ion batteries with coupled multiscale models of electrochemistry and thermal transport using tomographic domains. J. Electrochem. Soc. 167, 110538 (2020).\n\nLiu, K., Liu, Y., Lin, D., Pei, A. & Cui, Y. Materials for lithium-ion battery safety. Sci. Adv. 4, eaas9820 (2018).\n\nHebert, A. & McCalla, E. The role of metal substitutions in the development of Li batteries, part I: cathodes. Mater. Adv. 2, 3474–3518 (2021).\n\nSong, Y. et al. The significance of mitigating crosstalk in lithium-ion batteries: a review. Energy Environ. Sci. 16, 1943–1963 (2023).\n\nHales, A., Marzook, M. W., Bravo Diaz, L., Patel, Y. & Offer, G. The surface cell cooling coefficient: a standard to define heat rejection from lithium ion battery pouch cells. J. Electrochem. Soc. 167, 020524 (2020).\n\nXu, C. et al. A comparative study of the venting gas of lithium-ion batteries during thermal runaway triggered by various methods. Cell Rep. Phys. Sci. 4, 101705 (2023).\n\nPereira, D. J., McRay, H. A., Bopte, S. S. & Jalilvand, G. H 2 O/HF scavenging mechanism in cellulose-based separators for lithium-ion batteries with enhanced cycle life. ACS Appl. Mater. Interfaces 16, 5745–5757 (2024).\n\nOstanek, J. K., Li, W., Mukherjee, P. P., Crompton, K. R. & Hacker, C. Simulating onset and evolution of thermal runaway in Li-ion cells using a coupled thermal and venting model. Appl. Energy 268, 114972 (2020).\n\nYang, S.-J. et al. Oxygen-induced thermal runaway mechanisms of Ah-level solid-state lithium metal pouch cells. eTransportation 18, 100279 (2023). This paper pioneeringly proposes that the dominant exothermic reaction in Ah-level ASSBs may arise from crosstalk between the cathode and the LPSCl solid electrolyte, rather than between the cathode and the lithium metal anode.",
      "url": "https://www.nature.com/articles/s41586-025-09358-4",
      "source": "Nature",
      "published": "2025-09-18",
      "sentiment_score": 0.8,
      "reasoning": "The article discusses significant advances and efforts in understanding and improving the safety of next-generation batteries, particularly lithium-ion and solid-state batteries. This has broad societal impact given the widespread use of batteries in electric vehicles and renewable energy storage, addressing critical safety challenges that affect many people and industries. The article provides substantial context and references pioneering research, indicating a focused and substantive treatment of the topic.",
      "category": "Technology",
      "personality_title": "New research improves safety understanding of next-generation batteries",
      "personality_presentation": "**Context** – Batteries power many devices and electric vehicles today. While lithium-ion batteries are common, new types called next-generation batteries, including solid-state batteries, are being developed to store more energy. These new batteries use different materials that might behave differently, especially in risky situations like overheating.\n\n**What happened** – Scientists have been studying how next-generation batteries behave under stress, such as heat or damage, to better understand their safety risks. Recent research has focused on how these batteries might fail, how dangerous gases or explosions could happen, and how to detect problems early. They have used advanced tools like X-ray imaging and computer models to watch batteries inside as they heat up or break down.\n\n**Impact** – This research helps identify new safety challenges specific to next-generation batteries, which differ from the batteries we use today. Knowing these risks allows engineers and manufacturers to design safer batteries and prevent accidents. Since these batteries will be used in electric cars and energy storage, improving their safety protects people and property.\n\n**What's next step** – Researchers plan to continue testing different battery materials and designs to find safer options. They also want to create better ways to monitor battery health and predict failures before they happen. This work supports making next-generation batteries both more powerful and safer for everyday use.\n\n**One-sentence takeaway** – Scientists are making important progress in understanding and improving the safety of new battery technologies that will power future vehicles and devices.\n",
      "personality_title_fr": "De nouvelles recherches améliorent la sécurité des batteries de nouvelle génération",
      "personality_presentation_fr": "**Contexte** – Les batteries alimentent de nombreux appareils et véhicules électriques aujourd’hui. Bien que les batteries lithium-ion soient courantes, de nouveaux types appelés batteries de nouvelle génération, notamment les batteries à l’état solide, sont développés pour stocker plus d’énergie. Ces nouvelles batteries utilisent des matériaux différents qui peuvent se comporter différemment, surtout dans des situations à risque comme la surchauffe.\n\n**Ce qui s’est passé** – Des scientifiques ont étudié comment les batteries de nouvelle génération réagissent sous stress, comme la chaleur ou les dommages, pour mieux comprendre leurs risques de sécurité. Des recherches récentes se sont concentrées sur la manière dont ces batteries peuvent tomber en panne, comment des gaz dangereux ou des explosions peuvent survenir, et comment détecter les problèmes tôt. Ils ont utilisé des outils avancés comme l’imagerie aux rayons X et des modèles informatiques pour observer les batteries de l’intérieur lorsqu’elles chauffent ou se dégradent.\n\n**Impact** – Ces recherches aident à identifier de nouveaux défis de sécurité propres aux batteries de nouvelle génération, qui diffèrent des batteries actuelles. Connaître ces risques permet aux ingénieurs et fabricants de concevoir des batteries plus sûres et d’éviter des accidents. Puisque ces batteries seront utilisées dans les voitures électriques et le stockage d’énergie, améliorer leur sécurité protège les personnes et les biens.\n\n**Étape suivante** – Les chercheurs prévoient de continuer à tester différents matériaux et conceptions de batteries pour trouver des options plus sûres. Ils veulent aussi créer de meilleurs moyens de surveiller la santé des batteries et de prédire les pannes avant qu’elles ne surviennent. Ce travail soutient la fabrication de batteries de nouvelle génération à la fois plus puissantes et plus sûres pour un usage quotidien.\n\n**Résumé en une phrase** – Les scientifiques progressent dans la compréhension et l’amélioration de la sécurité des nouvelles technologies de batteries qui alimenteront les véhicules et appareils du futur.\n",
      "personality_title_es": "Nuevas investigaciones mejoran la seguridad de las baterías de próxima generación",
      "personality_presentation_es": "**Contexto** – Las baterías alimentan muchos dispositivos y vehículos eléctricos hoy en día. Aunque las baterías de iones de litio son comunes, se están desarrollando nuevos tipos llamados baterías de próxima generación, incluyendo las baterías de estado sólido, que pueden almacenar más energía. Estas nuevas baterías usan materiales diferentes que pueden comportarse distinto, especialmente en situaciones de riesgo como el sobrecalentamiento.\n\n**Qué pasó** – Científicos han estado estudiando cómo se comportan las baterías de próxima generación bajo estrés, como calor o daño, para entender mejor sus riesgos de seguridad. Investigaciones recientes se enfocaron en cómo pueden fallar estas baterías, cómo pueden producir gases peligrosos o explosiones, y cómo detectar problemas temprano. Usaron herramientas avanzadas como imágenes de rayos X y modelos por computadora para observar las baterías internamente mientras se calientan o dañan.\n\n**Impacto** – Esta investigación ayuda a identificar nuevos retos de seguridad específicos de las baterías de próxima generación, que son diferentes a las baterías que usamos hoy. Conocer estos riesgos permite a los ingenieros y fabricantes diseñar baterías más seguras y evitar accidentes. Como estas baterías se usarán en autos eléctricos y almacenamiento de energía, mejorar su seguridad protege a personas y propiedades.\n\n**Próximo paso** – Los investigadores planean seguir probando diferentes materiales y diseños para encontrar opciones más seguras. También quieren crear mejores formas de monitorear la salud de las baterías y predecir fallos antes de que ocurran. Este trabajo apoya que las baterías de próxima generación sean más potentes y seguras para el uso diario.\n\n**Conclusión en una frase** – Los científicos están avanzando en entender y mejorar la seguridad de las nuevas tecnologías de baterías que impulsarán los vehículos y dispositivos del futuro.\n",
      "image_url": "public/images/news_image_Addressing-the-safety-of-next-generation-batteries.png",
      "image_prompt": "A detailed, warm-toned painting of intricately interconnected battery cells glowing softly with gentle light, surrounded by protective layers symbolized as delicate, translucent shields, set against a calm, abstract background that evokes safety and innovation in advanced solid-state battery technology."
    }
  ]
}