{
  "personality": null,
  "timestamp": "2026-01-10T04:47:57.892686",
  "category": "Human Rights",
  "news_summary": "Embracing transgender identity empowers individuals to excel and inspire others through authenticity and leadership.",
  "news_summary_fr": "Accepter son identité transgenre permet aux individus de s'épanouir et d'inspirer les autres grâce à leur authenticité et leur leadership.",
  "news_summary_es": "Aceptar la identidad transgénero empodera a las personas para sobresalir e inspirar a otros a través de la autenticidad y el liderazgo.",
  "articles": [
    {
      "title": "‘Coming out as a transgender scientist made me the best teacher I’ve ever been’",
      "summary": "Nature, Published online: 09 January 2026; doi:10.1038/d41586-026-00057-2Shannon Bros and Kihana Wilson outline how academia can better support LGBTQ+ researchers, launching a podcast series about workplace topics that are often off limits.",
      "content": "Adam Levy 00:00\n\nHello, I’m Adam Levy, and this is Off Limits: academia’s taboos, a podcast from Nature Careers.\n\nIn this episode: coming out.\n\nAcademia can think of itself as an area that can ask the difficult questions.\n\nScience, after all, is all about getting to the bottom of things, seeking an understanding of the world around us in all its complexity.\n\nBut when it comes to the complexity of researchers themselves, academia can often struggle to have the tough conversations.\n\nThis series will look at some of those all-too-often unspoken topics, and we will speak to researchers about what it means to feel that a part of oneself is unwelcome within research.\n\nSpeaker 1 00:55\n\nI didn’t mention it to any colleagues for many years...\n\nSpeaker 2 00:58\n\nReligious scientists do feel like they have to hide their faith often, because very negative public things are often said...\n\nSpeaker 3 01:06\n\nPeople that look like me, we are typically not offered those opportunities in the same way...\n\nAdam Levy 01:12\n\nThis series will look at some of those all-too-often unspoken topics, and we will speak to researchers about what it means to feel a part of oneself is unwelcome within research.\n\nAnd in today’s episode, the first of our series, we’ll be looking at what it means to be LGBTQ+ in academia.\n\nAround the world, people face discrimination and prejudice for their identities. But for many, there can be profound legal consequences too.\n\nThere are 65 countries where LGBTQ+ identities or acts remain illegal, under threat of death penalty in some nations.\n\nIn a moment, we’ll speak with a young researcher who proudly shares her story on social media.\n\nBut first, let me introduce you to Shannon Bros. She’s a professor emerita from San Jose State University department of biological sciences.\n\nSpeaker 4 02:10\n\nDuring her career....\n\nShannon Bros 02:12\n\nI did a very broad range of topics for research, because I allowed my grad students to figure out what they wanted to pursue, and then I would help them do it.\n\nAdam Levy 02:20\n\nAnd during her career, Shannon came out as a trans woman, trans meaning that she was assigned male at birth.\n\nShe started living her life openly as a woman in the 90s.\n\nI wanted to speak to her about her life in academia that followed, as well as her life leading up to this transition. And when she started to understand herself as a woman.\n\nShannon Bros 02:43\n\nI was pretty fairly on I mean, I was pretty young.\n\nBut I didn’t understand why I was so different until I really started talking with other boys a lot.\n\nAnd then I realized I didn’t think the same way they did.\n\nAnd I was really confused. I thought, what’s wrong with me?\n\nAdam Levy 03:02\n\nAnd how long did it take to, I suppose, put a name to that and understand what that difference was?\n\nShannon Bros 03:08\n\nWell, you have to understand at that time in my life there was nobody I had ever heard of that was like me.\n\nAnd so for me, this was completely uncharted territory, and something I could never imagine could ever happen, right, so?\n\nBut I ended up working as a woman secretary when I was relatively young, in between my last year of high school and my first year of college. In 1970 I was, I was working as a female part-time secretary, and I was assaulted and raped, and that affected me dramatically.\n\nAdam Levy 03:44\n\nAnd how did that, what must have been a very traumatic experience, influence your relationship with your gender and your decisions around what to be open with regarding your gender?\n\nShannon Bros 03:54\n\nWell, I mean, for one thing, I realized that I could, I could be killed, and I think subconsciously, that directed me to completely forget what, you know, my issues were.\n\nI still knew I had issues, but I didn’t realize how deep they went until later, when my memories came back.\n\nI am naturally an extrovert and so for me to become a super-introvert was really, you know, it’s kind of what happened. I just withdrew.\n\nYou know, once I knew what was my situation, I didn’t think I could do anything about it, but eventually I realized I didn’t really have a choice.\n\nIt was going to happen one way or the other, whether I wanted to or not. I could just feel it, sort of, like, a pressure building in me.\n\nYou got to understand it. I had a perfect life. I had a fabulous marriage. I had kids. I have always been respected in my department.\n\nThe last thing I wanted to do was transition.\n\nAdam Levy 04:44\n\nAnd you describe it as this pressure building. So was that throughout your academic career, up to this point then that you kind of felt that?\n\nShannon Bros 04:53\n\nYeah, and it kept growing. It was so frustrating, because I felt like I was, I was on a train heading for a cliff, you know.\n\nIt just felt like I was getting this amazing train wreck, and my whole life was going to become untenable.\n\nAdam Levy: 05:07\n\nAnd so what ended up releasing that pressure?\n\nAdam Levy 05:11\n\nWell, finally, I, you know, I just talked with my spouse, and, you know, said what was going on, and that was the end of our marriage.\n\nAnd at that point, and I just went forward, and that was 1997.\n\nAdam Levy 05:24\n\nAnd what did going forward in your academic environment, in your academic life, look like?\n\nShannon Bros 05:30\n\nOkay, so that was really interesting.\n\nSo before I did my transition, I was well respected. I was groomed to be chair and whatnot.\n\nWhen I transitioned, everything stopped. I had a huge friend base by that time. I was confident, you know, what was what I’m doing. Everything collapsed overnight.\n\nAdam Levy 05:50\n\nCan you explain exactly how you ended up coming out in your academic life?\n\nShannon Bros 05:55\n\nOkay, so I was working as a visiting professor at the Moss Landing Marine Labs. I was going to transition at the next year when I came back to my normal university at San Jose State.\n\nAnd that was the plan, to go back in the fall.\n\nSo this was in the spring. And I I needed to let people know what was going on with me. So I sent letters and pictures and tried to explain what was going on with me to everybody.\n\nAnd then I decided I was going to go home as me for the first time. So that was a plan.\n\nWell over the break, spring break, I found when I came back, I couldn’t switch back. And I just, I knew I couldn’t do it.\n\nI just felt like such a phoney standing up there trying to pretend to be a male again.\n\nAnd I finally just said, “Hey, you know,” I said, I told the class, “ Look, I have something to tell you.”\n\nAnd I explained to them what was going on. I said, “ Look, if you want to leave and not come back to this class, fine. If you want to talk to me some more, (this was in grad school).” So I said “We can go over and have a beer, and you can ask me any questions you want.”\n\nAnd much to my great surprise, they all stayed.\n\nAnd that was, that was how I came out.\n\nI came to work as a woman the next day, and that was the end. I never went back.\n\nAdam Levy 07:17\n\nAnd now you mentioned that a lot of aspects of your career kind of crumbles after this point. Where did you go from there? How did you begin to rebuild?\n\nShannon Bros 07:28\n\nWell, you know, you have to understand that this was the loneliest time in my whole life.\n\nI’ve never, ever felt so alone. It was, it was awful. And I had to rebuild every relationship I had. Every single one.\n\nBut I was determined to do it, and I also knew that one of the important things was, is that everyone around me didn’t ask to be transitioned, but they got transitioned when I did, right?\n\nThe person they knew changed. I spent a lot of energy saying, “Don’t worry about pronouns, just get to know me again. See that I’m this pretty much the same person.”\n\nSo I worked really hard at trying to make people comfortable with who I was without, you know, bringing up the fact that they had to have their pronouns right, or whatever. And that turned out to be a good plan.\n\nAdam Levy 08:19\n\nAnd throughout this period of transition and building this acceptance, did you have to deal with issues like, like, negative comments from your peers and other people within your department?\n\nShannon Bros 08:31\n\nOh, yeah, but you know. So I’ll give you the negative ones first.\n\nThere was a person in our department who’d been a former friend, and she wanted to ban me from the bathrooms.\n\nFortunately, the other women in the department stood up for me.\n\nSo the women were really supportive. That was really helpful.\n\nBut eventually everybody tried hard, and it was up to me to make it easier for them.\n\nWhen I did that, then things started to come together again.\n\nAdam Levy 09:03\n\nNow, of course, you’re based in the United States. But a big part of many academic careers is travel. Is that something that has been at all challenging as a trans woman?\n\nShannon Bros 09:14\n\nThe first time I did it was when I went to Australia. It was challenging for me personally, but not otherwise.\n\nI was so afraid that someone was going to find out what I was. I was just, I was just terrified that someone was going to discover I was trans.\n\nJust flying, just being out and, you know, in a completely different country, but all by myself, I was terrified.\n\nI went there. I did. I got to meet some incredible people, and they’re all still good friends.\n\nIt was such an important growth thing for me, because it gave me the experiences to understand that I have courage and I can do things.\n\nSo it was really huge growth for me.\n\nAdam Levy 09:56\n\nNow, how was transitioning from living your life as a man to living your life openly as a woman, shifted how you move through academia and experience, well, experienced sexism?\n\nShannon Bros 10:10\n\nWell, I’ll tell you, it was a shock to me to really to understand how heavily sexism still was. I thought it was pretty good. At first, you know, when I started getting a lot of weird stuff, I thought, “Well, it’s because you’re trans.”\n\nBut the more I talk to other women, the more I realized, “Oh, wait, no, this is not just me. This is everybody.”\n\nAnd you know, I’ll give you an example. When I used to be in department meeting, I would come up with an idea, and everybody would listen.\n\nAfter I transitioned and I did that, it was like I didn’t say anything. And then maybe five minutes later, or even less, one of the guys would come up with the same idea, and everybody would think it was fabulous. That was kind of typical.\n\nThe other thing was about lab space. Women are constantly fighting to get lab space, you know, at least in my university.\n\nBut the guys always got the best spaces. They had better access to equipment, they had better grants. So there was kind of a built-in, like, ”keep you down here” level.\n\nAnd that was really interesting to me. I hadn’t expected that at all.\n\nAdam Levy 11:13\n\nApart from, of course, living your life true to yourself, were there aspects of now living your life as a woman that there were positives, kind of offsetting these negative experiences you’re talking about?\n\nShannon Bros 11:26\n\nAbsolutely, I became the best teacher I’ve ever been. I became a fabulous advisor.\n\nI had, I just I was so lucky to have both visions of both sides of the fence that it made it much easier for me to relate to students, no matter what gender they were.\n\nAnd it helped me see cultures better too, because now I was looking, I was paying attention to, what are the body cues, etc?\n\nAnd so my teaching went so much better after I transitioned.\n\nAdam Levy 11:56\n\nNow, of course, a lot’s happened in the decades since you came out, and trans issues have become increasingly visible and increasingly politicized in the US and worldwide.\n\nIs this feeding into your life as an academic?\n\nShannon Bros 12:12\n\nWell, not so much as an academic right now, because I’m retired, but it’s definitely feeding into my life. I mean, you know, I feel so bad for the young people.\n\nMy daughter’s trans. And I worry about her all the time. So I didn’t want that for my kids. I don’t want that for anybody.\n\nAdam Levy 12:29\n\nWell, on that note, is there anything you’d hope that other cisgender academics would do to help support their trans colleagues?\n\nShannon Bros 12:37\n\nI think the main thing that they could try and do is understand that this individual has got to go through puberty again. So they’re going to be weird at first.\n\nYou know, they’re trying to figure out who they are. They’re going to dress funny, they’re going to talk funny, they’re going to just be weird because they’re learning to be a person all over again.\n\nAnd I think what would have been really helpful for me is having more of the women come in and teach me more about what it was like to be female in our population.\n\nThe guys were pretty (you know, it was really funny) at first, they were really hands off, you know, but then after a while, everybody just knew me as Shannon, and it was fine.\n\nAnd the other thing you have to think about is all of their memories with you are as another gender. And so whenever something comes up from the past, they will use the wrong gender.\n\nSo it’s that dichotomy of remembrance of the past which is real, right, and kind of connecting that with the present, which is also real, but completely different.\n\nSo that’s probably the biggest challenge for anybody, and I think a lot of it goes to the trans person.\n\nAdam Levy 13:49\n\nNow, you mentioned when you were kids, transness wasn’t even a thing. It wasn’t on your radar. As your life continued and as you are out, were you able to build some community with other trans people or other queer people?\n\nShannon Bros 14:07\n\nOh, yeah, because for a long time, I was a token trans person at the university. So yes, I did.\n\nThey would come to me after a while. The only thing that was really funny is that I really didn’t have that much to offer about, you know, because my experiences were back in the, you know, early Pleistocene.\n\nAnd they were, and these young people were like, just like, no, not even really close to what my life was like.\n\nSo I couldn’t help them that way, but what I could help them do was kind of recognize what they needed to do, what their role in this whole thing was.\n\nAdam Levy 14:43\n\nDo you have hopes for academia, not just in terms of how it accepts trans people, but in terms of how it accepts all differences?\n\nShannon Bros 14:52\n\nI am really worried about the future of our universities. The pressures to bend to political will is terrifying to me.\n\nI think we, you know, we’re going to lose a lot of the the way forward to diversity. So, yeah, I’m, I’m really worried about the future of academia.\n\nThe voices that need to be heard are being silenced or persecuted. And so in our country right now, this is a very unsafe place for trans people, and that’s not just academe, but you know, it’s everywhere.\n\nAdam Levy 15:29\n\nShannon Bros there.\n\nAs Shannon mentioned, transitioning expanded her worldview, giving her greater insights into the experiences, not just of differing genders, but of different backgrounds too.\n\nAnd for some researchers who sit at the intersection of several persecuted groups, those experiences are part of everyday life in academia.\n\nThat’s the case for Kihana Wilson, a PhD student in physics at the University of Michigan.\n\nKihana is a Black queer woman in a field that remains disproportionately white and male in the US.\n\nAnd she’s spoken about her experiences extensively online.\n\nFind her by searching for the Astro Stud. But more on that in a second.\n\nWe started off by discussing how and when Kihana decided how out she wanted to be in academia.\n\nKihana Wilson 16:22\n\nI don’t think it was ever a conscious decision that it’s just been me.\n\nAnd that has been very unapologetic about being me and showing up fully as myself in academic spaces.\n\nBut I will say that so it wasn’t until the very beginning of college that I sort of started coming into my masculinity and started realizing that, you know, I’m, I’m a stud, and my gender presentation is more masculine of centre.\n\nAnd quick note, a stud is a, at least in the LGBTQ community, a term for Black, masculine-presenting lesbians.\n\nAdam Levy 17:00\n\nAnd I guess all those parts play a part in your story.\n\nI’m curious whether, as you kind of came into this presentation of yourself, whether you found it challenging or scary in any way, in academia?\n\nKihana Wilson 17:16\n\nCertainly challenging. Being at the intersection of so many historically excluded and underrepresented, marginalized identities definitely made things very challenging.\n\nThere were definitely obstacles. There were a lot of microaggressions, and still are, at times, a lot of, sort of, just systemic barriers.\n\nBecause in a lot of ways, academia isn’t really designed to include an equitable way people like myself.\n\nBlack scholars, Black women scholars, you know, Black queer women scholars, especially who are so visibly non-conforming and sort of outside of the box when it comes to presentation and how you’re supposed to carry yourself, and how you’re supposed to speak in academia, how you’re supposed to dress in academia.\n\nAdam Levy 18:04\n\nYou mentioned a sense of barriers. Have you had specific moments or challenges that have made you feel “Okay, this is a space that isn’t designed for someone like me?”\n\nKihana Wilson 18:16\n\nFor sure, one of the more recurring things is this idea of the invisibility/hypervisibility paradox, where either I’m super hypervisible because, you know, of how I look being a Black woman, one in a space where there aren’t many Black women of any other sort of axis of identity.\n\nAnd on top of that, being such a non-conforming Black woman, people are ready to sort of catch me slipping, or catch me making a mistake, or find an excuse to sort of doubt me.\n\nAnd then the flip side of that is being invisible, so people ignoring me or dismissing my ideas, on top of the fact of being, you know, a Black queer woman in science and physics in particular, is the fact that I come from a low income background.\n\nAnd a lot of these hard sciences, like physics, for instance, there is sort of a set bar that people presume that you should meet just immediately coming in.\n\nAnd usually those standards are set by certain privileges, like access to particular educational resources.\n\nAnd that’s one of the ways that systemically science can be designed to sort of exclude some.\n\nAdam Levy 19:31\n\nNow, I’m also a physicist by training, but for me, moving through my academia as a white man, you know, I had plenty of mentors and role models who I could relate to in many different ways.\n\nWhat does it mean to you to maybe have fewer people who have gone before you, who you can have that relationship with?\n\nKihana Wilson 19:53\n\nSo that’s actually excellent question, and really cuts at the heart of a large part of my own journey in academia, in the sense that I suffered a lot of imposter syndrome and self-doubt at times because I had such severe lack of representation around me.\n\nAnd it really affected, you know, my ability to focus at times, my drive at times. I remember one moment, and in my undergraduate time where I sort of hit a very low point, because I felt just so extremely isolated.\n\nAnd physics is already hard enough without you adding on all these extra things, as I’m sure you know.\n\nAnd so I was just, man I was going through it. And I found myself in a moment of desperation one evening in my dorm room, just like desperately looking up other Black women in physics to see how many people have done this before me who look like me.\n\nAnd it was in that moment that I found the only two other Black women in physics at that time so who were, who were both PhD students when I was in college.\n\nAnd I reached out, and that honestly, really changed my undergraduate experience for the better.\n\nOne of those women is now my best friend to this day, and like I very much admire her and and her experience and her journey. And being introduced to other Black physicists during my college time through her was truly transformative.\n\nCommunity is so, so, so critical for people like me in these spaces.\n\nAdam Levy 21:35\n\nI’m curious whether beyond this community that you had to go out and find for yourself, these were topics that you were able to speak about with other colleagues, or with your institutions?\n\nKihana Wilson 21:46\n\nI don’t think, at least at that time, I really had these conversations, because I just felt so isolated.\n\nI think nowadays I’m not at all afraid to sort of bring up these conversations in places where, you know, I might be the only one in the room.\n\nBecause I know that background and that experience is very powerful, and it’s it’s important to bring up in these spaces, especially in spaces that claim to want to be better about these things and to support its more marginalized students.\n\nAnd I think it’s also important for other people to be aware of that if they’re part of a majority, their experience is not the same for other people.\n\nThere may be other people who may be dealing with other things.\n\nAdam Levy 22:28\n\nAnd when you do speak out in spaces like that, what kind of reaction do you get? Is it ever challenging? Is there of any kind of pushback?\n\nKihana Wilson 22:37\n\nThere can be. So people can definitely get defensive and try to shut you down. Other times, people can be open to hearing other people’s experiences and acknowledging ways that they could help make the space better.\n\nAdam Levy 22:50\n\nNow, while we’re talking about you being outspoken, you’ve, I mean, really, taken that a step further by discussing your relationship with academia really actively online.\n\nYour Astro Stud online for people who want to give you a follow.\n\nBut what’s it meant to you to do this?\n\nKihana Wilson 23:08\n\nYeah, so the idea of the Astro Stud was really born from the same place, honestly, of needing community.\n\nMy mission and my ethos in that is just unapologetic representation and using representation as a starting point for increasing, sort of, the accessibility of these scientific spaces to people who can relate, in some way, to any aspect of my identity.\n\nAnd since I have many there are a lot of people who can relate. I wanted to set out to sort of inspire people and uplift people, specifically targeting, you know, Black people, Black women, Black queer people.\n\nAnd through that, I’ve found that I’ve inspired so many more people that I could have ever imagined. And it’s been, it’s been a great journey to ride along.\n\nAdam Levy 23:57\n\nYou speak about it so positively. I’m curious, because academia can be quite a, I suppose, conventional, tight arena.\n\nI’m curious whether any other academics or people on Instagram feel like this isn’t how an academic should be speaking about academia, and in some way, reject it for those kinds of reasons.\n\nKihana Wilson 24:17\n\nSince the very day that I started I’ve received a lot of sort of online abuse and hate from strangers, random people, and also people in academia who don’t believe science communication is a worthwhile thing for academics to pursue, or that it somehow lessens you as an academic.\n\nI’ll also say that in some academic environments they do appreciate and value the sort of outreach.\n\nAnd it’s sort of those environments that I’ve sought out for myself. I try to avoid the very, you know, old guard, stuffy physics environments.\n\nAdam Levy 24:54\n\nI’m curious whether the way you move through both the academic space and the online space has changed at all with the second election of Donald Trump.\n\nKihana Wilson 25:06\n\nSo I think what I’ve come to is that I think it’s more important now than ever to continue doing what I’m doing and continue showing up the way that I’m showing up, because my very existence and the existence of many people who can relate to me are, you know, now at risk.\n\nAnd I don’t at all intend to sort of retreat away from that and make myself small or silence myself, especially since such a large part of my science communication effort is to encourage others to be unapologetic about themselves and to not make themselves small or silent.\n\nFor those of us for whom it’s more or less safe or our safety isn’t threatened, I think it’s paramount in this time for us to continue showing up as we do.\n\nAdam Levy 25:57\n\nWhat’s your hope, then, for academia as a whole, or perhaps specifically for physics?\n\nKihana Wilson 26:03\n\nMy hope is that the way that we think about how science and academia should be organized, the ideas we have about who are true scientists and how scientists should look and fit into academic spaces, evolves and expands such that people who may otherwise have an interest aren’t turned away because of all of these invisible barriers.\n\nAnd I also hope that those of us who are here already and doing the work already in these spaces, that they actually listen to us, they actually take in what we’re saying and what we’re trying to do.\n\nAnd another gripe I guess I have about these spaces is how elitist they can be. And I think it’s very old-fashioned, and I don’t think in many respects it’s necessary to do good science.\n\nAdam Levy 27:00\n\nDo you have any thoughts on what academics who are listening can do to help dismantle those kinds of invisible barriers that you’ve mentioned?\n\nKihana Wilson 27:09\n\nIt takes being very perceptive and actually taking in community feedback. If you look around at your community and there’s an obvious issue of diversity, well, that’s one place to start.\n\nWhat sort of systems or standard policies, but unspoken things, exist in your spaces that would make it feel unwelcome to certain groups of people? And what can you do to alleviate that?\n\nAnd if you have people from marginalized backgrounds in your spaces already, what can you ask of them about their experiences within your space, in your institution or your department that would make it more welcoming but also more safe for them to thrive in that space, and therefore potentially invite more diversity within that space.\n\nAnd when you ask them, the next step is to actually, right, listen and put into place systems or policies that would improve your department or your institution in some concrete, measurable way.\n\nWe’re scientists, right? It’s, it’s not hard for us to measure the effects of things, or see whether something is working or not, and come up with a potential different solution.\n\nAdam Levy 28:35\n\nThat was Kihana Wilson. And this theme of searching for new, meaningful ways to arrange academia is one we’re going to encounter time and time again throughout this series, albeit in widely different forms.\n\nNext week, for example, we’re taking a look at the sharp line that is often drawn between academic research and activism.\n\nSpeaker 6 28:57\n\nLike I didn’t know, will I be safe on campus is it’s like, what? What does that mean? Now? What will the students think?\n\nAdam Levy 29:07\n\nUntil then, this has been Off limits: academia’s taboos, a podcast from Nature Careers.\n\nThanks for listening. I’m Adam Levy.",
      "url": "https://www.nature.com/articles/d41586-026-00057-2",
      "source": "Nature",
      "published": "2026-01-10",
      "sentiment_score": 0.85,
      "reasoning": "The article highlights the inspiring personal journey of a transgender scientist who came out and became a better teacher, while also addressing systemic challenges faced by LGBTQ+ and marginalized researchers in academia. It promotes awareness, inclusion, and actionable advice for improving academic environments, which has broad societal significance for equality and human rights.",
      "category": "Human Rights",
      "personality_title": "Transgender scientist’s journey reshapes teaching and sparks change in academia",
      "personality_presentation": "**Context** – Many researchers in universities face challenges because of who they are, especially those who are LGBTQ+ or come from groups that are often overlooked. Talking openly about these issues in science and education has been difficult.\n\n**What happened** – Shannon Bros, a scientist who transitioned to live openly as a transgender woman, shared her story in a podcast by Nature Careers. She explained how coming out changed her life and career. Despite initial struggles, including losing friends and facing unfair treatment, she became a more understanding and effective teacher. Another researcher, Kihana Wilson, a Black queer woman in physics, also spoke about the challenges and importance of being visible and supported in her field.\n\n**Impact** – Shannon’s story shows how living true to oneself can improve personal and professional life, especially in teaching. Both Shannon and Kihana highlight how universities often make it hard for people who don’t fit traditional molds to succeed, but finding community and support can make a big difference. Their experiences help us see what changes are needed to make science and education fairer and more welcoming.\n\n**What’s next step** – The podcast series plans to continue exploring topics that are often avoided in academia, encouraging more honest conversations. Researchers and institutions are urged to listen to marginalized voices and create real policies that support diversity. This could lead to more inclusive environments where all students and scientists can thrive.\n\n**One-sentence takeaway** – Sharing personal journeys like Shannon’s and Kihana’s helps universities understand and remove barriers, making science a place where everyone can succeed.\n\n",
      "personality_title_fr": "Le parcours d’une scientifique transgenre transforme son enseignement et inspire le changement en milieu universitaire",
      "personality_presentation_fr": "**Contexte** – De nombreux chercheurs dans les universités rencontrent des difficultés liées à leur identité, notamment ceux qui sont LGBTQ+ ou issus de groupes souvent marginalisés. Aborder ouvertement ces sujets dans la science et l’éducation reste compliqué.\n\n**Ce qui s’est passé** – Shannon Bros, scientifique ayant fait sa transition pour vivre ouvertement en tant que femme transgenre, a partagé son histoire dans un podcast de Nature Careers. Elle a raconté comment son coming out a changé sa vie et sa carrière. Malgré des difficultés initiales, comme la perte d’amitiés et des traitements injustes, elle est devenue une enseignante plus compréhensive et efficace. Une autre chercheuse, Kihana Wilson, femme noire queer en physique, a également parlé des défis et de l’importance d’être visible et soutenue dans son domaine.\n\n**Impact** – L’histoire de Shannon montre qu’être fidèle à soi-même peut améliorer la vie personnelle et professionnelle, surtout dans l’enseignement. Shannon et Kihana soulignent que les universités rendent souvent difficile la réussite des personnes qui ne correspondent pas aux modèles traditionnels, mais que trouver une communauté et du soutien fait une grande différence. Leurs expériences montrent les changements nécessaires pour rendre la science et l’éducation plus justes et accueillantes.\n\n**Prochaine étape** – La série de podcasts continuera à explorer des sujets souvent évités en milieu universitaire, encourageant des conversations plus honnêtes. Les chercheurs et institutions sont invités à écouter les voix marginalisées et à mettre en place des politiques concrètes pour soutenir la diversité. Cela pourrait conduire à des environnements plus inclusifs où tous les étudiants et scientifiques peuvent s’épanouir.\n\n**Résumé en une phrase** – Partager des parcours personnels comme ceux de Shannon et Kihana aide les universités à comprendre et à lever les obstacles, faisant de la science un lieu où chacun peut réussir.\n\n",
      "personality_title_es": "La trayectoria de una científica transgénero mejora su enseñanza e impulsa cambios en la academia",
      "personality_presentation_es": "**Contexto** – Muchos investigadores en las universidades enfrentan dificultades debido a quiénes son, especialmente aquellos que son LGBTQ+ o pertenecen a grupos frecuentemente ignorados. Hablar abiertamente sobre estos temas en la ciencia y la educación ha sido complicado.\n\n**Qué pasó** – Shannon Bros, una científica que hizo su transición para vivir abiertamente como mujer transgénero, compartió su historia en un podcast de Nature Careers. Explicó cómo salir del armario cambió su vida y carrera. A pesar de las dificultades iniciales, como perder amistades y enfrentar trato injusto, se convirtió en una profesora más comprensiva y eficaz. Otra investigadora, Kihana Wilson, una mujer negra queer en física, también habló sobre los retos y la importancia de ser visible y apoyada en su campo.\n\n**Impacto** – La historia de Shannon muestra que vivir fiel a uno mismo puede mejorar la vida personal y profesional, especialmente en la enseñanza. Tanto Shannon como Kihana destacan cómo las universidades a menudo dificultan que personas que no encajan en moldes tradicionales tengan éxito, pero encontrar comunidad y apoyo puede marcar una gran diferencia. Sus experiencias ayudan a entender qué cambios se necesitan para hacer la ciencia y la educación más justas y acogedoras.\n\n**Qué sigue** – La serie de podcasts planea seguir explorando temas que a menudo se evitan en la academia, fomentando conversaciones más honestas. Se insta a investigadores e instituciones a escuchar a las voces marginadas y crear políticas reales que apoyen la diversidad. Esto podría llevar a ambientes más inclusivos donde todos los estudiantes y científicos puedan prosperar.\n\n**Conclusión en una frase** – Compartir historias personales como las de Shannon y Kihana ayuda a las universidades a entender y eliminar barreras, haciendo de la ciencia un lugar donde todos pueden tener éxito.\n\n",
      "image_url": "public/images/news_image_Coming-out-as-a-transgender-scientist-made-me-the-.png",
      "image_prompt": "A warm, detailed painting of an open, radiant laboratory space symbolized by a sturdy wooden desk with scattered scientific tools and open books, bathed in soft natural light; beside it, two intertwined, gently glowing threads—one blue and one pink—representing a transgender journey, weave through the scene, while in the background, a diverse constellation of abstract shapes and colors subtly forms a supportive, inclusive academic community embracing difference and growth."
    }
  ]
}