{
  "personality": null,
  "timestamp": "2026-01-01T05:00:40.171332",
  "category": "Technology",
  "news_summary": "Recent advancements showcase breakthroughs in quantum computing applications, innovative enzyme-mimicking materials, and highly efficient layered perovskite LEDs, highlighting significant progress in quantum technology, chemistry, and optoelectronics.",
  "news_summary_fr": "Les avancées récentes présentent des percées dans les applications de l'informatique quantique, des matériaux innovants imitant les enzymes et des LED à pérovskite en couches très efficaces, mettant en évidence les progrès significatifs de la technologie quantique, de la chimie et de l'optoélectronique.",
  "news_summary_es": "Los últimos avances muestran grandes progresos en aplicaciones de computación cuántica, materiales innovadores que imitan a las enzimas y LED de perovskita estratificada de gran eficacia, lo que pone de relieve los notables avances en tecnología cuántica, química y optoelectrónica.",
  "articles": [
    {
      "title": "A chiral fermionic valve driven by quantum geometry",
      "summary": "Nature, Published online: 31 December 2025; doi:10.1038/s41586-025-09864-5Fermionic currents of opposing chirality can be spatially filtered without the need for a magnetic field using the quantum geometry of topological bands in single-crystal PdGa.",
      "content": "Device preparation and electrical measurements\n\nThe procedure for device fabrication from PdGa crystal using Ga-ion-based focused-ion beam technique is as follows32. A lamella was milled out of the bulk crystal. Then the lamella was transferred in situ to the TEM grid for polishing till the desired thickness is achieved. The thickness of the lamella used to make devices in our study ranges from 1 μm to 4 μm. Then the lamella was microstructured into desired three-arm geometry on the TEM grid. Then the microstructured lamella was transferred in situ onto the SiO 2 substrate with prepatterned Au contact pads. The electrical contacts between the lamella and the contact pads were made by sputtering Ti–Au bilayers. Then the etching step was carried out to remove shorting between the electrical contacts. During the device preparation procedure, special care was taken to reduce the surface damage. For example, the transport channel in the device was never scanned with the Ga ion beam after the fine polishing step. However, surface damage of few tens of nanometres may still exists even after several fine polishing steps. Therefore, a dry etching step using low-energy Ar ion was performed to further reduce the thickness of this amorphous layer before the deposition of Ti–Au to make electrical contacts. The effect of surface damage on transport measurements was also studied by purposefully damaging the sample surface with the ion beam. The comparison of results before and after ion-irradiation were compared to study the influence of the amorphous layer on transport. As also observed in previous studies, the increase of the amorphous layer thickness did not negatively influence the transport response through topological states33.\n\nThe electrical measurements were primarily performed in a Bluefors LD−400 dilution refrigerator. Meanwhile, experimental data in Fig. 4 with the applied magnetic field of 2 T were measured in a PPMS DynaCool cryostat. The electrical measurements were carried out using Zurich Instruments lock-in amplifiers (MFLI) at 7.919 Hz and 13.333 Hz reference frequencies. The oscillator voltage amplitude was varied to sweep the applied current through the device (with a buffer resistance in series). The higher harmonic voltage responses from devices were simultaneously measured with the multi-demodulator option provided in an MFLI. Each demodulator produces two output signals: one corresponding to the in-phase component (X) and the other to the quadrature component (Y) relative to the reference signal. Special considerations were taken to increase the signal-to-noise ratio, such as using high-frequency electronic filters and avoiding ground loops. The magnetic field orientation was swept using a three-axis superconducting magnet from American Magnetics in a Bluefors refrigerator (Fig. 4b(ii)). An out-of-plane rotator puck was used in the PPMS case, in which the rotation axis is along the applied current under the magnetic field of 2 T (Fig. 4b(i),c). Two different configurations of electrode contacts with the electrical transport channel in a device were studied. It was observed that the measured third-order voltage responses were more prominent when the Ti–Au connected the top surface of the channel with the electrical contacts. The enhanced third-order response made it possible to measure the B θ dependence of the third-order response, as shown in Fig. 4b(ii),c(ii).\n\nWe have measured 23 devices fabricated in different geometries and crystal orientations. The five focal crystal orientations are presented in Extended Data Table 1. We can define four working states of the valve, depending on the relative magnitude of the chiral currents in the two arms. We have quantified the position of the valve using the term \\(\\phi ={\\tan }^{-1}\\frac{{{\\bf{V}}}_{3\\omega }^{{\\rm{R}}}}{{{\\bf{V}}}_{3\\omega }^{\\Gamma }}\\), as shown in Extended Data Fig. 1. ϕ = 45° represents ‘valve on’ state, when there are equal magnitudes of the NLH currents from the Γ and R Fermi pockets in the right and left arms, respectively. ϕ = 0° represents ‘IΓ on’ state and ϕ =90° represents ‘IR on’ state, where NLH current in the right arm is predominantly generated due the Γ Fermi pocket and that in the left arm is predominantly generated due the R Fermi pocket. Finally, the ‘valve off’ state, in which chiral current generation is suppressed in both arms. We made four devices in a three-arm geometry near to the ‘valve on’ position. All four devices show the same experimental features discussed in the paper, namely, the appearance of distinct NLH responses of similar magnitude in different arms after the current threshold and their distinct symmetries of first-order responses with magnetic field orientations, as discussed in Fig. 3b(i),c(i). The absolute value of the nonlinear response varied with the dimensions of the device, as given in the Extended Data Table 2. The modulations of the third-order responses discussed with Fig. 3b(ii),c(ii) were observed in two of these devices. A good signal-to-noise ratio is needed to measure the nonlinear responses in the presence of the magnetic field, which we posit is a limiting factor in our PPMS system. We made three Mach–Zehnder interferometer (MZI) devices with a ‘valve on’ crystallographic position. All three showed oscillations in third-order response with applied current and magnetic field, as discussed in Fig. 5. The interference visibility ϑ for the MZI with ϕ = 49.4° and 38.6° were 0.86 ± 0.06 and 0.69 ± 0.1, respectively. ϑ was calculated using the relation \\(\\frac{{V}_{3\\omega }^{\\mathrm{amp}}-{V}_{3\\omega }^{\\mathrm{avg}}}{{V}_{3\\omega }^{\\mathrm{amp}}+{V}_{3\\omega }^{\\mathrm{avg}}}\\), where \\({V}_{3\\omega }^{\\mathrm{amp}}\\) is the distance between the peak and crest of the oscillation, which is calculated using \\(|{V}_{3\\omega }^{\\max }-{V}_{3\\omega }^{\\min }|\\) and \\({V}_{3\\omega }^{\\mathrm{avg}}\\) is the mean offset of the oscillation given by \\(|\\frac{{V}_{3\\omega }^{\\max }+{V}_{3\\omega }^{\\min }}{2}|\\). \\({V}_{3\\omega }^{\\max }\\) and \\({V}_{3\\omega }^{\\min }\\) are the minimum and maximum values of the V 3ω signal. We also found that ϑ was sensitive to the electronic properties of the conduction channel sidewall. The value of ϑ increased when the sidewall opposite to the voltage probe is not electrostatically screened by a presence of another electrode.\n\nPassive and active control of the chiral fermionic valve\n\nThe chiral currents generated in the two arms of the device depend on the magnitudes of \\(\\Delta {{\\boldsymbol{\\Omega }}}_{\\varepsilon }^{\\Gamma }\\) and \\(\\Delta {{\\boldsymbol{\\Omega }}}_{\\varepsilon }^{{\\rm{R}}}\\), as given in equation (1). We can control the relative projection of \\(\\Delta {{\\boldsymbol{\\Omega }}}_{\\varepsilon }^{\\Gamma }\\) and \\(\\Delta {{\\boldsymbol{\\Omega }}}_{\\varepsilon }^{{\\rm{R}}}\\) along y, using the distinct symmetry of the Fermi pockets at the Γ and R points. Although the symmetry of a crystal is defined by its space group, the symmetry of a Fermi pocket is determined by the local symmetry of the band structure at a given k-point47. Therefore, Fermi pockets at the Γ and R points can locally exhibit distinct mirror-like symmetry \\({{\\mathcal{M}}}^{* }\\), which maps \\(({k}_{x},{k}_{y},{k}_{z})\\,\\longrightarrow \\,({k}_{x},{-k}_{y},{k}_{z})\\) (refs. 38,47). The projection of the net OAM along the y-axis is zero if a \\({{\\mathcal{M}}}^{* }\\) exists along the xz-plane. \\({{\\mathcal{M}}}^{* }\\) can selectively exist for only one of the Fermi pockets at Γ or R depending on the crystallographic direction of applied current. For example, when the current passes along [100] (z-axis) and the NLH-induced chiral current is collected along [010] (x-axis), \\({{\\mathcal{M}}}^{* }\\) exists along the xz-plane for the Fermi pocket at Γ, whereas it is broken for the Fermi pocket at R. Thus, the OAM contribution from topological bands at R would predominantly exist along the y-axis. Extended Data Fig. 2a(i),(ii) shows the third-order and second-order responses in each arm in a device fabricated in the mentioned crystallographic directions. We can observe that the chiral current is primarily generated in the left arm of the device. It represents the valve in the ‘IR on’ state because the chiral current in the left arm preferentially exists in the Fermi pocket at R. The opposite is true when current is passed along the [100] (z-axis) and chiral current is collected along the [011] (x-axis). In this case, the OAM contribution from the topological bands at Γ would predominantly exist. Extended Data Fig. 2b(i),(ii) shows the nonlinear responses measured in a device made along these crystal directions. In this case, nonlinear currents are predominantly generated in the right arm of the device, thus representing the valve in the ‘IΓ on’ position. Finally, Extended Data Fig. 2c(i),(ii) shows the nonlinear responses in a device in the ‘valve off’ states where the generation of chiral current is suppressed in both arms. In this case, the current is passed along [011] and NLH currents were collected along [100]. We call this strategy to control the valve position ‘passive’ because the valve tunability is linked with the intrinsic quantum geometry of the topological bands rather than the experimentally controlled parameter.\n\nWe now discuss a proof-of-concept study to achieve active tunability of the valve. As discussed in the main text, the chiral fermionic current exists due to the preferential occupation of the R Fermi pocket in the left arm and Γ Fermi pocket in the right arm of the device. Thus, the magnitude of chiral currents can be controlled by tuning the occupational imbalance between two Fermi pockets. We fabricated a magnetic tunnel junction (MTJ) with in-plane magnetization on top of individual arms to locally probe the influence of the magnetic field on chiral currents. We developed a new fabrication technique to ensure the surface of the lamella is at a similar height to the substrate. Our strategy prevents any sudden height changes to ensure smooth deposition of the MTJ. Extended Data Fig. 3a shows the false-coloured SEM image of the prepared device with MTJ electrodes deposited on top of the left and right arms. The lamella was prepared in the ‘valve on’ position. In the first set of experiments, we studied the effects of the magnetization direction of the MTJ on the chiral current of both arms. M x and M z represent directions when the magnetization of MTJ is perpendicular and parallel to the current-induced orbital magnetization. Extended Data Fig. 3b(i),(ii) show the V 3ω responses at 77.77 Hz in the left and right arms, respectively, with M x and M z magnetizations. We can observe from Extended Data Fig. 3b that the chiral current has the same order of magnitude in the left and right arms for the M x orientation. However, the nonlinear response of the right arm switches sign when the MTJ magnetization was switched from M x to M z ; meanwhile, the V 3ω response in the left arm remains similar. Notably, these measurements were performed in the absence of an external magnetic field. The magnetic field was only used to switch the magnetization direction of the MTJ. Extended Data Fig. 3b shows a possible strategy to tune the valve state from ‘valve on’ to ‘IR on’, based on a MTJ magnetization switching mechanism. In the second experiment, we varied the frequency of the applied current to study the interaction of the chiral current with the magnetization of MTJ by measuring the inductive impedance. Extended Data Fig. 3c shows the dependence of V 3ω responses at different frequencies of the applied current with the MTJ in the M x configuration. We note from Extended Data Fig. 3b(ii),c(ii) that the impedance response of IΓ is not significantly changed when the frequency is varied between 77.77 Hz and 47 Hz, whereas the impedance response of IR is reduced by half. From Extended Data Fig. 3c(i), we see that the magnitude of IR is further reduced by an order of magnitude upon going to the frequency of 23 Hz. Meanwhile, the IΓ response, although diminished, has the same sign and the order of magnitude. Through Extended Data Fig. 3c, we show that the valve can be tuned from ‘valve on’ position to ‘IΓ on’ position by changing the frequency of the applied current from 77.77 Hz to 23 Hz with the MTJ in the M x configuration. Through these two experiments, we provide a first step to pursue active tunability of the chiral fermionic valve by its integration with an MTJ. However, a deeper understanding of the interaction between the chiral current and the magnetization dynamics is needed to further analyse these results. Also, a systematic study is crucial to analyse the switching reproducibility, fidelity and scalability of the MTJ-integrated device, which presents an important direction for future work.\n\nQuantum Interference below threshold current\n\nWe have shown the appearance of the V 3ω responses after a certain current threshold in Fig. 2. Meanwhile, Fig. 5b shows clear oscillations of V 3ω with applied current even below the threshold current. As shown in Extended Data Fig. 4a, we could also observe weak V 3ω oscillation response below the threshold current in the three-arm geometry as well. The subsequent question is that why does the interference occur even below the threshold current. We can explain the observed phenomenon using the schematic shown in Extended Data Fig. 4b. We discussed in the main text that the fermions in different Fermi pockets gain a transverse velocity due to the presence of \\(\\Delta {{\\boldsymbol{\\Omega }}}_{\\varepsilon }^{\\Gamma ,{\\rm{R}}}\\). Equation (1) shows the magnitude of the current going into different arms of the device from different Fermi pockets is proportional to \\(\\Delta {{\\boldsymbol{\\Omega }}}_{\\varepsilon }^{\\Gamma ,{\\rm{R}}}\\). The appearance of a nonlinear response after the current threshold suggests that \\(\\Delta {{\\boldsymbol{\\Omega }}}_{\\varepsilon }^{\\Gamma ,{\\rm{R}}}\\) is non-zero only above it. However, \\({{\\boldsymbol{\\Omega }}}_{\\varepsilon }^{\\Gamma ,{\\rm{R}}}\\) does exist on individual topological Fermi pockets even when \\(\\Delta {{\\boldsymbol{\\Omega }}}_{\\varepsilon }^{\\Gamma ,{\\rm{R}}}\\) is zero. The presence of \\({{\\boldsymbol{\\Omega }}}_{\\varepsilon }^{\\Gamma ,{\\rm{R}}}\\) causes the fermions to contribute to the scattering equally in both arms of the device from both of the Fermi pockets. Therefore, the chiral current in each of the arms would not be preferentially carried by one of the Fermi pockets. However, the chiral currents in both of the arms do exist. But, the nonlinear responses of current with opposite chirality cancel out below the threshold current. \\(\\Delta {{\\boldsymbol{\\Omega }}}_{\\varepsilon }^{\\Gamma ,{\\rm{R}}}\\) becomes non-zero above the threshold current. Thereby, the fermions from the Fermi pockets at Γ and R, are preferentially scattered into the right and left arms, respectively. This creates an occupational imbalance in these arms, which leads to the observation of the chiral current response from the individual Fermi pockets. The presence of chiral current in both scenarios makes it possible to observe the quantum interference of the chiral current even below the threshold current.\n\nTheoretical considerations for the NLH effect\n\nWe use the semi-classical Boltzmann formalism to derive the nonlinear responses. However, it is crucial first to discuss the limitations of the assumptions taken to derive these transport equations. The semi-classical Boltzmann approach considers electrons as an adiabatic Bloch wavepacket moving in a static band structure. We have shown with Figs. 2 and 3 that the nonlinear transport responses appear only above a certain current threshold. Therefore, the conventional Boltzmann approach cannot capture the electric field-induced transitions due to the non-equilibrium bands associated metric. Second, the formalism assumes a single distribution function per band, effectively treating all carriers as coming from a single Fermi surface. However, we have shown chirality-selective transport due to the imbalance in the occupation of two different Fermi pockets with opposite Chern numbers. These currents of different chirality may have different scattering and relaxation dynamics, which must be incorporated in the transport equations. Moreover, the assumption of a localized and non-interacting Bloch wavepacket used in the Boltzmann formalism cannot be used to accurately describe the phase-coherent transport of multifold fermions. Nevertheless, we have found that the Boltzmann formalism is very useful to qualitatively describe our experimental results.\n\nThe current density J x flowing into the outer arms of the device along x, as shown in the schematic of Fig. 1c, is given by\n\n$${{\\bf{J}}}_{x}=-{\\rm{e}}{\\int }_{{\\bf{k}}}fD{{\\bf{v}}}_{x}$$ (2)\n\nwith \\({\\int }_{{\\bf{k}}}x\\equiv \\int \\frac{{{\\rm{d}}}^{3}{\\bf{k}}}{{(2{\\rm{\\pi }})}^{3}}\\) and f is the non-equilibrium distribution function, v x is the velocity of an electron wavepacket along x and D is the modified density of states, given as\n\n$$D=1+\\frac{e}{\\hbar }{\\bf{B}}\\cdot {\\boldsymbol{\\Omega }}$$ (3)\n\nIn the case of B = 0, the motion of electron wavepacket is given by the equation\n\n$${{\\bf{v}}}_{x}=\\frac{1}{\\hbar }\\frac{\\partial {\\epsilon }(k)}{\\partial {\\bf{k}}}+\\frac{e}{\\hbar }\\boldsymbol{\\mathcal{E}}\\times {\\boldsymbol{\\Omega }}$$ (4)\n\nwhere \\({\\epsilon }(k)\\) is the energy dispersion relation. The first term is the group velocity, whereas the second term is the anomalous velocity. As described in the main text, we purposefully applied \\({\\boldsymbol{\\mathcal{E}}}_{z}\\) along the principal axes of PdGa to minimize the Ohmic contribution of \\({\\boldsymbol{\\mathcal{E}}}_{z}\\) along x. Thus, the group velocity along x due to \\({\\boldsymbol{\\mathcal{E}}}_{z}\\) would be close to zero. Thus incorporating \\({{\\bf{v}}}_{x}\\) in equation (2) gives\n\n$${{\\bf{J}}}_{x}=-\\frac{{e}^{2}}{\\hbar }{\\int }_{{\\bf{k}}}f({\\boldsymbol{\\mathcal{E}}}_{z}{{\\boldsymbol{\\Omega }}}_{y})$$ (5)\n\nIn the relaxation time approximation, the non-equilibrium distribution function with a first-order correction is given by\n\n$$f={f}^{0}+{f}^{(1)}={f}^{0}+\\frac{e\\tau {\\boldsymbol{\\mathcal{E}}}_{z}}{1-i\\omega \\tau }\\frac{\\partial {f}^{0}}{\\partial {\\bf{k}}}$$ (6)\n\nwhere \\({f}^{0}\\) is the Fermi–Dirac equation, \\(\\tau \\) is the intranode scattering and \\(\\omega \\) is the frequency of the applied a.c. electrical signal \\({\\boldsymbol{\\mathcal{E}}}_{z}\\)(= E 0 sin(ωt)). On substituting equation (6) in equation (5), the current density J x can be written as the sum of first-order and second-order electric-field terms \\({{\\bf{J}}}_{x}^{(1)}\\) and \\({{\\bf{J}}}_{x}^{(2)}\\) as\n\n$${{\\bf{J}}}_{x}^{(1)}=-\\frac{{e}^{2}}{\\hbar }{\\int }_{{\\bf{k}}}{f}^{0}{{\\boldsymbol{\\Omega }}}_{y}{\\boldsymbol{\\mathcal{E}}}_{z}$$ (7)\n\n$${{\\bf{J}}}_{x}^{(2)}=-\\frac{\\tau {e}^{3}}{\\hbar (1-{\\rm{i}}\\omega \\tau )}{\\int }_{{\\bf{k}}}\\frac{\\partial {f}^{0}}{\\partial {\\bf{k}}}{{\\boldsymbol{\\Omega }}}_{y}{\\boldsymbol{\\mathcal{E}}}_{z}^{2}\\,\\propto \\,{\\int }_{{\\bf{k}}}{f}^{0}({\\partial }_{{\\bf{k}}}{{\\boldsymbol{\\Omega }}}_{y}){\\boldsymbol{\\mathcal{E}}}_{z}^{2}$$ (8)\n\nIn equation (7), the overall integration of \\({{\\boldsymbol{\\Omega }}}_{y}\\) throughout the Brillouin zone under TRS should be zero. However, \\({{\\bf{J}}}_{x}^{(1)}\\) may contribute to first-order transverse current in our device geometry as shown in Fig. 1c under non-equilibrium steady-state conditions. However, there would be equal contribution from both of the Fermi pockets without any preferential scattering. The voltage response of \\({{\\bf{J}}}_{x}^{(1)}\\) would be in-phase with the applied current, represented as \\({V}_{\\omega }^{X}\\) in Extended Data Fig. 5(i). Meanwhile, \\({{\\bf{J}}}_{x}^{(2)}\\) originating due to OAM dipole37 would be of second-order, since \\({E}_{0}^{2}{\\sin }^{2}(\\omega t)={E}_{0}^{2}(1-\\cos (2\\omega t))/2\\). Its voltage response would be \\({\\rm{\\pi }}/2\\) shifted with respect to the applied current, represented as \\({V}_{2\\omega }^{Y}\\) in Extended Data Fig. 5(ii). Extended Data Fig. 5a,b shows the experimental measurement of these responses for the left and right arms of the device.\n\nIn our experiments, the above equations correspond to our observed voltage responses below 55 μA, where the g is zero and the Berry curvature is the dominant quantum geometry component. As discussed in the main text, the quantum metric is non-zero above 55 μA and we get a field-induced Berry curvature \\({{\\boldsymbol{\\Omega }}}_{\\varepsilon ,y}={\n\nabla }_{k}\\times ({\\bf{G}}{\\boldsymbol{\\mathcal{E}}}_{z})\\). Substituting this into \\({{\\bf{J}}}_{x}^{(1)}\\) and \\({{\\bf{J}}}_{x}^{(2)}\\) converts them into second-order and third-order transverse currents, respectively, which are given by\n\n$${{\\bf{J}}}_{x}^{(2)}\\propto {\\int }_{{\\bf{k}}}{f}^{0}({\n\nabla }_{{\\bf{k}}}\\times ({\\bf{G}}{\\boldsymbol{\\mathcal{E}}}_{z})){\\boldsymbol{\\mathcal{E}}}_{z}$$ (9)\n\n$${{\\bf{J}}}_{x}^{(3)}\\propto {\\int }_{{\\bf{k}}}{f}^{0}{\\partial }_{{\\bf{k}}}({\n\nabla }_{{\\bf{k}}}\\times ({\\bf{G}}{\\boldsymbol{\\mathcal{E}}}_{z})){\\boldsymbol{\\mathcal{E}}}_{z}^{2}$$ (10)\n\nThese equations are the basis of the experimental data discussed in the main text in Fig. 2 and Fig. 3. \\({{\\bf{J}}}_{x}^{(3)}\\) will contribute to a first-order and third-order current response, because \\({E}_{0}^{3}{\\sin }^{3}\\omega t\\,=\\) \\({E}_{0}^{3}\\left(\\frac{3}{4}\\sin \\omega t+\\frac{1}{4}\\sin (3\\omega t+{\\rm{\\pi }})\\right)\\). Their voltage response would be in-phase with the applied current applied current, represented as \\({V}_{\\omega }^{X}\\) and \\({V}_{3\\omega }^{X}\\) in Extended Data Fig. 5.\n\nWe also observed \\({\\rm{\\pi }}/2\\) shifted responses of \\({V}_{\\omega }^{X}\\), \\({V}_{2\\omega }^{Y}\\) and \\({V}_{3\\omega }^{X}\\). These responses are shown in Extended Data Fig. 6, Fig. 3 and Fig. 2(i), respectively. The appearance of \\({V}_{\\omega }^{Y}\\), \\({V}_{2\\omega }^{X}\\) and \\({V}_{3\\omega }^{Y}\\) due to \\({{\\bf{J}}}_{x}^{(1)}\\), \\({{\\bf{J}}}_{x}^{(2)}\\) and \\({{\\bf{J}}}_{x}^{(3)}\\), respectively suggests the presence of an inductive impedance, as suggested by Faraday’s law. These responses only start to dominate after the current threshold of 55 μA is reached when g is non-zero. It suggests that the inductance experienced by the chiral fermionic current in the right and left arms is the function of gΓ and gR, respectively. The dependence of \\({V}_{\\omega }^{Y}\\), \\({V}_{2\\omega }^{X}\\) and \\({V}_{3\\omega }^{Y}\\) responses on \\({\\bf{g}}\\) allowed us to capture its opposite sign for topological Fermi pockets at Γ and R points. Notably, it also suggests that the chiral fermionic current carries orbital angular moments. As in our case, it will lead to generation of a spin current since PdGa has a large spin–orbit coupling3. The inductance values for the chiral currents following into the right and left arm can convey the magnitude of these currents. We used the overall applied current applied in the device in our calculation, which gives the lower limit estimation of the inductance reactance, as given in Extended Data Fig. 6.\n\nTheoretical considerations for the quantum interference of chiral current\n\nThe phase acquired by a free electron due to electric-field-induced Berry connection (A ε ) in the absence of an external magnetic field along the path j is given by\n\n$$\\theta =\\frac{e}{\\hbar }\\int {{\\bf{A}}}_{\\varepsilon }\\cdot {\\rm{d}}{{\\bf{l}}}_{j}$$ (11)\n\nIn our system the vector potential A ε experienced by an electron in the left and right arms is GR\\({\\boldsymbol{\\mathcal{E}}}_{z}\\) and GΓ\\({\\boldsymbol{\\mathcal{E}}}_{z}\\), respectively. Thus, the phase difference due to the acquired by the electron travelling along the left (\\({\\theta }_{{\\rm{R}}}\\)) and right (\\({\\theta }_{\\Gamma }\\)) arms is given by\n\n$$\\Delta \\theta ={\\theta }_{{\\rm{R}}}-{\\theta }_{\\Gamma }=\\frac{e}{\\hbar }(\\int {{\\bf{G}}}^{{\\rm{R}}}{{\\mathcal{E}}}_{z}\\cdot {\\rm{d}}{{\\bf{l}}}_{j}-\\int {{\\bf{G}}}^{\\Gamma }{{\\mathcal{E}}}_{z}\\cdot {\\rm{d}}{{\\bf{l}}}_{j})$$ (12)\n\nAssuming \\({\\bf{G}}\\) does not vary spatially, we can rewrite the above equation as\n\n$$\\Delta \\theta =\\frac{{\\rm{e}}}{\\hbar }({{\\bf{G}}}^{{\\rm{R}}}-{{\\bf{G}}}^{\\Gamma })\\Delta {V}_{z}$$ (13)\n\nwhere \\(\\Delta {V}_{z}\\) is the voltage difference across the MZI. The term \\({{\\bf{G}}}^{{\\rm{R}}}-{{\\bf{G}}}^{\\Gamma }\\) is non-zero as G of Fermi pockets at R and Γ have opposite signs. Thus, we would observe the oscillation in phase on applied current, as shown in Fig. 5b.\n\nTemperature dependence\n\nExtended Data Fig. 7a-c show the log-scaled temperature dependence of the first-order, V 3ω and V 2ω longitudinal responses in one of the arms of the device. Extended Data Fig. 7a shows that the first-order response decreases with temperature till 15 K after which it starts to saturate. Upon cooling further, the V 3ω and V 2ω responses start to appear, as shown in Extended Data Fig. 7b,c. The appearance of the V 3ω response is concurrent with the observed upturn in the first-order response, as expected from equation (1). The V 3ω and V 2ω responses start to appear below 3.4 K and 14 K, respectively. The exact transition temperature varied between devices, with different device geometries and crystallographic orientations. However, the concurrent appearance in the upturn of the first and third-order responses was always observed in all the measured devices. Data at lower temperatures were measured in a Bluefors system which showed that the nonlinear responses start to saturate below 1 K. Note that these data are not shown because they had a considerably better signal-to-noise ratio due to the low-noise filters present in the Bluefors system. Extended Data Fig. 7d,e shows the relative modulation of the first-order responses with magnetic field orientation in the right and left arms, respectively, at different temperatures. The modulation in the different arms remains of opposite signs below 100 K even in the device with ‘valve off’ position. After 100 K, the change in the sign of the modulation in the right arm was observed. Thereafter, both arms share the same sign of modulation, albeit of different magnitudes. Above 200 K, the modulation with magnetic field orientation starts to disappear in both of these arms.\n\nExtended Data Fig. 7f shows the temperature dependence of the FFT amplitude of the V 3ω oscillation with the magnetic field. The amplitude of the oscillation decays slowly with temperature below 1 K, after which it starts to decreases more sharply with temperature. The amplitude decay trend matches the temperature dependence of the magnitude of the V 2ω shown in Extended Data Fig. 7c. We strongly believe that the FFT amplitude is linked with the quantum metric magnitude. The V 2ω response is the direct indicator of quantum metric response. Assuming amplitude decay solely due to an inelastic mechanism would not be accurate as the quantum metric does not scale with the scattering time in Drude conductivity. Therefore, the amplitude decay was not correlated to the phase-coherent length because the mechanism of decoherence of chiral fermions is not completely known. We also tried to measure the amplitude of the oscillation of the V 3ω response with applied current shown in Fig. 5b. We observed that the oscillation period changed with temperature, and the FFT amplitude broadened into multiple peaks. Hence, tracking the FFT amplitude with temperature was not trivial. It may be due to temperature variation of current-induced magnetization, which influences the oscillation period.\n\nPossible trivial-state contributions to current directionality\n\nPdGa belongs to a gyrotropic class with the tetrahedral chiral point group 23 (T), which allows for a Dresselhaus-type spin–orbit coupling48. The spin–orbit coupling can cause splitting of the trivial band (and topological bands). The applied electric field creates non-equilibrium spin polarization of both spins, as shown in Extended Data Fig. 8a. The current applied along z would create a spin polarization for both spins along z. A previous study in 2002 proposed the spin galvanic effect, in which electric current was produced due to spatially uniform non-equilibrium spin polarization49. Empirically, the electric current density (j α ) is linked with the average spin of the electron (\\({S}_{\\gamma }\\)) by \\({j}_{\\alpha }=\\sum {Q}_{\\alpha \\gamma }{S}_{\\gamma }\\), where Q is the second-rank pseudotensor of a gyrotropic crystal. These currents are semi-classically modelled using spin-dependent scattering asymmetry. In the conventional spin galvanic effect, the current is galvanized because of the asymmetry in spin-flip scattering, which requires a spin population imbalance of a particular spin. However, opposite spin currents can also be galvanized because of the asymmetry in skew scattering, as in the case of inverse spin Hall effect, as schematically shown in Extended Data Fig. 8b. Similar to the spin galvanic effect, the inverse spin Hall effect also generates a dipolar term proportional to (k · S) because of spin-dependent correction of the Fermi–Dirac distribution (\\(\\delta {f}_{k,S}\\)) (ref. 50). For non-zero \\({Q}_{{xz}}\\), this would generate currents of opposite spins in different arms of the device, instead of the spin Hall voltage measured in a conventional Hall device. The spin currents generated due to inverse spin Hall effect (or spin galvanic effect) can give the desired current directionally solely due to the trivial bands of PdGa. This filtration of spin current into different arms is conceptually similar to the filtration of the chiral fermions due to electric field-induced quantum geometry.\n\nThe magnitude of opposite spin currents galvanized into the outer arms would depend on the size of the Fermi surface51 and \\(\\delta {f}_{k,S}\\). These parameters are similar for both spin currents originating from the Fermi surface of a same trivial band. Therefore, we would expect that the relative magnitude of current in both arms would remain similar. It would be irrespective of the crystallographic direction of applied current, even when the magnitude of individual spin current may vary because of anisotropic skew scattering. In Extended Data Fig. 2, we have shown that we can tune the relative magnitude of the generated current in both arms by passing current in different crystal directions. Therefore, the spin currents galvanized due to \\({Q}_{\\alpha \\gamma }\\) of trivial bands cannot explain the differences in the relative magnitude of currents measured in different devices. We will now provide the second evidence by ruling out the involvement of the \\({Q}_{\\alpha \\gamma }\\)-like tensor from the trivial bands. We measured anomalous Hall response in three devices with crystallographic orientation corresponding to ‘valve on’, ‘IR on’ and ‘IΓ on’ positions. Extended Data Fig. 8c shows the electrical configuration used to measure the Hall responses. The magnetic field was rotated in the yz plane, where θ = 90° corresponds to the field along the direction of applied current z. Extended Data Fig. 8d shows the relative change in the magnitude of the Hall response on magnetic orientation in a device with ‘valve on’ position with respect to θ = 90°. The response in this valve position resembles the response expected from a trivial Hall effect. \\(\\Delta {{\\boldsymbol{\\Omega }}}_{\\varepsilon }^{\\Gamma }\\) and \\(\\Delta {{\\boldsymbol{\\Omega }}}_{\\varepsilon }^{{\\rm{R}}}\\) have a similar magnitude contribution to the OAM dipole in the ‘valve on’ position. Therefore, there is no anomalous Hall response due to the absence of any net magnetization. The Hall response was also similar in the device in ‘valve off’ state, which is expected because of the absence of the OAM dipole itself along the y-axis. Extended Data Fig. 8e,f show the relative change in the magnitude of the Hall response with the magnetic field orientation in the device in ‘IR on’ and ‘IΓ on’ position, respectively. These responses show the presence of an anomalous Hall response with distinct symmetries. In ‘IR on’ position, a net magnetization is present because \\(\\Delta {{\\boldsymbol{\\Omega }}}_{\\varepsilon }^{{\\rm{R}}}\\) has larger contribution in the OAM dipole than \\(\\Delta {{\\boldsymbol{\\Omega }}}_{\\varepsilon }^{\\Gamma }\\). The symmetry of the Hall responses matches the symmetry of the longitudinal response of chiral current discussed in Fig. 4b(i). Meanwhile, \\(\\Delta {{\\boldsymbol{\\Omega }}}_{\\varepsilon }^{\\Gamma }\\) contributes more to the OAM dipole in ‘IΓ on’ position; therefore, the anomalous Hall response captures its two-fold symmetry. The three distinct anomalous Hall responses observed in our study cannot be explained by \\({Q}_{\\alpha \\gamma }\\)-driven currents. Our results indicate that the observed two distinct Hall responses can be explained only by considering the \\(\\Delta {{\\boldsymbol{\\Omega }}}_{\\varepsilon }^{\\Gamma }\\) and \\(\\Delta {{\\boldsymbol{\\Omega }}}_{\\varepsilon }^{{\\rm{R}}}\\) contributions coming from two different topological Fermi pockets.\n\nRole of Fermi-arcs in long-range coherence",
      "url": "https://www.nature.com/articles/s41586-025-09864-5",
      "source": "Nature",
      "published": "2026-01-01",
      "sentiment_score": 0.85,
      "reasoning": "The article reports a significant breakthrough in quantum materials and device physics: the demonstration of a chiral fermionic valve driven by quantum geometry in a topological material (PdGa). This device enables spatial filtering of fermionic currents of opposing chirality without magnetic fields, using intrinsic quantum geometric properties, which is a novel and fundamental advance. The work includes detailed experimental fabrication, measurements, and theoretical modeling, showing active and passive tunability of the valve and quantum interference effects. The impact is broad for future quantum technology, spintronics, and topological electronics, with potential to inspire new device architectures and quantum information applications. The article is focused, detailed, and describes a clear, substantive advance in technology with broad scientific and technological significance.",
      "category": "Technology",
      "personality_title": "New quantum device controls chiral currents without magnets",
      "personality_presentation": "**Context** – Scientists study special materials called topological crystals, where electrons behave in unusual ways due to their quantum properties. One such material is PdGa, known for its unique electronic structures called Fermi pockets, which carry electrons with different 'chirality' or handedness.\n\n**What happened** – A team created a tiny device from a PdGa crystal shaped like a three-arm valve. This device can separate and control electric currents made of electrons with opposite chirality without using magnetic fields. They built 23 devices with different shapes and crystal directions and tested how the currents flow inside. By carefully applying electric currents and measuring responses at very low temperatures, they showed that the device can switch between different states, controlling which type of chiral current flows in each arm. They also added magnetic tunnel junctions (MTJs) on top to actively tune the valve by changing magnetization, demonstrating a new way to control these chiral currents.\n\n**Impact** – This is the first time a device uses the quantum geometry — a property related to how electrons move in topological materials — to control chiral currents without magnets. It means devices can be smaller, faster, and use less energy because they don’t rely on magnetic fields. The discovery also revealed quantum interference effects in the currents, showing that electrons keep their quantum phases over the device. These findings open new possibilities for building advanced electronic components for quantum computers and spintronics, where controlling electron spin and chirality is important.\n\n**What's next step** – Researchers will study how the chiral currents interact with magnetization in more detail to improve control and stability. They will also work on making the devices smaller and test their performance at higher temperatures. Understanding the switching speed and how reliably the valve operates will help design practical quantum electronic devices. The team plans to explore how these valves can be integrated into circuits for future quantum technologies.\n\n**One-sentence takeaway** – Scientists have built a novel quantum valve from PdGa that controls electron currents of opposite chirality using intrinsic quantum properties, without magnets, paving the way for new quantum electronic devices.",
      "personality_title_fr": "Un nouveau dispositif quantique contrôle les courants chiraux sans aimants",
      "personality_presentation_fr": "**Contexte** – Les scientifiques étudient des matériaux spéciaux appelés cristaux topologiques, où les électrons se comportent de manière inhabituelle grâce à leurs propriétés quantiques. Le PdGa est un de ces matériaux, connu pour ses structures électroniques uniques appelées poches de Fermi, qui transportent des électrons avec une « chiralité » différente.\n\n**Ce qui s'est passé** – Une équipe a fabriqué un petit dispositif à partir d’un cristal de PdGa, en forme de vanne à trois bras. Ce dispositif peut séparer et contrôler des courants électriques composés d’électrons de chiralité opposée, sans utiliser de champs magnétiques. Ils ont créé 23 dispositifs avec différentes formes et orientations cristallines et ont testé le flux des courants à l’intérieur. En appliquant soigneusement des courants électriques et en mesurant les réponses à très basse température, ils ont montré que le dispositif peut changer d’état pour contrôler quel type de courant chiral circule dans chaque bras. Ils ont aussi ajouté des jonctions tunnel magnétiques (MTJ) pour régler activement la vanne en changeant la magnétisation.\n\n**Impact** – C’est la première fois qu’un dispositif utilise la géométrie quantique — une propriété liée au mouvement des électrons dans des matériaux topologiques — pour contrôler des courants chiraux sans aimants. Cela signifie que les appareils peuvent être plus petits, plus rapides et consommer moins d’énergie car ils n’ont pas besoin de champs magnétiques. La découverte a aussi révélé des effets d’interférence quantique dans les courants, montrant que les électrons gardent leur phase quantique. Ces résultats ouvrent de nouvelles possibilités pour construire des composants électroniques avancés pour l’informatique quantique et la spintronique.\n\n**Prochaine étape** – Les chercheurs vont étudier plus en détail comment les courants chiraux interagissent avec la magnétisation pour améliorer le contrôle et la stabilité. Ils travailleront aussi à miniaturiser les dispositifs et à tester leur fonctionnement à des températures plus élevées. Comprendre la vitesse de commutation et la fiabilité aidera à concevoir des appareils quantiques pratiques. L’équipe prévoit d’explorer l’intégration de ces vannes dans des circuits pour les technologies quantiques futures.\n\n**Conclusion en une phrase** – Des scientifiques ont construit une nouvelle vanne quantique en PdGa qui contrôle des courants d’électrons de chiralité opposée grâce à des propriétés quantiques intrinsèques, sans aimants, ouvrant la voie à de nouveaux appareils électroniques quantiques.",
      "personality_title_es": "Nuevo dispositivo cuántico controla corrientes chirales sin imanes",
      "personality_presentation_es": "**Contexto** – Los científicos estudian materiales especiales llamados cristales topológicos, donde los electrones se comportan de forma inusual debido a sus propiedades cuánticas. El PdGa es uno de estos materiales, conocido por sus estructuras electrónicas únicas llamadas bolsillos de Fermi, que transportan electrones con diferente 'quiralidad' o mano.\n\n**Qué pasó** – Un equipo creó un pequeño dispositivo a partir de un cristal de PdGa con forma de válvula de tres brazos. Este dispositivo puede separar y controlar corrientes eléctricas formadas por electrones de quiralidad opuesta sin usar campos magnéticos. Fabricaron 23 dispositivos con diferentes formas y orientaciones cristalinas y probaron cómo fluían las corrientes dentro. Aplicando cuidadosamente corrientes eléctricas y midiendo respuestas a temperaturas muy bajas, demostraron que el dispositivo puede cambiar entre diferentes estados para controlar qué tipo de corriente quiral fluye por cada brazo. También añadieron uniones túnel magnéticas (MTJ) para ajustar activamente la válvula cambiando la magnetización.\n\n**Impacto** – Es la primera vez que un dispositivo usa la geometría cuántica — una propiedad relacionada con el movimiento de electrones en materiales topológicos — para controlar corrientes chirales sin imanes. Esto significa que los dispositivos pueden ser más pequeños, rápidos y consumir menos energía porque no dependen de campos magnéticos. El descubrimiento también mostró efectos de interferencia cuántica en las corrientes, indicando que los electrones mantienen su fase cuántica. Estos hallazgos abren nuevas posibilidades para construir componentes electrónicos avanzados para computadoras cuánticas y espintrónica.\n\n**Próximo paso** – Los investigadores estudiarán en más detalle cómo las corrientes chirales interactúan con la magnetización para mejorar el control y la estabilidad. También trabajarán en miniaturizar los dispositivos y probar su rendimiento a temperaturas más altas. Entender la velocidad de conmutación y la fiabilidad ayudará a diseñar dispositivos cuánticos prácticos. El equipo planea explorar cómo integrar estas válvulas en circuitos para futuras tecnologías cuánticas.\n\n**Frase clave** – Científicos han creado una nueva válvula cuántica de PdGa que controla corrientes de electrones con quiralidad opuesta usando propiedades cuánticas intrínsecas, sin imanes, abriendo camino a nuevos dispositivos electrónicos cuánticos.",
      "image_url": "public/images/news_image_A-chiral-fermionic-valve-driven-by-quantum-geometr.png",
      "image_prompt": "A detailed, warm-toned painting of an intricate, glowing three-armed geometric structure resembling a delicate crystalline lattice suspended above a smooth surface, with flowing, intertwined streams of light symbolizing chiral currents weaving selectively through each arm; subtle abstract representations of magnetic fields and quantum interference ripple gently around the structure, all rendered in soft natural hues of gold, amber, and muted blues, evoking a harmonious interplay of quantum geometry and electron flow without any human figures or text."
    },
    {
      "title": "Could 2026 be the year we start using quantum computers for chemistry?",
      "summary": "Understanding the chemical properties of a molecule is an inherently quantum problem, making quantum computers a good tool for the job – and we may start seeing this take off in 2026",
      "content": "Understanding the chemical properties of a molecule is an inherently quantum problem, making quantum computers a good tool for the job – and we may start seeing this take off in 2026\n\nQuantum computers are well-matched to solve chemistry problems Marijan Murat/dpa/Alamy\n\nWhether quantum computers can actually solve practical problems is one of the biggest unanswered questions of this growing industry – and one that might be answered by researchers in industrial and medical chemistry in 2026.\n\nCalculating the structure, reactivity and other chemical properties of a molecule is an intrinsically quantum problem because it involves its electrons, which are quantum particles. But the more complex a molecule is, the harder these calculations become, in some cases posing a real challenge even for traditional supercomputers.\n\nOn the other hand, because quantum computers are also intrinsically quantum, they should have an advantage when it comes to tackling these chemical calculations. And as quantum computers have gotten larger and more easily combined with traditional computers, we are increasingly seeing them turned to this use.\n\nFor example, in 2025, researchers at IBM and the Japanese scientific institute RIKEN used a quantum computer and a supercomputer to model several molecules. Researchers at Google developed and tested a quantum computing algorithm to help tease out the structure of molecules. RIKEN’s researchers also teamed up with the quantum computing firm Quantinuum to devise a workflow for computing molecules’ energies in such a way that the quantum computer caught its own errors. Finally, quantum software start-up Qunova Computing already provides an algorithm that partly uses a quantum computer to calculate these energies, which it claims is about 10 times more efficient than more traditional methods.\n\nWe should expect to see much more of this in 2026 as larger quantum computers become available. “Upcoming bigger machines will allow us to develop more powerful versions of this [existing] workflow, and ultimately, we’ll be able to address general quantum chemistry problems,” says David Muñoz Ramo at Quantinuum. So far, his team has tackled only a hydrogen molecule, but he says that more complex structures like catalysts, which speed up industrially relevant reactions, could be on the horizon.\n\nFree newsletter Sign up to The Daily The latest on what’s new in science and why it matters each day. Sign up to newsletter\n\nOther research teams are gearing up to do similar work. For example, in December, Microsoft announced a collaboration with the quantum software start-up Algorithmiq with the explicit aim of developing more quantum chemistry algorithms more quickly. In fact, a survey of the quantum computing industry conducted by Hyperion Research found that chemistry is the leading area in which makers and buyers of quantum computers alike expect to see progress and success in the coming year. In the past two annual surveys, quantum chemistry was the second- and fourth-most promising use case for quantum computing, respectively, so the trend has seen steadily increasing interest and investment.\n\nUltimately, however, quantum chemistry computations won’t really take off until quantum computers become error-proof or fault-tolerant – something that is also holding up other applications of these exotic devices. “The ability of a quantum computer to solve problems faster than a classical computer depends on fault-tolerant algorithm,” wrote Philipp Schleich and Alán Aspuru-Guzik at the University of Toronto in a recent commentary on quantum computing and chemistry for the journal Science. Luckily, reaching fault-tolerance is the one goal that every quantum computer manufacturer around the globe can agree on.",
      "url": "https://www.newscientist.com/article/2508645-could-2026-be-the-year-we-start-using-quantum-computers-for-chemistry/?utm_campaign=RSS%7CNSNS&utm_source=NSNS&utm_medium=RSS&utm_content=home",
      "source": "New Scientist - Home",
      "published": "2025-12-31",
      "sentiment_score": 0.85,
      "reasoning": "The article describes significant progress and anticipated breakthroughs in quantum computing applied to chemistry, a field with broad implications for industrial and medical chemistry. It highlights ongoing research collaborations, increasing investment, and the potential for quantum computers to solve complex chemical problems more efficiently than classical supercomputers. This represents a meaningful technological advancement with potential large-scale benefits.",
      "category": "Technology",
      "personality_title": "Quantum computers may advance chemistry research by 2026",
      "personality_presentation": "**Context** – Understanding molecules and their chemical properties is a complex problem because it involves quantum particles called electrons. Traditional supercomputers struggle with very complex molecules, but quantum computers, which also work using quantum principles, might solve these problems more effectively.\n\n**What happened** – In recent years, researchers and companies like IBM, Google, RIKEN, Quantinuum, and Qunova Computing have started using quantum computers alongside regular supercomputers to study molecules. They have developed new methods and algorithms that improve how molecules’ structures and energies are calculated. By 2026, larger and more advanced quantum computers are expected to make these calculations even better and handle more complex molecules such as catalysts.\n\n**Impact** – This progress is important because it could make chemical research faster and more accurate, helping in fields like medicine and industry. For example, better understanding catalysts can speed up important chemical reactions. Quantum chemistry is becoming one of the most promising uses for quantum computers, attracting more investment and collaboration worldwide.\n\n**What's next step** – The main challenge is to build quantum computers that can work without errors, called fault-tolerant quantum computers. Researchers and companies are focused on this goal, and once achieved, quantum computers could solve many chemistry problems much faster than today’s computers.\n\n**One-sentence takeaway** – By 2026, advances in quantum computers could allow scientists to solve complex chemistry problems more efficiently, opening new possibilities in medicine and industry.",
      "personality_title_fr": "Les ordinateurs quantiques pourraient révolutionner la chimie dès 2026",
      "personality_presentation_fr": "**Contexte** – Comprendre les molécules et leurs propriétés chimiques est difficile car cela implique des particules quantiques appelées électrons. Les superordinateurs traditionnels ont du mal avec les molécules très complexes, mais les ordinateurs quantiques, qui fonctionnent aussi selon les principes quantiques, pourraient mieux résoudre ces problèmes.\n\n**Ce qui s'est passé** – Ces dernières années, des chercheurs et entreprises comme IBM, Google, RIKEN, Quantinuum et Qunova Computing ont commencé à utiliser des ordinateurs quantiques en complément des superordinateurs pour étudier les molécules. Ils ont développé de nouvelles méthodes et algorithmes pour mieux calculer la structure et l’énergie des molécules. En 2026, des ordinateurs quantiques plus grands et avancés devraient améliorer ces calculs et traiter des molécules plus complexes comme les catalyseurs.\n\n**Impact** – Ces progrès sont importants car ils peuvent rendre la recherche chimique plus rapide et précise, ce qui aide la médecine et l’industrie. Par exemple, mieux comprendre les catalyseurs peut accélérer des réactions chimiques importantes. La chimie quantique devient l’un des usages les plus prometteurs des ordinateurs quantiques, attirant plus d’investissements et de collaborations dans le monde.\n\n**Prochaine étape** – Le principal défi est de construire des ordinateurs quantiques capables de fonctionner sans erreurs, appelés ordinateurs quantiques tolérants aux fautes. Les chercheurs et entreprises travaillent à cet objectif, et une fois atteint, ces ordinateurs pourront résoudre beaucoup de problèmes chimiques bien plus vite qu’aujourd’hui.\n\n**Résumé en une phrase** – D’ici 2026, les progrès des ordinateurs quantiques pourraient permettre aux scientifiques de résoudre plus efficacement des problèmes complexes de chimie, ouvrant de nouvelles possibilités en médecine et industrie.",
      "personality_title_es": "Los ordenadores cuánticos podrían impulsar la química para 2026",
      "personality_presentation_es": "**Contexto** – Entender las moléculas y sus propiedades químicas es difícil porque involucra partículas cuánticas llamadas electrones. Las supercomputadoras tradicionales tienen problemas con moléculas muy complejas, pero los ordenadores cuánticos, que también usan principios cuánticos, podrían resolver estos problemas mejor.\n\n**Qué pasó** – En los últimos años, investigadores y empresas como IBM, Google, RIKEN, Quantinuum y Qunova Computing han empezado a usar ordenadores cuánticos junto con supercomputadoras para estudiar moléculas. Han creado nuevos métodos y algoritmos para calcular mejor la estructura y energía de las moléculas. Para 2026, se espera que ordenadores cuánticos más grandes y avanzados mejoren estos cálculos y puedan manejar moléculas más complejas como los catalizadores.\n\n**Impacto** – Este avance es importante porque puede hacer que la investigación química sea más rápida y precisa, ayudando en medicina e industria. Por ejemplo, entender mejor los catalizadores puede acelerar reacciones químicas importantes. La química cuántica se está convirtiendo en uno de los usos más prometedores de los ordenadores cuánticos, atrayendo más inversión y colaboración en todo el mundo.\n\n**Próximo paso** – El principal desafío es construir ordenadores cuánticos que funcionen sin errores, llamados ordenadores cuánticos tolerantes a fallos. Investigadores y empresas están enfocados en esta meta, y cuando se logre, los ordenadores cuánticos podrán resolver muchos problemas de química mucho más rápido que hoy.\n\n**Resumen en una frase** – Para 2026, los avances en ordenadores cuánticos podrían permitir a los científicos resolver problemas complejos de química de forma más eficiente, abriendo nuevas posibilidades en medicina e industria.",
      "image_url": "public/images/news_image_Could-2026-be-the-year-we-start-using-quantum-comp.png",
      "image_prompt": "A warm, detailed painting of a glowing, intricate molecular structure intertwined with softly illuminated quantum circuit patterns, set against a gentle gradient background of natural blues and greens, symbolizing the harmonious fusion of quantum computing and chemistry advancing toward a hopeful future."
    },
    {
      "title": "Random heteropolymers as enzyme mimics",
      "summary": "Nature, Published online: 31 December 2025; doi:10.1038/s41586-025-09860-9Modulation of random heteropolymers results in globular polymer clusters with catalytic activity mimicking proteins.",
      "content": "This work was supported by the Defense Threat Reduction Agency (DTRA) under contract HDTRA1-19-1-0011 and HDTRA1-24-1-0012, the US Department of Defense (DOD) under contract W911NF-13-1-0232 through the Army Research Office (ARO) and the National Science Foundation under contract DMR- 2104443 and the Alfred P. Sloan Foundation (grant no. G-2021-16757). T.J. and A.A-K. thank the support from the National Science Foundation under EFRI E3P Award Number 2132025. We thank E. Dailing in the Molecular Foundry at the LBNL for assistance with gel permeation chromatograph measurements, and C. Citek in the Catalysis Laboratory at the LBNL for assistance with stopped-flow experiments. Work at the Molecular Foundry, Catalysis Laboratory, and ALS was supported by the Office of Science, Office of Basic Energy Sciences, of the US Department of Energy under contract no. DE-AC02-05CH11231. We thank H. Celik, R. Giovine and the Core NMR Facility of Pines Magnetic Resonance Center (PMRC Core) for spectroscopic assistance. The instruments used in this work were supported by the PMRC Core and in part supported by NIH S10OD024998. The ERP Spectroscopy experiments were supported by NIH R35GM126961. We thank the US Department of Energy, Office of Science, Office of Basic Energy Sciences, Materials Sciences and Engineering Division, under award no. DE-SC0024447, for its support of neutron scattering and molecular simulation work. This work used resources at the High Flux Isotope Reactor (HFIR) and Spallation Neutron Source, a DOE Office of Science User Facility operated by the Oak Ridge National Laboratory. SANS studies performed on the CG-3 instrument are funded by the Office of Biological and Environmental Research, U.S. Department of Energy under Contract FWP ERKP291. This work was partially supported by the Director, Office of Sciences, and the Division of Chemical Sciences, Geosciences, and Bioscience of the US Department of Energy at LBNL (grant no. DE-AC02-05CH11231). Access to HFBS was provided by the Center for High Resolution Neutron Scattering, a partnership between the National Institute of Standards and Technology and the National Science Foundation under agreement no. DMR-2010792. We thank M. Tyagi for the assistance with neutron experiments and the support of the National Institute of Standards and Technology, US Department of Commerce, in providing neutron research facilities used in this work. A.G. was partially supported by National Science Foundation Graduate Research Fellowship under Grant No. DGE-2146752. T.J. was partially supported by the Chyn Duoq Shiah Memorial Fellowship. P.G was partially supported by the MIT Undergraduate Research Opportunity Program (UROP). A.A-K. was partially supported by the Michael and Sonja Koerner Chair. T.X. thanks the dear late colleague Phillip Geissler for encouraging discussions back in 2020.",
      "url": "https://www.nature.com/articles/s41586-025-09860-9",
      "source": "Nature",
      "published": "2026-01-01",
      "sentiment_score": 0.8,
      "reasoning": "The article reports a significant scientific breakthrough in creating random heteropolymers that mimic enzyme catalytic activity, representing an important innovation in polymer chemistry and catalysis with potential broad applications in biotechnology, medicine, and industry.",
      "category": "Technology",
      "personality_title": "Scientists create polymers that act like enzymes",
      "personality_presentation": "**Context** – Enzymes are special proteins that speed up chemical reactions in living things. Scientists have long tried to make materials that can work like enzymes for use in medicine, industry, and research.\n\n**What happened** – Researchers developed random heteropolymers, which are chains made of different building blocks arranged in no fixed order. By adjusting these polymers, they formed small, round clusters that can speed up chemical reactions just like natural enzymes do. This discovery was published in Nature on December 31, 2025.\n\n**Impact** – This is important because making enzyme-like polymers could lead to cheaper and more durable alternatives to natural enzymes. These polymers can be designed to work in harsh conditions where natural enzymes might break down. This could help in making medicines, cleaning up pollution, or creating new materials.\n\n**What's next step** – Scientists will likely explore how to improve these polymers to work faster and on different types of reactions. They may also test them in real-world applications like drug development or environmental cleanup.\n\n**One-sentence takeaway** – New random heteropolymers can act like enzymes, opening doors to useful and durable catalysts for science and industry.",
      "personality_title_fr": "Des polymères imitent les enzymes grâce à une nouvelle découverte",
      "personality_presentation_fr": "**Contexte** – Les enzymes sont des protéines spéciales qui accélèrent les réactions chimiques dans les êtres vivants. Les scientifiques essaient depuis longtemps de créer des matériaux pouvant agir comme des enzymes pour la médecine, l'industrie et la recherche.\n\n**Ce qui s'est passé** – Des chercheurs ont développé des hétéropolymères aléatoires, des chaînes composées de différents blocs de construction sans ordre fixe. En les ajustant, ils ont formé de petits groupes ronds capables d'accélérer des réactions chimiques comme le font les enzymes naturelles. Cette découverte a été publiée dans Nature le 31 décembre 2025.\n\n**Impact** – C’est important car ces polymères enzyme-like pourraient être des alternatives moins coûteuses et plus résistantes aux enzymes naturelles. Ils peuvent fonctionner dans des conditions difficiles où les enzymes naturelles se dégradent. Cela pourrait aider à fabriquer des médicaments, nettoyer la pollution ou créer de nouveaux matériaux.\n\n**Prochaine étape** – Les scientifiques vont probablement chercher à améliorer ces polymères pour qu'ils agissent plus vite et sur différents types de réactions. Ils pourraient aussi les tester dans des applications concrètes comme le développement de médicaments ou la dépollution.\n\n**Phrase clé** – De nouveaux hétéropolymères aléatoires peuvent agir comme des enzymes, ouvrant la voie à des catalyseurs utiles et durables pour la science et l'industrie.",
      "personality_title_es": "Científicos crean polímeros que actúan como enzimas",
      "personality_presentation_es": "**Contexto** – Las enzimas son proteínas especiales que aceleran reacciones químicas en los seres vivos. Los científicos han intentado durante mucho tiempo crear materiales que funcionen como enzimas para usar en medicina, industria e investigación.\n\n**Qué pasó** – Investigadores desarrollaron heteropolímeros aleatorios, cadenas hechas de diferentes bloques sin un orden fijo. Al ajustarlos, formaron pequeños grupos redondos que pueden acelerar reacciones químicas igual que las enzimas naturales. Este descubrimiento se publicó en Nature el 31 de diciembre de 2025.\n\n**Impacto** – Esto es importante porque crear polímeros similares a enzimas podría dar alternativas más baratas y duraderas a las enzimas naturales. Estos polímeros pueden funcionar en condiciones difíciles donde las enzimas naturales se dañan. Esto puede ayudar a hacer medicinas, limpiar contaminación o crear nuevos materiales.\n\n**Próximo paso** – Los científicos probablemente intentarán mejorar estos polímeros para que trabajen más rápido y en diferentes tipos de reacciones. También podrían probarlos en aplicaciones reales como desarrollo de medicamentos o limpieza ambiental.\n\n**Frase clave** – Nuevos heteropolímeros aleatorios pueden actuar como enzimas, abriendo puertas a catalizadores útiles y duraderos para la ciencia y la industria.",
      "image_url": "public/images/news_image_Random-heteropolymers-as-enzyme-mimics.png",
      "image_prompt": "A detailed, warm-toned painting of an abstract molecular landscape where colorful, irregularly shaped polymer chains intertwine gracefully with glowing enzyme-like structures, set against a soft, natural background of flowing chemical bonds and subtle neutron scattering patterns, symbolizing the innovative mimicry of enzymes by random heteropolymers."
    },
    {
      "title": "Highly efficient LED device built by stacking layers of light-emitting perovskite",
      "summary": "Nature, Published online: 31 December 2025; doi:10.1038/d41586-025-04021-4Stacking light-generating layers in ‘tandem’ light-emitting diodes (LEDs) can enhance performance, but achieving efficient and stable tandem LEDs made with perovskite materials has remained a challenge. A tandem perovskite-based device that seems to benefit from ‘recycling’ of photons between stacked layers demonstrates highly efficient performance, surpassing the combined emissions of two single-unit devices.",
      "content": "Thank you for visiting nature.com. You are using a browser version with limited support for CSS. To obtain the best experience, we recommend you use a more up to date browser (or turn off compatibility mode in Internet Explorer). In the meantime, to ensure continued support, we are displaying the site without styles and JavaScript.",
      "url": "https://www.nature.com/articles/d41586-025-04021-4",
      "source": "Nature",
      "published": "2026-01-01",
      "sentiment_score": 0.75,
      "reasoning": "The article reports a significant breakthrough in LED technology using tandem perovskite layers, achieving highly efficient performance that surpasses previous devices. This advancement has potential broad impact on energy-efficient lighting and display technologies, benefiting society by improving energy consumption and device performance. The article focuses on a single technological innovation with clear context and measurable improvement.",
      "category": "Technology",
      "personality_title": "New stacked perovskite LED breaks efficiency records",
      "personality_presentation": "**Context** – LEDs are small lights used in many devices, from phone screens to room lighting. Scientists have been trying to make LEDs brighter and use less energy by stacking layers of light-producing materials. One promising material is called perovskite, but making stable, efficient LEDs with stacked perovskite layers has been difficult.\n\n**What happened** – Researchers created a new LED by stacking two layers of perovskite light-emitting materials. This design allows the light inside the device to bounce between layers, making the LED shine brighter than two separate single-layer LEDs combined. The device was tested and showed much better performance than earlier versions.\n\n**Impact** – This new LED design is important because it uses energy more efficiently and produces more light without using more power. This could lead to better screens and lighting that save electricity and last longer. The way the layers recycle light inside the device is a new approach that could change how LEDs are made.\n\n**What's next step** – Scientists will work on making these stacked perovskite LEDs more stable and easier to produce on a large scale. If successful, this technology might soon be used in everyday electronics, improving energy use and brightness.\n\n**One-sentence takeaway** – A new LED using stacked perovskite layers shines brighter and uses energy more efficiently by recycling light inside the device.",
      "personality_title_fr": "Un nouveau LED en perovskite empilée bat des records d'efficacité",
      "personality_presentation_fr": "**Contexte** – Les LED sont des petites lumières utilisées dans de nombreux appareils, des écrans de téléphone à l’éclairage des pièces. Les scientifiques essaient de rendre les LED plus lumineuses et moins énergivores en empilant des couches de matériaux qui produisent de la lumière. Un matériau prometteur s’appelle la pérovskite, mais fabriquer des LED stables et efficaces avec des couches empilées de pérovskite a été difficile.\n\n**Ce qui s'est passé** – Des chercheurs ont créé une nouvelle LED en empilant deux couches de matériaux émettant de la lumière en pérovskite. Ce design permet à la lumière à l’intérieur de l’appareil de rebondir entre les couches, rendant la LED plus brillante que deux LED simples séparées réunies. L’appareil a été testé et a montré une performance bien meilleure que les versions précédentes.\n\n**Impact** – Cette nouvelle conception de LED est importante car elle utilise l’énergie plus efficacement et produit plus de lumière sans consommer plus d'électricité. Cela pourrait conduire à de meilleurs écrans et éclairages qui économisent de l’énergie et durent plus longtemps. La façon dont les couches recyclent la lumière à l’intérieur de l’appareil est une nouvelle approche qui pourrait changer la fabrication des LED.\n\n**Prochaine étape** – Les scientifiques vont travailler à rendre ces LED en pérovskite empilée plus stables et plus faciles à produire en grande quantité. Si cela réussit, cette technologie pourrait bientôt être utilisée dans les appareils du quotidien, améliorant la consommation d’énergie et la luminosité.\n\n**Une phrase clé** – Une nouvelle LED utilisant des couches de pérovskite empilées brille plus fort et utilise l’énergie plus efficacement en recyclant la lumière à l’intérieur de l’appareil.",
      "personality_title_es": "Nuevo LED de perovskita apilada rompe récords de eficiencia",
      "personality_presentation_es": "**Contexto** – Los LEDs son pequeñas luces que se usan en muchos dispositivos, desde pantallas de teléfonos hasta iluminación de habitaciones. Los científicos han tratado de hacer LEDs más brillantes y que usen menos energía apilando capas de materiales que producen luz. Un material prometedor se llama perovskita, pero hacer LEDs estables y eficientes con capas apiladas de perovskita ha sido difícil.\n\n**Qué pasó** – Investigadores crearon un nuevo LED apilando dos capas de material emisor de luz de perovskita. Este diseño permite que la luz dentro del dispositivo rebote entre las capas, haciendo que el LED brille más que dos LEDs de una sola capa juntos. El dispositivo fue probado y mostró un rendimiento mucho mejor que las versiones anteriores.\n\n**Impacto** – Este nuevo diseño de LED es importante porque usa la energía de forma más eficiente y produce más luz sin consumir más electricidad. Esto podría llevar a mejores pantallas e iluminación que ahorren energía y duren más tiempo. La forma en que las capas reciclan la luz dentro del dispositivo es un enfoque nuevo que podría cambiar cómo se fabrican los LEDs.\n\n**Próximo paso** – Los científicos trabajarán para hacer que estos LEDs de perovskita apilada sean más estables y más fáciles de producir en gran escala. Si tienen éxito, esta tecnología podría usarse pronto en dispositivos cotidianos, mejorando el uso de energía y el brillo.\n\n**Una frase clave** – Un nuevo LED que usa capas apiladas de perovskita brilla más y usa la energía de forma más eficiente al reciclar la luz dentro del dispositivo.",
      "image_url": "public/images/news_image_Highly-efficient-LED-device-built-by-stacking-laye.png",
      "image_prompt": "A warm, detailed painting of several translucent, glowing layered crystals stacked like delicate sheets, each emitting soft, radiant light in gentle pastel hues, set against a simple, natural background that evokes innovation and harmony in clean energy."
    }
  ]
}