{
  "personality": null,
  "timestamp": "2026-01-23T04:58:10.840343",
  "category": "Human Rights",
  "news_summary": "Today's news highlights progress in inclusivity and representation within academia, acknowledging diverse bodies and experiences previously overlooked.",
  "news_summary_fr": "L'actualité d'aujourd'hui met en avant les progrès réalisés en matière d'inclusion et de représentation dans le milieu universitaire, en reconnaissant la diversité des corps et des expériences qui étaient auparavant négligés.",
  "news_summary_es": "Las noticias de hoy destacan los avances en materia de inclusión y representación en el ámbito académico, reconociendo la diversidad de cuerpos y experiencias que antes se pasaban por alto.",
  "articles": [
    {
      "title": "‘Bodies like ours aren’t considered in academia’",
      "summary": "Nature, Published online: 22 January 2026; doi:10.1038/d41586-026-00153-3Two researchers describe how body size and having a disability can challenge perceptions of what a scientist should look like.",
      "content": "Adam Levy 00:00\n\nHello, I’m Adam Levy, and this is Off limits: academia’s taboos, a podcast from Nature Careers. In this episode: excluded bodies.\n\nOften, academia is portrayed as a purely cerebral field, one where the best and brightest brains rise to the top, no matter what.\n\nBut this neglects the significant role our bodies play too, from painstaking experiments for hours in the lab to conducting gruelling field work. And the way academia is set up is not irrespective of our bodies.\n\nFor some, academia can feel alienating, even impossible as a career path, because research isn’t adapted to their needs.\n\nThis can be, as we’ll find out later in the episode, due to physical disability, but it can also be down to size.\n\nDiscrimination based on size is often so taken for granted that it goes entirely undiscussed. But back in 2022 Nature published a careers feature titled The sting of sizeism in the scientific workplace.\n\nTheo Newbold is a PhD student in plant pathology at the Pennsylvania State University in the US who was interviewed for that piece.\n\nI was keen to speak to them further about the challenges of being fat in academia, as well as the response they’d witnessed to this Nature feature.\n\nI started out by asking: moving through academia, do you ever get the sense that colleagues see or treat you differently because you are a scientist of size?\n\nTheo Newbold 01:51\n\nI think so. I really do. But we’re not talking about people coming up to me and, you know, maybe making fun of me or talking directly about my weight.\n\nIt’s more in the lack of thought when decisions are being made. For example, the chairs that are purchased for the lab. One of my advisors was new when I joined, and she had purchased these very cute saddle-type chairs that I did not fit in at all.\n\nIt was almost comical, the level to which I did not fit in these chairs.\n\nShe had never thought that she would have a larger, you know, a fat person or a person of size working in her lab, probably.\n\nI don’t know what her thought process was, but it wasn’t there. So that’s just just one example, but really it’s mostly showing up in ways where people don’t think about fatness in the context of the workplace.\n\nAdam Levy 02:45\n\nAnd when situations like this do come up, is it difficult to resolve them?\n\nIs there an awkwardness in the interaction that leads to resolution? Or do you sometimes avoid resolution?\n\nTheo Newbold 02:58\n\nIt really depends, and I sense a theme that a lot of my answers are going to start with ”It depends.”\n\nBut in the instance of the chair, I was very conveniently comfortable with my advisor.\n\nI’d known this person for a period of time, and so I felt very comfortable advocating for myself, and so I didn’t feel awkward or uncomfortable.\n\nSo it was a very positive interaction. But it’s not always that way unfortunately.\n\nAdam Levy 03:21\n\nCould you maybe give an example of a time when it’s been harder to resolve this kind of this oversight?\n\nTheo Newbold 03:30\n\nYes, instances of not fitting in desks is very, very common.\n\nAnd I don’t think that you have to be someone of substantial size to have this issue, because at least in the States, a lot of the desks are very old, so the gap that one has to squeeze into to sit at most of these desks is very small.\n\nOftentimes, I have to sit in what we call like the ADA-compliant desk, which is the so you can usually put people who use mobility aids can sit there.\n\nBut there has been cases where there is a person with a mobility who needs to use that chair either the situation is very awkward where I have to ask the professor, can I have another chair?\n\nMaybe I don’t, oftentimes I don’t feel very comfortable, especially early on in the course doing that. And so I’ll usually either squeeze myself into the desk and, like, suck my breath as far as I can, and hunch over and like hope that, hope that I, you know, everything’s fine.\n\nOr I sit on the floor.\n\nAnd when they ask me why I’m sitting on the floor, oftentimes, I say, ”Oh, it’s easier for me to focus.”\n\nYou know, rather than focusing on my weight, because there’s, you know, 30 plus people in a room now staring at me, you know. So that’s sort of the instance where things are awkward or uncomfortable, or at least have been for me.\n\nAdam Levy 04:48\n\nWell, how does situations like this impact you and impact your sense of I guess, inclusion within academia?\n\nTheo Newbold 04:57\n\nI think that these particular instances are not unique to academia.\n\nAnd they definitely aren’t something that I will see as being 100% limiting for me, participating in academia.\n\nAnd I say that initially, because the commentary around minorities, talking about instances of discrimination or alienation, is often viewed as, ”Oh, that’s just an inconvenience. You’re just complaining.”t\n\nThese particular things that I deal with are not things that 100% prevent me from, like wanting to stay in academia, but they 100% tell me that this is a space that I am not intended to be in.\n\nThis is a space that I’m having to force myself into and constantly advocate for my needs, because whether it’s structurally things like the desk or the chairs or people’s perceptions of fat people, and the way in which they communicate that, whether that’s directly or indirectly, make me feel like this is not a space that I should be in.\n\nAdam Levy 05:56\n\nDo you get the sense sometimes that people do view you differently then, as an academic?\n\nTheo Newbold 06:03\n\nI think it’s more so when I start to interact with other professionals online.\n\nI’ve definitely seen people make comments about other fat people in their labs or their workplaces, talk about how they wouldn’t hire a fat person because they’re lazy, they won’t be able to fit in the cab of whatever equipment they’re using.\n\nThat has been the commentary that I have come across in sort of the maybe online professional space. And I think that if my colleagues have that view, they have not openly shared it with me, thank goodness.\n\nAdam Levy 06:41\n\nAre these impacts on you, things that you actually speak about, with your colleagues, with your institution?\n\nTheo Newbold 06:44\n\nNo. One of the reasons that I don’t bring it up often is because I don’t want to be seen as the person who’s always complaining.\n\nAnd I say this in my particular respect, because I’m someone who has heavily been involved in diversity, equity, inclusion activities and committees and various things on campus.\n\nAnd so I’m constantly talking about my other identities. I’m constantly talking about, you know, access to science and academia for trans people, for blind and disabled people.\n\nAnd my fatness, because it has been or is something that is so quintessential in my life and that I have learned to make changes, you know, and advocate for myself in those ways, like, I don’t think about bringing it up.\n\nAnd if it comes up, I usually sort of swallow whatever thing I was going to say, Because I don’t want to be perceived as the complaining fat person.\n\nAdam Levy 07:44\n\nNow, you have actually spoken with Nature before through a feature that was published in 2022.\n\nWhat was it like for you to speak out in this capacity?\n\nTheo Newbold 07:54\n\nWhen I was initially reached out to, I thought, ”Wow, this is a fantastic idea. Somebody is talking about this.”\n\nAnd I know that I’m a relatively small portion of that feature, initially sort of talking about my experience around a chemistry lab coat, but from the feature, I’ve definitely seen online commentary that really solidified my need to not talk about it as much in my own professional space. Like for myself.\n\nThere’s a Reddit thread of people talking about the article, and this is one of those places where I heard people talk about, oh, ”I would never hire a fat person.” And specifically with regard to me, they said, ”You know, if you can’t put up with not getting a lab coat, you’re never going to succeed in your PhD. You’re too soft”.\n\nAnd so when I read those comments, and I thought about the fact that, you know, I was just sort of sharing my experience for this article, and the way that it was perceived as being a complaint, rather than about a serious issue that really not only made me feel excluded from my academic space, but also inhibited my ability to, like, do my coursework.\n\nIt made me feel really bad, and it almost made me go quiet, more so, than it may have before.\n\nAdam Levy 09:08\n\nOn the flip side, though, have you, over the years, perhaps in connection to that feature, been able to find any community, any network of people, of academics, going through similar experiences?\n\nTheo Newbold 09:21\n\nI have not.\n\nMy academic space is very much full of straight size people. And if they are heavier people, they’re heavier people who are focused on their weight loss.\n\nAnd so it was about being fat in the moment, and not about their experiences in their fat body in academia and trying to find fat liberation or fat acceptance.\n\nOr, you know, trying to create an environment that was more conducive to them, it was sort of this temporary state of being. And it’s very challenging to find community and talk about issues of living as a fat academic and what we need and the sort of advocacy that we need when people only view their fatness as temporary or as something that they need to get rid of.\n\nAnd I just could never and cannot be in community with people who are in that headspace. Because I’m a fat person, and have been a fat person always.\n\nAnd my fatness is not temporary, and it is the way that I move in the world constantly, whether I am a bigger fat or a smaller fat, I am always fat.\n\nAdam Levy 10:26\n\nWhat you describe, though, Theo, it sounds somewhat isolating. I suppose. You know you’re describing something that impacts you a lot, but don’t have the people in your life you can, you can share that with and just vent with about it?\n\nTheo Newbold 10:41\n\nCertainly that is true. I deal with it in other ways. So I have a fabulous therapist who is very much body-positive and understands a lot of the struggles.\n\nAnd I also turn to other community spaces. So again, I’m trans and disabled, and so I turn to the queer spaces, and I turn to disability activist spaces.\n\nAnd there is always an overlap in the fat experience and the disabled experience.\n\nBecause being fat in spaces that aren’t designed for you is disabling by definition. So I find community in other ways.\n\nAdam Levy 11:17\n\nHow would you want to see academia changing so that the academics of the future don’t have to deal with the things you’ve had to deal with?\n\nTheo Newbold 11:26\n\nPart of that is universal design, which is this concept that everything we do is intended to make things accessible to all people.\n\nSo it’s not just necessarily about my fatness, but it would be around people with mobility concerns or ability to hear or speak or move.\n\nAny of those things.\n\nSo the spaces would be more universally accessible for people.\n\nTalking about fatness as part of physically in the States, we have like DEI or diversity equity inclusion training, where oftentimes it’s focused on things like pronouns, which are beautiful and important, but also talks about things around disability in the classroom.\n\nBut we don’t ever talk about fatness and things that we need to think about or change in our labs or workspaces to make space for fat people.\n\nInstead, fat people are pathologized.\n\nSo if we can stop pathologizing fatness and see it as a state of being in which we need to create spaces where fat people can be. I think then it will be easier for fat people to exist in science and in academia.\n\nAdam Levy 12:35\n\nAnd is there a way you would like academics themselves to change their attitudes or to behave in a way that that made this topic one that people like you would feel more comfortable to bring up?\n\nTheo Newbold 12:48\n\nPart of it is reading. So reading about fat people’s experiences, just like we read about, you know, queer definitions and things like that.\n\nI think also people changing the way they view their relationship with fatness will change the way they interact with their fat colleagues.\n\nBecause if you don’t view your existence in fatness as being temporary or as being something you’re trying to avoid, you will think more about how to make spaces more accessible or inclusive for fat people.\n\nAnd that isn’t just literally having the right chair or having a lab coat. That might be the way that you frame your communication with your mentees.\n\nSo really, a part of it is people reframing how they view fatness. And the best way to start is by reading about fatness, and if you are comfortable and have fat friends or people you are in community with who feel comfortable with their bodies and talking about those issues, talk to them about what makes them feel comfortable. I think that was helpful. Learning from people\n\nAdam Levy 13:54\n\nThat was Theo Newbold. As Theo mentioned, they often encounter situations where it becomes clear that bodies like theirs simply weren’t considered.\n\nAnd that’s an experience that many academics with physical disabilities also encounter, especially when that disability is not immediately apparent to others, what’s often referred to as an invisible disability.\n\nKatharine Hubert is a graduate student at the University of Wisconsin, Madison, where she researches HOX genes, and she also lives with an invisible disability, an experience that she has shared online. I caught up with her to find out what it means to bring visibility to her disability, and we started out by discussing how her disability affects her day-to-day life.\n\nKatharine Hubert 14:43\n\nSo I think like most patients who end up having Ehlers Danlos Syndrome, or EDS, for short, we go on a diagnostic odyssey.\n\nSo for me, that meant around my senior year of high school, seeing doctors for the next six years in an effort to find an answer for a lot of unexplained, seemingly unconnected symptoms, including joint dislocation, chronic pain, autonomic nervous system problems, skin issues, heart issues.\n\nI got diagnosed, actually right after I started grad school.\n\nEhlers Danlos Syndrome is a connective tissue disorder. Connective tissues are the glue that holds your body together, and so for a lot of patients who live with EDS, it means that it’s not just joint dislocations, which is one of the hallmark features, but it also affects your nervous system, your skin, your digestive system, cardiac system, literally everything.\n\nSo in addition to living with the symptoms, actually getting the healthcare needed to function is also costly and time-consuming.\n\nAdam Levy 15:49\n\nI mean, you’ve made it very clear there how EDS affects your day-to-day life. Can you explain a little bit about how it affects the day to day of being a researcher?\n\nKatharine Hubert 15:59\n\nHaving an invisible disability like EDS is a gift and a curse.\n\nI can pass as someone who is able-bodied, which is a huge privilege in academia.\n\nHowever, that said, I also can run into issues getting accommodations that are needed because I don’t, you know, quote, look disabled or don’t appear disabled enough to actually warrant said accommodation.\n\nAdam Levy 16:24\n\nCould you explain a little bit what kind of accommodations that would entail?\n\nKatharine Hubert 16:28\n\nSo for me as a student, that was flexibility with when I could attend class.\n\nSome days I wake up in the morning and I can’t get out of bed. The pain is so intense.\n\nAs a researcher, those accommodations are more so structural support things that enable me to do lab work. And so motorized pipettors, for example, chairs with high support so the neck and the back are supported when you’re doing computer work. But a lot of these I’ve had to develop myself because there’s not a lot of accessible tools in science.\n\nAdam Levy 17:04\n\nAnd you’ve mentioned there that this disability is invisible, meaning that it’s not immediately obvious to the people around you. In what ways has that made it difficult then to get these kinds of accommodations you’re describing?\n\nKatharine Hubert 17:19\n\nI often feel like I need to lead this double life. I feel like a burden for asking, because sometimes I am met with the response of, ”Do you really need this?”\n\nOr the mannerisms by the people you know imply that perhaps they’ve seen me do it on another day, just fine. Why do I need this accommodation now?\n\nI should mention EDS is also highly dynamic. What I can do one day varies by the next day. And so there’s a lot of fear and anxiety in trying to get what I need to be able to succeed, which I think is why I’ve resorted to developing a lot of it on my own and paying for things out of pocket.\n\nAdam Levy 18:01\n\nIs it, then, a topic that you find yourself actively avoiding in certain interactions with, with colleagues, with your institution, for a long time?\n\nKatharine Hubert 18:08\n\nYes. So I don’t know how it works outside of the US.\n\nBut at least here, if you need an accommodation and you’re in the lab, you’re considered an employee and not a student. Therefore you must ask your PI directly to buy whatever it is that you need.\n\nAnd so while my PI has been very supportive, it puts me in an uncomfortable position where I have to ask and feel burdensome for taking some of the lab’s money to get something that maybe I can just push through and do without.\n\nAnd so, yeah, as I alluded to before, I have tried to avoid those types of interactions for that reason.\n\nAdam Levy 18:45\n\nHas it ever felt like dealing with this invisible disability would somehow shut off a career in academia for you?\n\nKatharine Hubert 18:53\n\nYou know, as I’m nearing the end of my graduate studies, I think about this every single day. I wonder if it’s actually feasible.\n\nManaging my health is truly a second full time job. For context, I had 63 doctors appointments last year, not to mention the physical therapy I’m supposed to be doing every night.\n\nIt’s a lot. And academia isn’t really set up in a way to permit that sort of lifestyle and be successful.\n\nAt least, that’s the impression that I have. So while I’m hoping to do a postdoc, I truly wonder if I have a body that will allow me to succeed in this sort of system that we have.\n\nAdam Levy 19:36\n\nAnd while you’re navigating that decision, navigating that system, how do you choose how visible to make your invisible disability, how open to be about it?\n\nKatharine Hubert 19:48\n\nThis is something I decided pretty early on in my graduate career. I realized that if I was going to make it through grad school, I was going to need accommodations.\n\nAnd as someone with an invisible. dynamic disability, I was going to have to be upfront and vocal about what I live with and what I would need.\n\nSo I am very open and visible with my condition, both in the context of our department and on social media. And I think that’s really out of necessity.\n\nI’m privileged in that I have a choice whether or not I share my disability or hide it, but ultimately, I need tools to succeed, and I can’t get those if people don’t know what I have.\n\nAdam Levy 20:31\n\nAnd what’s the kind of impact that this has had on you, to be more open about your invisible disability, to share your experiences, both in person and online?\n\nKatharine Hubert 20:44\n\nYou know, I was really nervous to do so initially.\n\nAnd truly, my online presence kind of happened by accident.\n\nMy accounts are @cripple_vs_stem and I picked a pretty bold name to draw attention to the fact that it’s not easy to navigate STEM fields with a disability.\n\nEvery day feels like a fight to be here.\n\nBut I’ve been tremendously surprised by the positive reactions I’ve gotten from these accounts, especially from scientists who identify as able-bodied, being excited about these tools, I call them, lab adaptations, that I share, and how so many people who identify as able bodied say, ”Man, I wish I had this when I was in grad school.” Or ”This would have helped me reduce the pain from all that pipetting.”\n\nIt feels good.\n\nAdam Levy 21:33\n\nIn the future, you know, you’ve described that you’re worried that academia is set up in a way that wouldn’t really be able to accommodate someone living with EDS like you.\n\nHow would you imagine an academia that would be better at accommodating people, regardless of disability?\n\nKatharine Hubert 21:51\n\nSo here in the States, only in the past 10 years, especially the past five since I’ve been a grad student, have I really seen there be any discourse on disability in academia.\n\nAnd that was really lacking for a long time. And since then, I’ve seen positive shifts in conferences that I’ve attended where captioning, you know, (of course, at larger conferences), but captioning is now a part of all presentations.\n\nThere’s lactation rooms available, there’s prayer rooms available, there’s maps for accessibility and where to find the wheelchair-accessible entrances.\n\nYou know, as a scientific community, we’re moving in that direction. But outside of the conference setting, in the actual day to day lab spaces, it’s still an afterthought, I guess that’s what I’m saying.\n\nNo one’s really designing labs with ergonomics or accessibility in mind. The work expectation is usually not such that it accommodates health-related issues, at least that’s been my experience here.\n\nYou know, this pressure to work 12 hour days, to push, push, push, get data, data, data, and some bodies just physically can’t handle that. mine included,\n\nI don’t know how to fix that, though. That’s kind of how academia has always been here. There’d be a lot to change.\n\nAdam Levy 23:17\n\nAnd for people listening who identify as able-bodied, what would you like to see them do so that they can be more supportive and maybe more open to their colleagues who are dealing with invisible disability?\n\nKatharine Hubert 23:32\n\nI think some very simple things are for departmental events or seminars, you know, including things like captioning or an RSV form, an RSV form having a section where you can write down any accommodations you need to be able to attend this event.\n\nThose two things take relatively little effort, but do a lot to make people with disabilities, especially invisible disabilities, feel included in these events, and not as an afterthought.\n\nIn the lab setting I’m a big proponent of having some of these lab adaptations that I found just available and accessible.\n\nAs I said, I’ve bought most of them so they’re relatively inexpensive tools that really are just improving the ergonomics of lab work, and so have the potential to benefit most everyone who uses them.\n\nThings like an Eppendorf tube opener, which reduces thumb strain from repeatedly opening those small, tiny tubes.\n\nBut by having these tools accessible and available in the lab, you’re reducing the stigma associated with using them. You know, it’s not just an exclusionary thing that only people with disabilities can use if everyone’s using them.\n\nAnd then, more broadly, I’d say, I guess, if you work with a colleague who identifies as having an invisible disability, and they’ve disclosed this to you, my lab mates in particular have been great in listening and trying to understand what I experience, and always jumping in if I need help with mouse work, for example.\n\nSo I think being receptive and doing a little bit of work on your own to understand would go a long way in making someone feel included in like, they could succeed in this sort of environment.\n\nAdam Levy 25:18\n\nKatharine Hubert there.\n\nNext week, we’ll be looking at a subject that is dear to many researchers hearts, but that is seen by others as fundamentally incompatible with scientific research: religious faith.\n\nSpeaker 3 25:23\n\nReligious scientists do feel like they have to hide their faith often.\n\nAdam Levy: 25:30\n\nUntil then, this has been Off limits: academia’s taboos, a podcast from Nature Careers. Thanks for listening. I’m Adam Levy.",
      "url": "https://www.nature.com/articles/d41586-026-00153-3",
      "source": "Nature",
      "published": "2026-01-23",
      "sentiment_score": 0.75,
      "reasoning": "The article highlights the challenges faced by academics with disabilities and non-normative body sizes, emphasizing the need for inclusivity and universal design in academia. It brings attention to systemic barriers and advocates for structural changes that would benefit a broad range of people, fostering a more equitable academic environment. The detailed personal experiences and calls for change provide substantive context and inspire hope for progress in accessibility and acceptance.",
      "category": "Human Rights",
      "personality_title": "Academics with disabilities and diverse bodies call for more inclusive university spaces",
      "personality_presentation": "**Context** – Academia is often seen as a place where only brainpower matters, but physical needs and body differences are often overlooked. Many researchers with disabilities or larger bodies face challenges because labs and classrooms are not designed for everyone.\n\n**What happened** – Two researchers, Theo Newbold and Katharine Hubert, shared their personal experiences with size discrimination and invisible disability in academic settings. Theo, a PhD student, described how lab furniture and equipment often don’t fit larger bodies, making daily tasks uncomfortable and exclusionary. Katharine, who has Ehlers Danlos Syndrome (EDS), an invisible connective tissue disorder, explained how she struggles to get accommodations because her disability isn’t obvious to others.\n\n**Impact** – Their stories reveal how academic spaces unintentionally exclude people with different bodies or disabilities. This exclusion can make researchers feel unwelcome or force them to hide their needs. For example, Theo often has to squeeze into desks or sit on the floor to avoid drawing attention to their size. Katharine faces the challenge of convincing others she needs support despite looking able-bodied. These barriers slow down their work and affect their sense of belonging.\n\n**What's next step** – Both researchers suggest adopting universal design principles, meaning academic spaces and tools should be created to fit everyone from the start. They also encourage open conversations about body diversity and disability, including training that covers size and invisible disabilities. Making accommodations like supportive chairs, ergonomic tools, and flexible schedules more common can help. Building communities where people feel comfortable sharing their experiences is also important.\n\n**One-sentence takeaway** – Academics like Theo and Katharine show that making universities more accessible to all body types and disabilities requires thoughtful design, open dialogue, and better support systems.\n",
      "personality_title_fr": "Des universitaires avec des handicaps et des corps divers réclament des espaces universitaires plus inclusifs",
      "personality_presentation_fr": "**Contexte** – L’université est souvent vue comme un lieu où seule l’intelligence compte, mais les besoins physiques et les différences corporelles sont souvent ignorés. De nombreux chercheurs avec un handicap ou un corps plus grand rencontrent des difficultés car les laboratoires et salles de classe ne sont pas conçus pour tout le monde.\n\n**Ce qui s’est passé** – Deux chercheurs, Theo Newbold et Katharine Hubert, ont partagé leurs expériences personnelles de discrimination liée à la taille et au handicap invisible dans le milieu académique. Theo, doctorant, a expliqué que le mobilier et le matériel de laboratoire ne conviennent souvent pas aux corps plus larges, rendant les tâches quotidiennes inconfortables et excluantes. Katharine, atteinte du syndrome d’Ehlers Danlos (EDS), un trouble du tissu conjonctif invisible, a raconté ses difficultés à obtenir des aménagements car son handicap n’est pas visible.\n\n**Impact** – Leurs récits montrent comment les espaces académiques excluent involontairement les personnes avec des corps ou des handicaps différents. Cette exclusion peut donner le sentiment de ne pas être le bienvenu ou obliger à cacher ses besoins. Par exemple, Theo doit souvent se glisser dans des bureaux trop petits ou s’asseoir par terre pour ne pas attirer l’attention sur sa taille. Katharine doit convaincre les autres qu’elle a besoin de soutien malgré son apparence valide. Ces obstacles ralentissent leur travail et affectent leur sentiment d’appartenance.\n\n**Prochaines étapes** – Les deux chercheurs suggèrent d’adopter des principes de conception universelle, c’est-à-dire créer les espaces et outils académiques dès le départ pour qu’ils conviennent à tous. Ils encouragent aussi à parler ouvertement de la diversité corporelle et du handicap, avec des formations incluant la taille et les handicaps invisibles. Rendre plus courants des aménagements comme des chaises de soutien, des outils ergonomiques et des horaires flexibles aiderait beaucoup. Construire des communautés où l’on peut partager ses expériences est aussi essentiel.\n\n**En une phrase** – Theo et Katharine montrent qu’un université accessible à tous les corps et handicaps demande une conception réfléchie, un dialogue ouvert et un meilleur soutien.\n",
      "personality_title_es": "Académicos con discapacidades y cuerpos diversos piden espacios universitarios más inclusivos",
      "personality_presentation_es": "**Contexto** – La academia suele verse como un lugar donde solo importa la inteligencia, pero las necesidades físicas y las diferencias corporales a menudo se ignoran. Muchos investigadores con discapacidades o cuerpos más grandes enfrentan dificultades porque los laboratorios y aulas no están diseñados para todos.\n\n**Qué pasó** – Dos investigadores, Theo Newbold y Katharine Hubert, compartieron sus experiencias personales con la discriminación por tamaño y discapacidad invisible en entornos académicos. Theo, estudiante de doctorado, explicó que el mobiliario y el equipo de laboratorio a menudo no se ajustan a cuerpos más grandes, haciendo que las tareas diarias sean incómodas y excluyentes. Katharine, que tiene Síndrome de Ehlers Danlos (EDS), un trastorno invisible del tejido conectivo, contó cómo lucha por obtener adaptaciones porque su discapacidad no es visible para otros.\n\n**Impacto** – Sus historias muestran cómo los espacios académicos excluyen sin querer a personas con diferentes cuerpos o discapacidades. Esta exclusión puede hacer que los investigadores se sientan no bienvenidos o que tengan que ocultar sus necesidades. Por ejemplo, Theo a menudo tiene que meterse en escritorios pequeños o sentarse en el suelo para no llamar la atención sobre su tamaño. Katharine enfrenta el desafío de convencer a otros de que necesita apoyo a pesar de parecer sin discapacidad. Estas barreras ralentizan su trabajo y afectan su sentido de pertenencia.\n\n**Próximos pasos** – Ambos investigadores sugieren adoptar principios de diseño universal, es decir, crear espacios y herramientas académicas que sirvan para todos desde el inicio. También animan a mantener conversaciones abiertas sobre la diversidad corporal y la discapacidad, incluyendo capacitaciones que aborden el tamaño y las discapacidades invisibles. Facilitar adaptaciones como sillas ergonómicas, herramientas de laboratorio accesibles y horarios flexibles puede ayudar mucho. Crear comunidades donde las personas se sientan cómodas compartiendo sus experiencias es importante.\n\n**Una frase clave** – Theo y Katharine demuestran que hacer las universidades accesibles para todos los cuerpos y discapacidades requiere diseño cuidadoso, diálogo abierto y mejores sistemas de apoyo.\n",
      "image_url": "public/images/news_image_Bodies-like-ours-arent-considered-in-academia.png",
      "image_prompt": "A cozy, warmly lit academic laboratory scene featuring a variety of thoughtfully designed chairs and adjustable desks arranged around scientific equipment, with subtle outlines of diverse body shapes symbolized by soft, abstract forms comfortably integrated into the workspace, alongside gentle representations of invisible support tools like motorized pipettors and ergonomic aids, all rendered in natural, muted earth tones to evoke inclusivity and accessibility."
    }
  ]
}