{
  "personality": null,
  "timestamp": "2026-01-22T05:05:53.885874",
  "category": "Technology",
  "news_summary": "Today's technology news highlights advancements in genetic engineering, breakthroughs in material science, innovative aerospace fuel-saving technologies, and progressive telecom reforms promoting enhanced connectivity and competition.",
  "news_summary_fr": "L'actualité technologique d'aujourd'hui met en avant les progrès réalisés dans le domaine du génie génétique, les avancées dans la science des matériaux, les technologies innovantes permettant d'économiser du carburant dans le secteur aérospatial et les réformes progressistes dans le domaine des télécommunications qui favorisent une meilleure connectivité et une concurrence accrue.",
  "news_summary_es": "Las noticias tecnológicas de hoy destacan los avances en ingeniería genética, los descubrimientos en ciencia de los materiales, las innovadoras tecnologías aeroespaciales para ahorrar combustible y las reformas progresivas en telecomunicaciones que promueven una mayor conectividad y competencia.",
  "articles": [
    {
      "title": "Construction of complex and diverse DNA sequences using DNA three-way junctions",
      "summary": "Nature, Published online: 21 January 2026; doi:10.1038/s41586-025-10006-0Sidewinder enables high-fidelity DNA assembly by separating the information that guides assembly from the final assembled sequence.",
      "content": "Fragment design\n\nWhen starting from DNA oligos, the number of junctions needed to assemble a construct depends on the length of the construct and the length of the starting oligos being used. A list of all of the component oligos that compose the Sidewinder fragments used in these experiments is provided in Supplementary Table 1. For an oligo of length L, the maximum bases of coding information for a fragment composed from these oligos (L c ) is L − 2L b , where L b is the length of the barcode. Toeholds are then chosen starting maximally from L c bases away from the previous junction. Hand-designed assemblies standardly use the maximal length fragments and use toeholds from position L c –10 to L c but can be shifted to avoid unintended toehold secondary structure. NUPACK-designed assemblies choose a 10-base toehold within the range of position L c −25 to L c with an ensemble defect of <0.1 from a secondary-structure-free toehold.\n\nWe tested a range of toehold lengths and designs, varying the ligation site from −10 bases to +10 bases on either side of the Sidewinder helix. We found effective ligation occurring equal to or further than ±6 bases from the Sidewinder helix (Extended Data Fig. 2a,b). This led us to standardize the toehold length to 10 bases for the experiments described in this paper as to ensure sufficient distance of the nick from the Sidewinder helix to accommodate ligase docking and effective ligation.\n\nBarcodes were designed to be compatible with their respective toehold after the location of the junction is chosen. Barcode sequences were chosen or generated on the basis of the predicted secondary structure and crosstalk between other toehold–barcode sequences at the assembly’s ligation temperature. The h-fibroin and parallel assembly barcodes were designed using a guess–check method, choosing from a set list of pregenerated orthogonal barcodes15. Starting with the first toehold, a barcode sequence is arbitrarily chosen (‘guess’) and appended to the 3′ end of the toehold and checked for secondary structure at 50 °C with complex size 2 using the NUPACK web browser16,17 (‘check’). The subsequent barcodes are then chosen from the pregenerated list, checked individually in the same manner, then checked for cross reactivity against all previously chosen toehold-barcode sense and antisense sequences at 50 °C and complex size 2. All barcodes in this study use natural bases but we anticipate that the specificity and diversity of Sidewinder barcodes can be expanded to include unnatural bases and other DNA nanotechnology interactions.\n\nThe 5-to-40-piece Lux assemblies, the APOE assembly and the library assembly had bespoke barcode sequences generated for the specific assembly using NUPACK Python package16. Target strand (NUPACK variable) secondary structure was defined to be fully unpaired for each single stranded barcode/toehold pair combination. Complexes (NUPACK variable) were defined to take on the desired 3WJ structure for barcode/toeholds. Step tubes (NUPACK variable) are defined such that, in step 0, individual barcode/toehold sequences take on the desired unpaired secondary structure before assembly; and, in step 1, barcode/toehold sequences pair with the intended assembly partner during assembly at 50 °C with an ensemble defect of <0.1. After barcode generation, all secondary structures and the cross-reactivity of chosen barcodes were checked using the NUPACK web browser16,17.\n\nFor the length of the Sidewinder barcodes, we tested barcode lengths from 15 to 21 bases, both with and without a T–T or U–U mismatch at the base of the 3WJ for added stability46 and neither seem to have bearing on ligation efficiency (Supplementary Table 1). We also tested a variety of commercially available ligases and found high variability in ligation efficiency at −10 bases from the Sidewinder helix across the ligases tested (Extended Data Fig. 2c). Of the various ligases tested, Taq ligase and HiFi Taq ligase were picked as the preferred ligases due to their efficiency of ligation at the 3WJ and stability at extremely high temperatures.\n\nOligo purchasing\n\nAll assembly oligos were purchased from Millipore-Sigma with standard DNA synthesis for DNA oligos in tubes, which has a max oligo length of 120 bases. The only exception was fragment 4 of the identical toehold assembly, which was ordered as a long oligo to enable four identical toeholds (Supplementary Table 1). Barcode oligos were ordered with standard desalt purification and coding oligos were ordered PAGE purified, but this has since been seen to be superfluous (Extended Data Fig. 3f). Both barcode and coding oligos for the fluorescent protein library were ordered with cartridge purification. Both barcode and coding oligos for the Sidewinder characterization in Fig. 1 were ordered PAGE purified. PCR amplification primers were ordered from Integrated DNA Technologies with standard desalt purity. All oligos are listed in Supplementary Table 1. All Sidewinder component oligos were shipped dry.\n\nHeteroduplex annealing\n\nOligos are suspended by hand in 1× TE buffer at pH 8.0 (Corning, Thermo Fisher Scientific) to a final concentration of 100 μM on the basis of the manufacturer’s reported weight. To ensure adequate resuspension of the dried oligos, if the volume required to for a final concentration of 100 μM was less than 50 μl of TE buffer according to the manufacturer’s reported weight, the oligos would be resuspended in a volume of 50 μl of buffer, resulting in a lower final concertation. The concentration of all oligos was additionally measured using the Qubit ssDNA Assay Kit (Invitrogen, Thermo Fisher Scientific) and final concentration calculations were based on these measurements.\n\nSidewinder fragments are generated from resuspended stock oligos by annealing coding oligo to the barcode oligo to form a heteroduplex. To prepare the Sidewinder fragment, the volume of coding oligo required for 2 µM in a 50 µl reaction is first phosphorylated alone in a 25 μl reaction using 1 μl of T4PNK (New England Biolabs) in 1× T4 ligase buffer at 37 °C for 1 h, followed by an enzyme deactivation at 80 °C for 10 min. The corresponding volume of stock barcode oligo needed for 1 μM in 50 μl is then added to the phosphorylated coding oligo and the final volume is topped off to 50 μl using 1× T4 ligase buffer.\n\nHeteroduplexes are then annealed together in a PCR tube consisting of an initial denaturation of 98 °C for 10 min, followed by a gradual decrease in temperature down to 25 °C at −1 °C min−1. Once fragments are annealed, they are kept at 4 °C until use and have been stably used months after initial heteroduplex formation.\n\nHeteroduplex gel extraction\n\nPAGE gel extraction of annealed heteroduplexes is performed using 8% TBE gel (Invitrogen, Thermo Fisher Scientific) and run at 200 V for 35 min. Gel extraction was performed according to a published DNA nanotechnology protocol47.\n\nSidewinder assembly conditions\n\nProcessed Sidewinder fragments are combined into a single reaction mix at equimolar concentrations at around 1 nM to conduct the Sidewinder assembly. We used two avenues for the assembly conditions for the Sidewinder assembly. The assemblies were conducted in 70 μl reactions in 1× HiFi Taq buffer (New England Biolabs). For all assemblies except for the h-fibroin assembly, we used a cycling protocol of 85 °C for 5 min, followed by the addition of 2.8 μl of HiFi Taq ligase (New England Biolabs), then the reaction then cycles between 85 °C for 1 min and 50 °C for 2 min for 100 cycles. These cycles are then followed by 50 °C for 1 h. The second assembly protocol that was used for the h-fibroin assembly was as follows: 13 nM fragments in a 70 μl reaction in 1× HiFi Taq buffer (New England Biolabs) at 85 °C for 5 min, followed by cooling at a rate of −0.1 °C per 6 s down to 50 °C, followed by addition of 2.8 μl of HiFi Taq ligase and then incubation overnight at 50 °C. The Sidewinder characterization assemblies in Fig. 1 were also conducted using the second assembly protocol, with a ramp down to a ligation temperature of 72 °C.\n\nThe reactions that characterized choice of ligase and toehold length (Extended Data Fig. 2) used the non-cycling assembly protocol at a ligation temperature according to manufacturer’s recommendation in the corresponding ligase buffer.\n\nConventional assembly comparison conditions\n\nFragments for the 4 bp 2WJ, 10 bp 2WJ and Gibson assemblies were generated using oligos. The 4 bp 2WJ and 10 bp 2WJ used the same coding oligo sequence as the corresponding fragment in the Sidewinder assembly. A new complementary oligo was ordered to generate the desired overhangs: a 10 bp 2WJ complement oligo was designed by removing the barcode sequences from the barcode oligo. 4 bp 2WJ was designed to use the terminal 4 bases of the Sidewinder toehold. Gibson oligos were designed to compose an analogous segment with 20 bp of homology to the partner fragment on either end. PCA does not conduct assemblies using fragments but, instead, uses individual oligos that were designed with 20 bases of overlap to the partnered oligo (Extended Data Fig. 3a).\n\nThe 4 bp 2WJ, 10 bp 2WJ and Gibson oligos were processed to mirror the Sidewinder fragment processing. Oligos were mixed at an equal 1 µM ratio, both oligos were phosphorylated with T4 PNK (New England Biolabs) in a 50 µl reaction in 1× T4 Ligase buffer (New England Biolabs) and then annealed. Gibson oligos are not phosphorylated. The fragments were PAGE-extracted and the concentrations were measured using the Qubit 1× dsDNA High Sensitivity Assay Kit (Invitrogen, Thermo Fisher Scientific).\n\nThe fragments were assembled at the same concentration of the corresponding Sidewinder assembly. The 4 bp 2WJ and 10 bp 2WJ were assembled at 16 °C overnight in 1× T4 ligase buffer with 1 µl T4 Ligase according to the manufacturer’s recommendations for ligating sticky ends (New England Biolabs). Gibson assembly is conducted at 50 °C for 1 h using NEBuilder HiFi DNA assembly Master Mix (NEB). PCA was preformed using PrimeSTAR GXL Polymerase (Takara Bio) under a published protocol that was demonstrated to be optimized for multifragment assemblies48.\n\nPCR amplification and purification\n\nEither PrimeSTAR GXL Polymerase or repliQa HiFi ToughMix (Quantabio) was used for amplification of 3WJ assemblies. Only 1 μl of unpurified 3WJ assembly from the previous ligation step is sufficient template in a 50 μl PCR reaction. PCR reaction conditions were established according to manufacturer recommendations and predicted T m of primers.\n\nPost PCR amplification, purification of the PCR reaction was done using a QIAquick PCR Purification Kit (Qiagen). Multiple 50 μl PCR reactions can be passed simultaneously through the same purification column to increase the final concentration of the purified 2WJ assembly. Alternatively, gel extraction of the target band can be done. Gel extraction results in an even more highly pure product for downstream sequencing or cloning, as seen with the high-GC assembly (Source data). Gel extraction carried out before sequencing for all assemblies, except for the parallel assembly. The Monarch DNA Gel Extraction Kit (New England Biolabs) was used according to the manufacturer’s protocol.\n\nDNA gel imaging\n\nThe Sidewinder characterization gel in Fig. 1 is a 6% TBE-urea denature gel (Novex, Thermo Fisher Scientific) run at a constant 180 V for 30 min in 1× TBE buffer. The samples were mixed with an equal volume of 2× stain free TBE-urea loading buffer and heat shocked at 90 °C for 15 min before loading gel.\n\nAll other gel images are 1–2% agarose gels stained with Sybr Safe (Invitrogen, Thermo Fisher Scientific) run at 135 V for 25 min in 0.5× TBE buffer. The 1 kb+ ladder (New England Biolabs) was used in Figs. 2, 3b, 4 and 5. The low molecular mass ladder (New England Biolabs) was used in Fig. 3e. All main figure agarose gels show 50 ng DNA loaded into each lane as measured using the Qubit 1x dsDNA High Sensitivity Assay Kit (Invitrogen, Thermo Fisher Scientific). 4 bp 2WJ, 10 bp 2WJ and Gibson lanes depict 1 µl loaded, as amplification was insufficient to produce 50 ng after purification in some cases.\n\nCloning and transformation\n\nSidewinder constructs to be expressed in bacteria were amplified using dU containing primers and repliQa polymerase (QuantaBio). The corresponding vectors were amplified using dU containing primers. The purified products were treated with 1 μl USER (New England Biolabs) in 1× CutSmart buffer and subsequently repurified with PCR Kleen Purification Spin Column (Bio-Rad) and assembled according to published protocols49 in 1× T4 ligase buffer and 2.5 µl T4 ligase. In total, 2 μl of assembled product was electroporated into electrocompetent DH10b cells, recovered in 2 ml Luria–Bertani (LB) medium for 1 h, and plated onto LB-agar plates with the corresponding antibiotics.\n\nAll final constructs can be found in FASTA format in Supplementary Table 2.\n\nSequencing analysis\n\nThe final assemblies were processed as described and the purified samples were used for sequencing. Oxford Nanopore Sequencing was used to obtain long, full-molecule reads required to determine the percentage of complete 3WJ assemblies for Figs. 2–4. PacBio sequencing was used to get high-confidence per-base whole-molecule sequencing for the Sidewinder Library in Fig. 5.\n\nAssemblies validated through Nanopore sequencing used Plasmidsaurus Premium PCR Sequencing services. Assemblies validated through PacBio used Azenta sequencing services. To validate our analysis pipeline, each individual raw read for the Sidewinder 40-piece assembly was viewed and assigned manually, enabling us to know the exact identity of each read without any pre-bias due to filtering. For each of the subsequent assemblies, the verified fragment level analysis pipeline is used to generate the pie charts. In this pipeline, read sequences were aligned to fragment references using BLASTn, in which every read was aligned to every fragment reference. The read is assigned as unusable if no hits to any fragment are returned. A correct assembly was assigned when all fragments were in the correct order of the gene sequence. Correct assemblies with all fragments were deemed to be complete, whereas those with not all fragments were deemed to be partial. For Nanopore, all of the remaining reads were checked manually to determine the nature of the assembly. Raw counts can be viewed in the Source data.\n\nThe fragment-level analysis has reads sorted into four main categories. A Sidewinder product is a construct that results from the ligation of the toeholds at the 3WJ, characterized by a seamless sequence transition between the 5′ end of one fragment and the 3′ end of another fragment. A correct assembly is a seamless transition between all partnered fragments in the correct order, whereas an incorrect assembly is the seamless transition between non-partnered fragments. In addition to Sidewinder products, PCR artifacts and sequencing artifacts would be expected. PCR artifacts result from mispriming during PCR. These are identified by the sequence transition between two non-partnered fragments joined, not at the assembly junction, but instead at the internal portion of one of the fragments, indicating that a primer or unreacted fragment oligo misprimed and was elongated during PCR (Extended Data Fig. 4a,b). Mispriming can be reduced by biasing the PCR template towards a higher proportion of full-length 3WJ assembly, as well as by using alternative methods for removing the 3WJ that do not depend on PCR amplification (Extended Data Fig. 5a,b). Sequencing artifacts are due to systematic failures in base calling or sequencing preparation procedure that would not result from assembly. Lastly, in protocols in which the barcode oligo is also phosphorylated, we see barcode artifacts where, at a low frequency, the ends of the 3WJ become unintentionally ligated to itself and appear in the final sequence.\n\nFor the junction analysis checks, using the same datasets, we conducted an analysis specifically on the junction areas in the reads. A junction is defined as 25 base pairs of both the 3′ and 5′ ends of a Sidewinder junction. For the PacBio data, the number was chosen to be 18 base pairs to avoid degenerate bases being included in junctions. For each sequencing run, we generated a list of all possible Sidewinder junctions, including results of both correct and incorrect ligations, and aligned them to the raw fastq files through BLASTn using sensitive parameters (task=blastn_short -word_size 7 -reward 1 -penalty -3 -gapopen 5 -gapextend 2). The resulting junctions were filtered with bitscore thresholds that were chosen to avoid false-positive BLAST hits while maximally retaining possible misligations. Reads containing misligations are collected and examined manually to verify whether they are true misligations or false positives. The junctions for all sequencing runs were generated and analysed as described above and visualized using custom Python scripts. All junction connections are available in the Source data.\n\nFurther analysis of the PacBio sequencing data was conducted to achieve base-level resolution for single-nucleotide polymorphism and diversity analysis of the Sidewinder library. The reads were aligned to reference sequences using the Smith–Waterman algorithm from EMBOSS50 with a match score of 5, mismatch penalty of 4, gap open penalty of 10 and a gap extend penalty of 0.5. To characterize gene-level mutation profiles, reads with incorrect lengths (±20 bp from reference sequence), reads with missing fragments or reads not aligned with target sequence reference are removed from this analysis. Only reads with an average phred score of Q39.5 or above were retained for this downstream analysis and only bases with a phred score of Q40 were included for base-level mutation analysis to minimize errors introduced during sequencing.\n\nLibrary construction\n\nA sequence of 11 N-degenerate bases was placed before the promoter on the first fragment in the assembly to be able to track individual constructs with defined mutation profiles throughout the assembly, sequencing and transformation. This sequence appears only in the coding oligo and does not have a complement in the barcode oligo.\n\nTo ensure efficient retention of diversity required for library construction provided by degenerate bases and additional coding oligos, the library construction was done using a modified protocol prior to assembly. Both barcode oligos and coding oligos were ordered using cartridge purification but otherwise oligo processing followed the same protocol as for other assemblies. For fragments that require multiple coding oligos to cover all mutation profiles, oligos are processed and fragments are annealed in their own tube as if they were distinct fragments. After heteroduplex formation, fragments are not PAGE extracted. The final fragment concentrations are assumed to be the same across each of the fragments at 1 μM heteroduplex. Equimolar fragment concentrations are used in the final Sidewinder assembly. To achieve this, analogous fragments (that is, all F4 fragments with each different coding oligo) are mixed immediately before assembly into a single tube, vortexed, spun down and then this pool is treated as an individual fragment to be added to the assembly mix. Assembly and amplification are then carried out as described.\n\nPre-clonal sequencing was performed using purified amplicon of the final assembled product. Post-clonal sequencing was conducted by cloning the Sidewinder library assembly as described in the ‘Cloning and transformation’ section. The post-recovery culture was then grown overnight in 500 ml LB with 20 µg ml−1 chloramphenicol. The overnight culture was then miniprepped in batches 10 ml and each elution pooled and sent for sequencing.\n\nLibrary data presentation\n\nEmpirical codon-level mutation profile ratios were determined by calculating the ratio between bases associated with the specified codon choices. The average absolute deviation was calculated by taking the absolute value of the difference between the empirical proportion a codon appears from the theoretical proportion and averaging this difference for all 37 codon options in the library Fig. 5g.\n\nLibrary coverage was determined by considering the identity of mutated positions for all 17 positions in the gene and assigning this combination to one of the 442,368 variants. To calculate the coverage of every possible combination of N mutants depicted in Fig. 5k, we first determined the number of ways in which we could combine any number of mutation positions. For example, there are 643 ways to combine any 2 mutation positions in this library, 6,971 ways for 3 mutation positions and so on. We then calculated how many of these possible combinations were seen for every N 1–17, where 17 is the coverage for the entire gene library with 442,368 possible variations.\n\nCombinatorial fluorescence library screening\n\nThe combinatorial library generated using Sidewinder to introduce mutations into functional protein assemblies was screened by encapsulating transformed clones into hydrogel microparticles using a droplet generator. These encapsulated clones were subsequently analysed using the SONY SH800S FACS system, equipped with four excitation lasers (405 nm, 488 nm, 561 nm and 638 nm) and six detectors capable of detecting emissions ranging from 400 nm to 780 nm. Sorting conditions were optimized by adjusting the gain settings, with the forward scatter set to 1% and the back scatter set to 25%. Detector gain was set to 25% for all channels, except for the FL1 and FL4 channels, which were adjusted to 30%. The sort delay was calibrated to 14 before initiating sorting. Colonies encapsulated in hydrogels were suspended in phosphate-buffered saline pH 7.4 (Gibco, Thermo Fisher Scientific) and analysed at a sample pressure of 4, with an event speed ranging from 200 to 300 events per second. Populations were gated on the basis of their spectral properties and sorted into individual wells of 96-well plates for subsequent expansion and spectral characterization.\n\nWe screened over 300 of these sorted clones using a monochromator on the Tecan Infinite 200 Pro using a three-dimensional fluorescence intensity scan from excitation 250 nm to 600 nm and emission from 400 nm to 700 nm. We then chose six clones with potentially unique spectra and cloned them into an p15a pT7 vector and cloned into pTac T7 polymerase strain. The clones were induced overnight in 3 ml at 100 µM IPTG and 10 µg ml−1 tetracycline, centrifuged and resuspended in 50 μl 1× PBS. The final excitation spectra were captured with emission at 560 nm or 620 nm, and excitation from 300 nm to 520 nm or from 400 nm to 580 nm, respectively. The final emission spectra were captured with excitation at either 420 nm or 460 nm, and emission from 460 nm to 680 nm or from 460 nm to 624 nm, respectively.\n\nOvernight cultures grown at 3 ml at 100 µM IPTG and 10 µg ml−1 tetracycline were optical density (OD) normalized to OD 0.2 and 2 μl was spotted onto 100 µM IPTG and 10 µg ml−1 tetracycline LB agar plates. Images were obtained using FITC (470 nm and 525 nm) and TRTC (530 nm and 605 nm) overlayed with Trans on an ECHO Revolve microscope.\n\nStatistics and reproducibility\n\nThe experiments depicted were replicated for reproducibility yielding similar results. The ligation in Fig. 1c was repeated three times. The PCA assemblies in Fig. 2c was repeated three times and the Sidewinder assemblies repeated six times. The Sidewinder assembly in Fig. 3b was repeated six times. The Sidewinder assembly in Fig. 3f was repeated four times. The Sidewinder assembly in Fig. 4b was repeated five times. The Sidewinder assembly in Fig. 5c was repeated four times. The ligation in Extended Data Fig. 2a was repeated twice. The ligation in Extended Data Fig. 2b was repeated three times. The Sidewinder assemblies in Extended Data Fig. 2c were repeated twice. The assemblies using conventional technology in Extended Data Fig. 3d were repeated three times. The PCA assemblies in Extended Data Fig. 3e were repeated twice and the Sidewinder assemblies were repeated three times. The Sidewinder assembly in Extended Data Fig. 3f was repeated twice. The digestion of the 3WJ in Extended Data Fig. 5b was repeated twice. The assemblies using conventional technology in Extended Data Fig. 6b and Extended Data Fig. 6c were repeated three times. The transformation of Extended Data Fig. 7a was repeated twice with the 56 non-coloured clones presented screened from one transformation. In Extended Data Fig. 10d multiple 96-well plates were initially screened with 12 samples recloned into an inducible backbone as described. The displayed clones were chosen to represent the diversity of spectra captured. The gel images included are representative of the experiments.\n\nReporting summary\n\nFurther information on research design is available in the Nature Portfolio Reporting Summary linked to this article.",
      "url": "https://www.nature.com/articles/s41586-025-10006-0",
      "source": "Nature",
      "published": "2026-01-22",
      "sentiment_score": 0.85,
      "reasoning": "The article reports a significant scientific breakthrough in DNA assembly technology using DNA three-way junctions (Sidewinder), enabling high-fidelity, complex, and diverse DNA sequence construction. This advancement has broad implications for biotechnology, synthetic biology, and genetic engineering, potentially accelerating research and applications in medicine, bioengineering, and related fields. The article provides detailed methodology, validation, and sequencing analysis, demonstrating substance and clear real-world impact beyond a niche audience.",
      "category": "Technology",
      "personality_title": "New DNA assembly method builds complex genetic sequences with high accuracy",
      "personality_presentation": "**Context** – Scientists need ways to put together long and complex DNA sequences accurately for research and biotechnology. Existing methods can struggle with errors or limits on how much DNA can be assembled at once.\n\n**What happened** – Researchers developed a new technique called Sidewinder that uses DNA three-way junctions (3WJ) to assemble DNA pieces. This method separates the instructions for joining pieces from the final DNA sequence, allowing precise and reliable construction of complex DNA. They tested different designs and enzymes to find the best conditions, and used advanced DNA sequencing to confirm the accuracy of their assemblies.\n\n**Impact** – Sidewinder can build long and diverse DNA sequences with fewer mistakes than older methods. This makes it easier to create DNA libraries with many variations, useful for studying genes or making new proteins. The method works well even for complicated DNA and can speed up genetic research and engineering.\n\n**What's next step** – Scientists plan to use Sidewinder to create larger DNA libraries and explore new proteins and genetic functions. The method might be expanded by adding new chemical bases to the DNA pieces, increasing its versatility. It could also be adapted for use in more labs and in practical applications like medicine or bioengineering.\n\n**One-sentence takeaway** – The Sidewinder method offers a precise and flexible way to assemble complex DNA sequences, opening new possibilities for genetic research and biotechnology.",
      "personality_title_fr": "Une nouvelle méthode assemble des séquences d'ADN complexes avec une grande précision",
      "personality_presentation_fr": "**Contexte** – Les scientifiques ont besoin de méthodes pour assembler des séquences d'ADN longues et complexes avec précision pour la recherche et la biotechnologie. Les méthodes existantes peuvent avoir des erreurs ou des limites sur la taille des assemblages.\n\n**Ce qui s'est passé** – Des chercheurs ont créé une nouvelle technique appelée Sidewinder qui utilise des jonctions d'ADN à trois branches (3J) pour assembler des morceaux d'ADN. Cette méthode sépare les instructions d'assemblage de la séquence finale, permettant une construction précise et fiable de l'ADN complexe. Ils ont testé différents designs et enzymes, puis confirmé la précision grâce à un séquençage avancé.\n\n**Impact** – Sidewinder peut construire de longues séquences d'ADN variées avec moins d'erreurs que les méthodes précédentes. Cela facilite la création de bibliothèques d'ADN avec de nombreuses variantes, utiles pour étudier les gènes ou créer de nouvelles protéines. La méthode fonctionne bien même pour l'ADN compliqué et peut accélérer la recherche génétique.\n\n**Prochaine étape** – Les scientifiques prévoient d'utiliser Sidewinder pour créer des bibliothèques d'ADN plus grandes et explorer de nouvelles protéines et fonctions génétiques. La méthode pourrait être améliorée en ajoutant de nouvelles bases chimiques à l'ADN, augmentant sa flexibilité. Elle pourrait aussi être utilisée dans plus de laboratoires et pour des applications pratiques comme la médecine.\n\n**Résumé en une phrase** – La méthode Sidewinder permet d'assembler précisément et facilement des séquences d'ADN complexes, ouvrant de nouvelles voies pour la recherche génétique et la biotechnologie.",
      "personality_title_es": "Nuevo método de ensamblaje de ADN construye secuencias genéticas complejas con alta precisión",
      "personality_presentation_es": "**Contexto** – Los científicos necesitan formas de unir secuencias largas y complejas de ADN con precisión para la investigación y la biotecnología. Los métodos actuales pueden tener errores o limitaciones en el tamaño del ADN que pueden ensamblar.\n\n**Qué pasó** – Investigadores desarrollaron una técnica llamada Sidewinder que usa uniones de ADN de tres vías (3V) para ensamblar fragmentos de ADN. Este método separa las instrucciones para unir las piezas de la secuencia final, permitiendo construir ADN complejo de forma precisa y confiable. Probaron diferentes diseños y enzimas, y usaron secuenciación avanzada para confirmar la exactitud.\n\n**Impacto** – Sidewinder puede crear secuencias largas y diversas de ADN con menos errores que los métodos anteriores. Esto facilita la creación de bibliotecas de ADN con muchas variaciones, útiles para estudiar genes o crear nuevas proteínas. Funciona bien incluso con ADN complicado y puede acelerar la investigación genética.\n\n**Siguiente paso** – Los científicos planean usar Sidewinder para crear bibliotecas de ADN más grandes y explorar nuevas proteínas y funciones genéticas. El método podría ampliarse añadiendo nuevas bases químicas al ADN, aumentando su versatilidad. También podría usarse en más laboratorios y en aplicaciones prácticas como medicina o bioingeniería.\n\n**Resumen en una frase** – El método Sidewinder ofrece una forma precisa y flexible de ensamblar secuencias complejas de ADN, abriendo nuevas oportunidades para la investigación genética y la biotecnología.",
      "image_url": "public/images/news_image_Construction-of-complex-and-diverse-DNA-sequences-.png",
      "image_prompt": "An intricate, warm-toned painting of interlocking DNA three-way junctions forming a complex, branching molecular network, with glowing barcode-like strands weaving seamlessly between the junctions, symbolizing precise assembly and diversity, set against a soft, natural background of gentle gradients in earthy blues and greens."
    },
    {
      "title": "Symmetry, microscopy and spectroscopy signatures of altermagnetism",
      "summary": "Nature, Published online: 21 January 2026; doi:10.1038/s41586-025-09883-2The symmetry, microscopy and spectroscopy signatures of altermagnetism are reviewed, and compared with traditional ferromagnetism and Néel antiferromagnetism, and magnetic phases with symmetry-protected compensated non-collinear spin orders.",
      "content": "Šmejkal, L., Sinova, J. & Jungwirth, T. Beyond conventional ferromagnetism and antiferromagnetism: a phase with nonrelativistic spin and crystal rotation symmetry. Phys. Rev. X 12, 031042 (2022). This paper delineated altermagnetism as an exclusively distinct spin-group symmetry class of d-, g- or i-wave spin-ordered phases.\n\nŠmejkal, L., Sinova, J. & Jungwirth, T. Emerging research landscape of altermagnetism. Phys. Rev. X 12, 040501 (2022). This perspective outlined envisaged research directions of altermagnetism.\n\nŠmejkal, L., González-Hernández, R., Jungwirth, T. & Sinova, J. Crystal time-reversal symmetry breaking and spontaneous Hall effect in collinear antiferromagnets. Sci. Adv. 6, eaaz8809 (2020). This paper predicted that an interplay of crystal and collinear spin orders in a class of materials can lead to a time-reversal-symmetry-breaking spin-split electronic structure and, when spin–orbit coupling is included, to the anomalous Hall effect.\n\nJungwirth, T. et al. Altermagnetism: an unconventional spin-ordered phase of matter. Newton 1, 100162 (2025).\n\nMazin, I. I. Notes on altermagnetism and superconductivity. AAPPS Bull. 35, 18 (2025). These informal notes, originally posted as a preprint on the arXiv server, aimed to stimulate the exploration of the interplay of altermagnetism with superconductivity.\n\nBeenakker, C. W. J. & Vakhtel, T. Phase-shifted Andreev levels in an altermagnet Josephson junction. Phys. Rev. B 108, 075425 (2023).\n\nMazin, I., González-Hernández, R. & Šmejkal, L. Induced monolayer altermagnetism in MnP(S,Se) 3 and FeSe. Preprint at http://arxiv.org/abs/2309.02355 (2023).\n\nBrekke, B., Brataas, A. & Sudbø, A. Two-dimensional altermagnets: superconductivity in a minimal microscopic model. Phys. Rev. B 108, 224421 (2023).\n\nLi, Y.-X. & Liu, C.-C. Majorana corner modes and tunable patterns in an altermagnet heterostructure. Phys. Rev. B 108, 205410 (2023).\n\nZhu, D., Zhuang, Z.-Y., Wu, Z. & Yan, Z. Topological superconductivity in two-dimensional altermagnetic metals. Phys. Rev. B 108, 184505 (2023).\n\nSumita, S., Naka, M. & Seo, H. Fulde–Ferrell–Larkin–Ovchinnikov state induced by antiferromagnetic order in k-type organic conductors. Phys. Rev. Res. 5, 043171 (2023).\n\nGhorashi, S. A. A., Hughes, T. L. & Cano, J. Altermagnetic routes to Majorana modes in zero net magnetization. Phys. Rev. Lett. 133, 106601 (2024).\n\nPapaj, M. Andreev reflection at the altermagnet-superconductor interface. Phys. Rev. B 108, L060508 (2023).\n\nWei, M. et al. Gapless superconducting state and mirage gap in altermagnets. Phys. Rev. B 109, L201404 (2023).\n\nZhang, S.-B., Hu, L.-H. & Neupert, T. Finite-momentum Cooper pairing in proximitized altermagnets. Nat. Commun. 15, 1801 (2024).\n\nCheng, Q. & Sun, Q.-F. Orientation-dependent Josephson effect in spin-singlet superconductor/altermagnet/spin-triplet superconductor junctions. Phys. Rev. B 109, 024517 (2024).\n\nZhao, Y. et al. Hybrid-order topology in unconventional magnets of Eu-based Zintl compounds with surface-dependent quantum geometry. Phys. Rev. B 110, 205111 (2024).\n\nMæland, K., Brekke, B. & Sudbø, A. Many-body effects on superconductivity mediated by double-magnon processes in altermagnets. Phys. Rev. B 109, 134515 (2024).\n\nChakraborty, D. & Black-Schaffer, A. M. Zero-field finite-momentum and field-induced superconductivity in altermagnets. Phys. Rev. B 110, L060508 (2024).\n\nBanerjee, S. & Scheurer, M. S. Altermagnetic superconducting diode effect. Phys. Rev. B 110, 024503 (2024).\n\nJeschke, H. O., Shimizu, M. & Mazin, I. I. CuAg(SO 4 ) 2 : a doubly strongly correlated altermagnetic three-dimensional analog of the parent compounds of high-T c cuprates. Phys. Rev. B 109, L220412 (2024).\n\nVerbeek, X. H., Urru, A. & Spaldin, N. A. Hidden orders and (anti-)magnetoelectric effects in Cr 2 O 3 and Fe 2 O 3 . Phys. Rev. Res. 5, L042018 (2023).\n\nBernardini, F., Fiebig, M. & Cano, A. Ruddlesden–Popper and perovskite phases as a material platform for altermagnetism. J. Appl. Phys. 137, 103903 (2025).\n\nZyuzin, A. A. Magnetoelectric effect in superconductors with d-wave magnetization. Phys. Rev. B 109, L220505 (2024).\n\nSim, G. & Knolle, J. Pair density waves and supercurrent diode effect in altermagnets. Phys. Rev. B 112, L020502 (2025).\n\nHu, J.-X., Matsyshyn, O. & Song, J. C. W. Nonlinear superconducting magnetoelectric effect. Phys. Rev. Lett. 134, 026001 (2025).\n\nŠmejkal, L. Altermagnetic multiferroics and altermagnetoelectric effect. Preprint at http://arxiv.org/abs/2411.19928 (2024). This paper and refs. 28 and 29 theoretically predicted an interplay of altermagnetism with ferroelectricity.\n\nDuan, X. et al. Antiferroelectric altermagnets: antiferroelectricity alters magnets. Phys. Rev. Lett. 134, 106801 (2025).\n\nGu, M. et al. Ferroelectric switchable altermagnetism. Phys. Rev. Lett. 134, 106802 (2024).\n\nParthenios, N. et al. Spin and pair density waves in two-dimensional altermagnetic metals. Phys. Rev. B 112, 214410 (2025).\n\nŠmejkal, L., MacDonald, A. H., Sinova, J., Nakatsuji, S. & Jungwirth, T. Anomalous Hall antiferromagnets. Nat. Rev. Mater. 7, 482–496 (2022). This paper reviewed the anomalous Hall effect in altermagnets and non-collinear compensated magnets.\n\nBai, L. et al. Altermagnetism: exploring new frontiers in magnetism and spintronics. Adv. Funct. Mater. 34, 2409327 (2024).\n\nLiu, Q., Dai, X. & Blügel, S. Different facets of unconventional magnetism. Nat. Phys. 21, 329–331 (2025).\n\nSong, C. et al. Altermagnets as a new class of functional materials. Nat. Rev. Mater. 10, 473–485 (2025).\n\nJungwirth, T. et al. Altermagnetic spintronics. Preprint at http://arxiv.org/abs/2508.09748 (2025).\n\nLiu, P., Li, J., Han, J., Wan, X. & Liu, Q. Spin-group symmetry in magnetic materials with negligible spin–orbit coupling. Phys. Rev. X 12, 21016 (2022). This paper discusses spin space-group symmetries of magnetic materials and corresponding band degeneracies and emergent topological phases.\n\nLitvin, D. B. & Opechowski, W. Spin groups. Physica 76, 538–554 (1974). This paper describes the mathematical spin-group formalism.\n\nAndreev, A. & Grishchuk, I. Spin nematics. Sov. Phys. JETP 60, 267 (1984).\n\nGor’kov, L. P. & Sokol, A. Nontrivial magnetic order: localized versus itinerant systems. Phys. Rev. Lett. 69, 2586–2589 (1992).\n\nLeggett, A. J. Nobel Lecture: Superfluid 3-He: the early days as seen by a theorist. Rev. Mod. Phys. 76, 999 (2004). This paper reviews the superfluid phase of 3He, including the spontaneous breaking of real-space and spin-space rotation symmetries.\n\nMoessner, R. & Moore, J. E. Topological Phases of Matter (Cambridge Univ. Press, 2021).\n\nStrange, P. Relativistic Quantum Mechanics 1 edn (Cambridge Univ. Press, Cambridge, 1998).\n\nWinkler, R. Spin–Orbit Coupling Effects in Two-Dimensional Electron and Hole Systems Springer Tracts in Modern Physics Vol. 191 (Springer, 2003).\n\nLandau, L. & Lifshitz, E. Electrodynamics of Continuous Media 2 edn, Course of Theoretical Physics Vol. 8 (Pergamon Press, 1965).\n\nSinova, J., Valenzuela, S. O., Wunderlich, J., Back, C. H. & Jungwirth, T. Spin Hall effects. Rev. Mod. Phys. 87, 1213–1260 (2015).\n\nNagaosa, N., Sinova, J., Onoda, S., MacDonald, A. H. & Ong, N. P. Anomalous Hall effect. Rev. Mod. Phys. 82, 1539–1592 (2010).\n\nFranz, M. & Molenkamp, L. (eds) Contemporary Concepts of Condensed Matter Science Topological Insulators Vol. 6 (Elsevier, 2013).\n\nMurakami, S. & Yokoyama, T. Quantum Spin Hall Effect and Topological Insulators Vol. 1 (Oxford Univ. Press, 2017).\n\nBradlyn, B. et al. Topological quantum chemistry. Nature 547, 298–305 (2017).\n\nArmitage, N. P., Mele, E. J. & Vishwanath, A. Weyl and Dirac semimetals in three-dimensional solids. Rev. Mod. Phys. 90, 015001 (2018).\n\nElcoro, L. et al. Magnetic topological quantum chemistry. Nat. Commun. 12, 5965 (2021).\n\nMazin, I. I., Koepernik, K., Johannes, M. D., González-Hernández, R. & Šmejkal, L. Prediction of unconventional magnetism in doped FeSb 2 . Proc. Natl Acad. Sci. USA 118, e2108924118 (2021).\n\nReichlova, H. et al. Observation of a spontaneous anomalous Hall response in the Mn 5 Si d-wave altermagnet candidate. Nat. Commun. 15, 4961 (2024).\n\nŠmejkal, L., Hellenes, A. B., González-Hernández, R., Sinova, J. & Jungwirth, T. Giant and tunneling magnetoresistance in unconventional collinear antiferromagnets with nonrelativistic spin–momentum coupling. Phys. Rev. X 12, 011028 (2022).\n\nGonzalez Betancourt, R. D. et al. Spontaneous anomalous Hall effect arising from an unconventional compensated magnetic phase in a semiconductor. Phys. Rev. Lett. 130, 036702 (2023).\n\nŠmejkal, L. et al. Chiral magnons in altermagnetic RuO 2 . Phys. Rev. Lett. 131, 256703 (2023).\n\nChen, X. et al. Unconventional magnons in collinear magnets dictated by spin space groups. Nature 640, 349–354 (2025).\n\nHariki, A. et al. X-ray magnetic circular dichroism in altermagnetic α-MnTe. Phys. Rev. Lett. 132, 176701 (2024).\n\nHellenes, A. B. et al. P-wave magnets. Preprint at http://arxiv.org/abs/2309.01607 (2023).\n\nHellenes, A. B., Jungwirth, T., Sinova, J. & Šmejkal, L. Exchange spin–orbit coupling and unconventional p-wave magnetism. Preprint at http://arxiv.org/abs/2309.01607v1 (2023).\n\nMcClarty, P. A. & Rau, J. G. Landau theory of altermagnetism. Phys. Rev. Lett. 132, 176702 (2023).\n\nSmolyanyuk, A., Šmejkal, L. & Mazin, I. I. A tool to check whether a symmetry-compensated collinear magnetic material is antiferro- or altermagnetic. SciPost Phys. Codebases 30, 1–16 (2024).\n\nShinohara, K. et al. Algorithm for spin symmetry operation search. Acta Crystallogr. A 80, 94–103 (2024).\n\nWatanabe, H., Shinohara, K., Nomoto, T., Togo, A. & Arita, R. Symmetry analysis with spin crystallographic groups: disentangling effects free of spin–orbit coupling in emergent electromagnetism. Phys. Rev. B 109, 094438 (2024).\n\nJiang, Y. et al. Enumeration of spin-space groups: toward a complete description of symmetries of magnetic orders. Phys. Rev. X 14, 031039 (2024).\n\nZhu, H., Li, J., Chen, X., Yu, Y. & Liu, Q. Magnetic geometry induced quantum geometry and nonlinear transports. Nat. Commun. 16, 4882 (2025).\n\nChen, X. et al. Enumeration and representation theory of spin space groups. Phys. Rev. X 14, 031038 (2024).\n\nSchiff, H., Corticelli, A., Guerreiro, A., Romhányi, J. & McClarty, P. The crystallographic spin point groups and their representations. SciPost Phys. 18, 109 (2025).\n\nXiao, Z., Zhao, J., Li, Y., Shindou, R. & Song, Z.-D. Spin space groups: full classification and applications. Phys. Rev. X 14, 031037 (2024).\n\nLitvin, D. B. Magnetic Group Tables (IUCr, 2013). http://www.iucr.org/publ/978-0-9553602-2-0.\n\nBerlijn, T. et al. Itinerant antiferromagnetism in RuO 2 . Phys. Rev. Lett. 118, 077201 (2017).\n\nZhu, Z. H. et al. Anomalous antiferromagnetism in metallic RuO 2 determined by resonant X-ray scattering. Phys. Rev. Lett. 122, 017202 (2019).\n\nLovesey, S. W., Khalyavin, D. D. & van der Laan, G. Magnetic properties of RuO 2 and charge-magnetic interference in Bragg diffraction of circularly polarized X-rays. Phys. Rev. B 105, 014403 (2022).\n\nOcchialini, C. A. et al. Local electronic structure of rutile RuO 2 . Phys. Rev. Res. 3, 033214 (2021).\n\nFeng, Z. et al. An anomalous Hall effect in altermagnetic ruthenium dioxide. Nat. Electron. 5, 735–743 (2022).\n\nBose, A. et al. Tilted spin current generated by the collinear antiferromagnet ruthenium dioxide. Nat. Electron. 5, 267–274 (2022).\n\nBai, H. et al. Observation of spin splitting torque in a collinear antiferromagnet RuO 2 . Phys. Rev. Lett. 128, 197202 (2022).\n\nKarube, S. et al. Observation of spin-splitter torque in collinear antiferromagnetic RuO 2 . Phys. Rev. Lett. 129, 137201 (2022).\n\nLovesey, S. W., Khalyavin, D. D. & van der Laan, G. Magnetic structure of RuO 2 in view of altermagnetism. Phys. Rev. B 108, L121103 (2023).\n\nLiu, Y. et al. Inverse altermagnetic spin splitting effect-induced terahertz emission in RuO 2 . Adv. Opt. Mater. 11, 2300177 (2023).\n\nFedchenko, O. et al. Observation of time-reversal symmetry breaking in the band structure of altermagnetic RuO 2 . Sci. Adv. 10, 31 (2024).\n\nSmolyanyuk, A., Mazin, I. I., Garcia-Gassull, L. & Valentí, R. Fragility of the magnetic order in the prototypical altermagnet RuO 2 . Phys. Rev. B 109, 134424 (2024).\n\nLin, Z. et al. Observation of giant spin splitting and d-wave spin texture in room temperature altermagnet RuO 2 . Preprint at http://arxiv.org/abs/2402.04995 (2024).\n\nKeßler, P. et al. Absence of magnetic order in RuO 2 : insights from μSR spectroscopy and neutron diffraction. npj Spintronics 2, 50 (2024).\n\nLi, Z. et al. Fully field-free spin-orbit torque switching induced by spin splitting effect in altermagnetic RuO 2 . Adv. Mater. 37, 2416712 (2025).\n\nWenzel, M. et al. Fermi-liquid behavior of nonaltermagnetic RuO 2 . Phys. Rev. B 111, L041115 (2025).\n\nJeong, S. G. et al. Altermagnetic polar metallic phase in ultra-thin epitaxially-strained RuO 2 films. Preprint at http://arxiv.org/abs/2405.05838 (2024).\n\nHiraishi, M. et al. Nonmagnetic ground state in RuO 2 revealed by muon spin rotation. Phys. Rev. Lett. 132, 166702 (2024).\n\nLópez-Moreno, S., Romero, A. H., Mejía-López, J. & Muñoz, A. First-principles study of pressure-induced structural phase transitions in MnF 2 . Phys. Chem. Chem. Phys. 18, 33250–33263 (2016). This paper reported density-functional-theory calculations of non-relativistic band structure of MnF 2 .\n\nNoda, Y., Ohno, K. & Nakamura, S. Momentum-dependent band spin splitting in semiconducting MnO 2 : a density functional calculation. Phys. Chem. Chem. Phys. 18, 13294–13303 (2016).\n\nHayami, S., Yanagi, Y. & Kusunose, H. Momentum-dependent spin splitting by collinear antiferromagnetic ordering. J. Phys. Soc. Jpn 88, 123702 (2019).\n\nYuan, L.-D., Wang, Z., Luo, J.-W., Rashba, E. I. & Zunger, A. Giant momentum-dependent spin splitting in centrosymmetric low-Z antiferromagnets. Phys. Rev. B 102, 014422 (2020).\n\nBhowal, S. & Spaldin, N. A. Ferroically ordered magnetic octupoles in d-wave altermagnets. Phys. Rev. X 14, 011019 (2024).\n\nJaeschke-Ubiergo, R. et al. Atomic altermagnetism. Preprint at https://arxiv.org/pdf/2503.10797 (2025).\n\nLovesey, S. W., Khalyavin, D. D. & van der Laan, G. Templates for magnetic symmetry and altermagnetism in hexagonal MnTe. Phys. Rev. B 108, 174437 (2023).\n\nMazin, I. I. Altermagnetism in MnTe: origin, predicted manifestations, and routes to detwinning. Phys. Rev. B 107, L100418 (2023).\n\nKrempaský, J. et al. Altermagnetic lifting of Kramers spin degeneracy. Nature 626, 517–522 (2024). This paper and refs. 99–101 reported experimental spectroscopic observations of a g-wave altermagnetic band structure of MnTe.\n\nLee, S. S. et al. Broken Kramers degeneracy in altermagnetic MnTe. Phys. Rev. Lett. 132, 036702 (2024).\n\nOsumi, T. et al. Observation of a giant band splitting in altermagnetic MnTe. Phys. Rev. B 109, 115102 (2024).\n\nHajlaoui, M. et al. Temperature dependence of relativistic valence band splitting induced by an altermagnetic phase transition. Adv. Mater. 36, 2314076 (2024).\n\nAoyama, T. & Ohgushi, K. Piezomagnetic properties in altermagnetic MnTe. Phys. Rev. Mater. 8, L041402 (2024).\n\nKluczyk, K. P. et al. Coexistence of anomalous Hall effect and weak magnetization in a nominally collinear antiferromagnet MnTe. Phys. Rev. B 110, 155201 (2024).\n\nReimers, S. et al. Direct observation of altermagnetic band splitting in CrSb thin films. Nat. Commun. 15, 2116 (2024).\n\nYang, G. et al. Three-dimensional mapping of the altermagnetic spin splitting in CrSb. Nat. Commun. 16, 1442 (2025).\n\nDing, J. et al. Large band splitting in g-wave altermagnet CrSb. Phys. Rev. Lett. 133, 206401 (2024).\n\nLi, C. et al. Topological Weyl altermagnetism in CrSb. Commun. Phys. 8, 311 (2025).\n\nLu, W. et al. Signature of topological surface bands in altermagnetic Weyl semimetal CrSb. Nano Lett. 25, 7343–7350 (2025).\n\nZeng, M. et al. Observation of spin splitting in room-temperature metallic antiferromagnet CrSb. Adv. Sci. 11, 2406529 (2024).\n\nDale, N. et al. Non-relativistic spin splitting above and below the Fermi level in a g-wave altermagnet. Preprint at http://arxiv.org/abs/2411.18761 (2024).\n\nLiu, Z., Ozeki, M., Asai, S., Itoh, S. & Masuda, T. Chiral-split magnon in altermagnetic MnTe. Phys. Rev. Lett. 133, 156702 (2024).\n\nJiang, B. et al. A metallic room-temperature d-wave altermagnet. Nat. Phys. 21, 754–759 (2025). This paper and ref. 113 reported experimental spectroscopic observations of a d-wave altermagnetic band structure.\n\nZhang, F. et al. Crystal-symmetry-paired spin–valley locking in a layered room-temperature metallic altermagnet candidate. Nat. Phys. 21, 760–767 (2025).\n\nAntonenko, D. S., Fernandes, R. M. & Venderbos, J. W. F. Mirror Chern bands and Weyl nodal loops in altermagnets. Phys. Rev. Lett. 134, 096703 (2025). This paper reported a theoretical study of topological phenomena in 2D (Lieb lattice) and 3D minimal models of altermagnetism.\n\nKaushal, N. & Franz, M. Altermagnetism in modified Lieb lattice Hubbard model. Phys. Rev. Lett. 135, 156502 (2025).\n\nWei, C. C. et al. La 2 O 3 Mn 2 Se 2 : a correlated insulating layered d-wave altermagnet. Phys. Rev. Mater. 9, 24402 (2025).\n\nMaharaj, D. D. et al. Octupolar versus Néel order in cubic 5d2 double perovskites. Phys. Rev. Lett. 124, 87206 (2020).\n\nNéel, L. Magnetism and local molecular field. Science 174, 985–992 (1971).\n\nChakraborty, A., González Hernández, R., Šmejkal, L. & Sinova, J. Strain-induced phase transition from antiferromagnet to altermagnet. Phys. Rev. B 109, 144421 (2024).\n\nLiu, Y., Yu, J. & Liu, C.-C. Twisted magnetic van der Waals bilayers: an ideal platform for altermagnetism. Phys. Rev. Lett. 133, 206702 (2024).\n\nLeeb, V., Mook, A., Šmejkal, L. & Knolle, J. Spontaneous formation of altermagnetism from orbital ordering. Phys. Rev. Lett. 132, 236701 (2024).\n\nFernandes, R. M., de Carvalho, V. S., Birol, T. & Pereira, R. G. Topological transition from nodal to nodeless Zeeman splitting in altermagnets. Phys. Rev. B 109, 024404 (2024).\n\nDas, S., Suri, D. & Soori, A. Transport across junctions of altermagnets with normal metals and ferromagnets. J. Phys. Condensed Matter 35, 435302 (2023).\n\nMaier, T. A. & Okamoto, S. Weak-coupling theory of neutron scattering as a probe of altermagnetism. Phys. Rev. B 108, L100402 (2023).\n\nSato, T., Haddad, S., Fulga, I. C., Assaad, F. F. & van den Brink, J. Altermagnetic anomalous Hall effect emerging from electronic correlations. Phys. Rev. Lett. 133, 086503 (2024).\n\nRoig, M., Kreisel, A., Yu, Y., Andersen, B. M. & Agterberg, D. F. Minimal models for altermagnetism. Phys. Rev. B 110, 144412 (2024).\n\nBose, A., Vadnais, S. & Paramekanti, A. Altermagnetism and superconductivity in a multiorbital t–J model. Phys. Rev. B 110, 205120 (2024).\n\nFerrari, F. & Valentí, R. Altermagnetism on the Shastry–Sutherland lattice. Phys. Rev. B 110, 205140 (2024).\n\nRooj, S., Saxena, S. & Ganguli, N. Altermagnetism in the orthorhombic Pnm structure through group theory and DFT calculations. Phys. Rev. B 111, 014434 (2025).\n\nTöpfer, J. & Goodenough, J. LaMnO 3+δ revisited. J. Solid State Chem. 130, 117–128 (1997).\n\nChen, H., Niu, Q. & Macdonald, A. H. Anomalous Hall effect arising from noncollinear antiferromagnetism. Phys. Rev. Lett. 112, 017205 (2014). This paper predicted the anomalous Hall effect in a non-collinear compensated magnet.\n\nZhou, J. et al. Predicted quantum topological Hall effect and noncoplanar antiferromagnetism in K 0.5 RhO 2 . Phys. Rev. Lett. 116, 256601 (2016).\n\nFeng, W. et al. Topological magneto-optical effects and their quantization in noncoplanar antiferromagnets. Nat. Commun. 11, 118 (2020).\n\nAhn, K.-H., Hariki, A., Lee, K.-W. & Kuneš, J. Antiferromagnetism in RuO 2 as d-wave Pomeranchuk instability. Phys. Rev. B 99, 184432 (2019).\n\nNaka, M. et al. Spin current generation in organic antiferromagnets. Nat. Commun. 10, 4305 (2019).\n\nGuo, Y. et al. Spin-split collinear antiferromagnets: a large-scale ab-initio study. Mater. Today Phys. 32, 100991 (2023).\n\nMa, H.-Y. et al. Multifunctional antiferromagnetic materials with giant piezomagnetism and noncollinear spin current. Nat. Commun. 12, 2846 (2021).\n\nEgorov, S. A. & Evarestov, R. A. Colossal spin splitting in the monolayer of the collinear antiferromagnet MnF 2 . J. Phys. Chem. Lett. 12, 2363–2369 (2021).\n\nCui, Q., Zhu, Y., Yao, X., Cui, P. & Yang, H. Giant spin-Hall and tunneling magnetoresistance effects based on a two-dimensional nonrelativistic antiferromagnetic metal. Phys. Rev. B 108, 024410 (2023).\n\nChen, X., Wang, D., Li, L. & Sanyal, B. Giant spin-splitting and tunable spin-momentum locked transport in room temperature collinear antiferromagnetic semimetallic CrO monolayer. Appl. Phys. Lett. 123, 022402 (2023).\n\nSødequist, J. & Olsen, T. Two-dimensional altermagnets from high throughput computational screening: symmetry requirements, chiral magnons, and spin–orbit effects. Appl. Phys. Lett. 124, 182409 (2024).\n\nZhu, Y.-P. et al. Observation of plaid-like spin splitting in a noncoplanar antiferromagnet. Nature 626, 523–528 (2024).\n\nZhu, Y. et al. Multipiezo effect in altermagnetic V 2 SeTeO monolayer. Nano Lett. 24, 472–478 (2024).\n\nWigner, E. Ueber die Operation der Zeitumkehr in der Quantenmechanik. Nachr. Ges. Wiss. Gott. Math. Phys. Kl. 1932, 546–559 (1932).\n\nTang, P., Zhou, Q., Xu, G. & Zhang, S.-C. Dirac fermions in an antiferromagnetic semimetal. Nat. Phys. 12, 1100–1104 (2016).\n\nŠmejkal, L., Železný, J., Sinova, J. & Jungwirth, T. Electric control of Dirac quasiparticles by spin–orbit torque in an antiferromagnet. Phys. Rev. Lett. 118, 106402 (2017).\n\nŠmejkal, L., Mokrousov, Y., Yan, B. & MacDonald, A. H. Topological antiferromagnetic spintronics. Nat. Phys. 14, 242–251 (2018).\n\nKübler, J. & Felser, C. Non-collinear antiferromagnets and the anomalous Hall effect. Europhys. Lett. 108, 67001 (2014).\n\nNakatsuji, S., Kiyohara, N. & Higo, T. Large anomalous Hall effect in a non-collinear antiferromagnet at room temperature. Nature 527, 212–215 (2015). This paper reported the experimental observation of the anomalous Hall effect in a non-collinear compensated magnet.\n\nKiyohara, N., Tomita, T. & Nakatsuji, S. Giant anomalous Hall effect in the chiral antiferromagnet Mn 3 Ge. Phys. Rev. Appl. 5, 064009 (2016).\n\nNayak, A. K. et al. Large anomalous Hall effect driven by a nonvanishing Berry curvature in the noncolinear antiferromagnet Mn 3 Ge. Sci. Adv. 2, e1501870 (2016).\n\nTakagi, H. et al. Spontaneous topological Hall effect induced by non-coplanar antiferromagnetic order in intercalated van der Waals materials. Nat. Phys. 19, 961–968 (2023).\n\nIkhlas, M. et al. Large anomalous Nernst effect at room temperature in a chiral antiferromagnet. Nat. Phys. 13, 1085–1090 (2017).\n\nLi, X. et al. Anomalous Nernst and Righi-Leduc effects in Mn 3 Sn: Berry curvature and entropy flow. Phys. Rev. Lett. 119, 056601 (2017).\n\nHigo, T. et al. Large magneto-optical Kerr effect and imaging of magnetic octupole domains in an antiferromagnetic metal. Nat. Photon. 12, 73–78 (2018).\n\nMatsuda, T., Kanda, N., Higo, T. & Matsunaga, R. Room-temperature terahertz anomalous Hall effect in Weyl antiferromagnet Mn 3 Sn thin films. Nat. Commun. 11, 909 (2020).\n\nKimata, M. et al. X-ray study of ferroic octupole order producing anomalous Hall effect. Nat. Commun. 12, 5582 (2021).\n\nSakamoto, S. et al. Observation of spontaneous X-ray magnetic circular dichroism in a chiral antiferromagnet. Phys. Rev. B 104, 134431 (2021).\n\nŽelezný, J., Zhang, Y., Felser, C. & Yan, B. Spin-polarized current in noncollinear antiferromagnets. Phys. Rev. Lett. 119, 187204 (2017).\n\nZhang, Y., Železný, J., Sun, Y., van den Brink, J. & Yan, B. Spin Hall effect emerging from a noncollinear magnetic lattice without spin–orbit coupling. New J. Phys. 20, 073028 (2018).\n\nKimata, M. et al. Magnetic and magnetic inverse spin Hall effects in a non-collinear antiferromagnet. Nature 565, 627–630 (2019).\n\nHu, S. et al. Efficient perpendicular magnetization switching by a magnetic spin Hall effect in a noncollinear antiferromagnet. Nat. Commun. 13, 4447 (2022).\n\nTsai, H. et al. Electrical manipulation of a topological antiferromagnetic state. Nature 580, 608–613 (2020).\n\nTakeuchi, Y. et al. Chiral-spin rotation of non-collinear antiferromagnet by spin–orbit torque. Nat. Mater. 20, 1364–1370 (2021).\n\nHigo, T. et al. Perpendicular full switching of chiral antiferromagnetic order by current. Nature 607, 474–479 (2022).\n\nPal, B. et al. Setting of the magnetic structure of chiral kagome antiferromagnets by a seeded spin–orbit torque. Sci. Adv. 8, eabo5930 (2022).\n\nChen, X. et al. Octupole-driven magnetoresistance in an antiferromagnetic tunnel junction. Nature 613, 490–495 (2023).\n\nQin, P. et al. Room-temperature magnetoresistance in an all-antiferromagnetic tunnel junction. Nature 613, 485–489 (2023).\n\nNakatsuji, S. & Arita, R. Topological magnets: functions based on Berry phase and multipoles. Annu. Rev. Condensed Matter Phys. 13, 119–142 (2022).\n\nRimmler, B. H., Pal, B. & Parkin, S. S. P. Non-collinear antiferromagnetic spintronics. Nat. Rev. Mater. 10, 109–127 (2024).\n\nHan, J., Yoon, J.-Y., Ohno, H. & Fukami, S. Unconventional responses in non-collinear antiferromagnets. Newton 1, 100012 (2025).\n\nBrekke, B., Sukhachov, P., Giil, H. G., Brataas, A. & Linder, J. Minimal models and transport properties of unconventional p-wave magnets. Phys. Rev. Lett. 133, 236703 (2024).\n\nEzawa, M. Topological insulators and superconductors based on p-wave magnets: electrical control and detection of a domain wall. Phys. Rev. B 110, 165429 (2024).\n\nSivianes, J., dos Santos, F. J. & Ibañez-Azpiroz, J. Optical signatures of spin symmetries in unconventional magnets. Phys. Rev. Lett. 134, 196907 (2025).\n\nChakraborty, A. et al. Highly efficient non-relativistic Edelstein effect in p-wave magnets. Nat. Commun. 16, 7270 (2023).\n\nYu, Y. et al. Odd-parity magnetism driven by antiferromagnetic exchange. Phys. Rev. Lett. 135, 046701 (2025).\n\nWang, M. et al. Emergent zero-field anomalous Hall effect in a reconstructed rutile antiferromagnetic metal. Nat. Commun. 14, 8240 (2023).\n\nHan, L. et al. Electrical 180° switching of Néel vector in spin-splitting antiferromagnet. Sci. Adv. 10, eadn0479 (2024).\n\nTakagi, R. et al. Spontaneous Hall effect induced by collinear antiferromagnetic order at room temperature. Nat. Mater. 24, 63–68 (2025).\n\nRay, M. K. et al. Zero-field Hall effect emerging from a non-Fermi liquid in a collinear antiferromagnet V 1/3 NbS 2 . Nat. Commun. 16, 3532 (2025).\n\nFakhredine, A., Sattigeri, R. M., Cuono, G. & Autieri, C. Interplay between altermagnetism and nonsymmorphic symmetries generating large anomalous Hall conductivity by semi-Dirac points induced anticrossings. Phys. Rev. B 108, 115138 (2023).\n\nFang, Y., Cano, J. & Ghorashi, S. A. A. Quantum geometry induced nonlinear transport in altermagnets. Phys. Rev. Lett. 133, 106701 (2024).\n\nLi, Y.-X., Liu, Y. & Liu, C.-C. Creation and manipulation of higher-order topological states by altermagnets. Phys. Rev. B 109, L201109 (2024).\n\nZhou, X. et al. Crystal thermal transport in altermagnetic RuO 2 . Phys. Rev. Lett.s 132, 056701 (2024).\n\nZhan, J., Li, J., Shi, W., Chen, X. Q. & Sun, Y. Coexistence of Weyl semimetal and Weyl nodal loop semimetal phases in a collinear antiferromagnet. Phys. Rev. B 107, 224402 (2023).\n\nNag, J. et al. GdAlSi: an antiferromagnetic topological Weyl semimetal with nonrelativistic spin splitting. Phys. Rev. B 110, 224436 (2024).\n\nParshukov, K., Wiedmann, R. & Schnyder, A. P. Topological responses from gapped Weyl points in 2D altermagnets. Phys. Rev. B 111, 224406 (2025).\n\nRao, P., Mook, A. & Knolle, J. Tunable band topology and optical conductivity in altermagnets. Phys. Rev. B 110, 024425 (2024).\n\nTao, L. L. & Tsymbal, E. Y. Persistent spin texture enforced by symmetry. Nat. Commun. 9, 2763 (2018).\n\nJi, J., Lou, F., Yu, R., Feng, J. S. & Xiang, H. J. Symmetry-protected full-space persistent spin texture in two-dimensional materials. Phys. Rev. B 105, L041404 (2022).\n\nBernevig, B. A., Orenstein, J. & Zhang, S. C. Exact SU(2) symmetry and persistent spin helix in a spin–orbit coupled system. Phys. Rev. Lett. 97, 236601 (2006).\n\nKoralek, J. D. et al. Emergence of the persistent spin helix in semiconductor quantum wells. Nature 458, 610–613 (2009).\n\nKuroda, K. et al. Evidence for magnetic Weyl fermions in a correlated metal. Nat. Mater. 16, 1090–1095 (2017).\n\nLiu, Z. Q. et al. Electrical switching of the topological anomalous Hall effect in a non-collinear antiferromagnet above room temperature. Nat. Electron. 1, 172–177 (2018).\n\nXu, L. et al. Finite-temperature violation of the anomalous transverse Wiedemann–Franz law. Sci. Adv. 6, eaaz3522 (2020).\n\nChen, T. et al. Anomalous transport due to Weyl fermions in the chiral antiferromagnets Mn 3 X, X = Sn, Ge. Nat. Commun. 12, 572 (2021).\n\nGhosh, S. et al. Raman spectroscopic evidence for linearly dispersed nodes and magnetic ordering in the topological semimetal V 1/3 NbS 2 . Preprint at http://arxiv.org/abs/2504.04590 (2025).\n\nSun, K., Yao, H., Fradkin, E. & Kivelson, S. A. Topological insulators and nematic phases from spontaneous symmetry breaking in 2D Fermi systems with a quadratic band crossing. Phys. Rev. Lett. 103, 046811 (2009).\n\nSteward, C. R. W., Fernandes, R. M. & Schmalian, J. Dynamic paramagnon-polarons in altermagnets. Phys. Rev. B 108, 144418 (2023).\n\nMartin, I. & Batista, C. D. Itinerant electron-driven chiral magnetic ordering and spontaneous quantum Hall effect in triangular lattice models. Phys. Rev. Lett. 101, 156402 (2008).",
      "url": "https://www.nature.com/articles/s41586-025-09883-2",
      "source": "Nature",
      "published": "2026-01-22",
      "sentiment_score": 0.85,
      "reasoning": "The article reviews and consolidates significant recent advances in the discovery and understanding of altermagnetism, a newly identified distinct class of magnetic order with unique symmetry properties and promising applications in spintronics and quantum materials. This represents a major breakthrough in condensed matter physics and materials science with broad potential impact on technology development, including energy-efficient electronics and quantum computing. The article provides substantial context, references experimental and theoretical progress, and highlights the significance of altermagnetism beyond traditional magnetism, fulfilling criteria for positive real-world impact, broad significance, and substantive content.",
      "category": "Technology",
      "personality_title": "Scientists uncover unique magnetic order called altermagnetism with new tech potential",
      "personality_presentation": "**Context** – Magnetism is a property of materials that causes them to attract or repel each other, and it is used in many technologies like electric motors and data storage. Traditionally, scientists have known two main types of magnetic order: ferromagnetism, where spins align in the same direction, and antiferromagnetism, where spins align in opposite directions. Recently, researchers have discovered a new kind called altermagnetism, which shows different symmetry and spin arrangements.\n\n**What happened** – A recent scientific review published in the journal Nature on January 21, 2026, explains the discoveries and experiments about altermagnetism. This new type of magnetism has been studied by many scientists who have used advanced methods like microscopy and spectroscopy to observe its unique behavior. Altermagnetism is different because it combines certain symmetries in the spin and crystal structure that don’t appear in traditional magnets. Researchers have also explored how altermagnets can interact with superconductors and produce unusual electrical effects.\n\n**Impact** – Altermagnetism offers new ways to control magnetic properties in materials without relying on traditional spin-orbit coupling. This could lead to better materials for spintronics, a technology that uses electron spins to store and process information more efficiently than current electronics. For example, altermagnets can create spin splitting effects that might be used for faster and lower-energy memory devices or quantum computers. The discovery expands the understanding of magnetism and opens new research and technology opportunities.\n\n**What's next step** – Scientists plan to explore more materials that show altermagnetism and test how they perform in devices. They also want to study how altermagnetism works together with other effects like superconductivity and topological properties. These studies could help design new electronic components that are smaller, faster, and use less power. Experimental work is ongoing to confirm theoretical predictions and find practical applications.\n\n**One-sentence takeaway** – Altermagnetism is a newly discovered magnetic order with unique symmetries that could transform future electronics by enabling more efficient spin-based technologies.",
      "personality_title_fr": "Les scientifiques découvrent un ordre magnétique unique appelé altermagnétisme avec un nouveau potentiel technologique",
      "personality_presentation_fr": "**Contexte** – Le magnétisme est une propriété des matériaux qui leur permet de s’attirer ou de se repousser, utilisée dans de nombreuses technologies comme les moteurs électriques et le stockage de données. Jusqu’à présent, les scientifiques connaissaient deux principaux types d’ordre magnétique : le ferromagnétisme, où les spins s’alignent dans la même direction, et l’antiferromagnétisme, où les spins s’alignent en sens opposés. Récemment, un nouveau type appelé altermagnétisme a été découvert, présentant des symétries et des arrangements de spins différents.\n\n**Ce qui s’est passé** – Une revue scientifique publiée dans la revue Nature le 21 janvier 2026 explique les découvertes et expériences sur l’altermagnétisme. Ce nouveau type de magnétisme a été étudié par de nombreux chercheurs utilisant des méthodes avancées comme la microscopie et la spectroscopie pour observer son comportement unique. L’altermagnétisme se distingue par la combinaison de certaines symétries dans la structure des spins et du cristal, absentes des aimants traditionnels. Les chercheurs ont aussi exploré comment les altermagnétismes interagissent avec la supraconductivité et produisent des effets électriques inhabituels.\n\n**Impact** – L’altermagnétisme offre de nouvelles façons de contrôler les propriétés magnétiques des matériaux sans dépendre du couplage spin-orbite traditionnel. Cela pourrait conduire à de meilleurs matériaux pour la spintronique, une technologie qui utilise les spins des électrons pour stocker et traiter l’information plus efficacement que l’électronique actuelle. Par exemple, les altermagnétismes peuvent créer des effets de séparation de spin utiles pour des mémoires plus rapides et moins énergivores ou pour l’informatique quantique. Cette découverte élargit la compréhension du magnétisme et ouvre de nouvelles perspectives de recherche et de technologie.\n\n**Prochaine étape** – Les scientifiques prévoient d’explorer davantage de matériaux présentant l’altermagnétisme et de tester leurs performances dans des dispositifs. Ils veulent aussi étudier comment l’altermagnétisme interagit avec d’autres effets comme la supraconductivité et les propriétés topologiques. Ces études pourraient aider à concevoir de nouveaux composants électroniques plus petits, plus rapides et moins gourmands en énergie. Des travaux expérimentaux sont en cours pour confirmer les prédictions théoriques et trouver des applications pratiques.\n\n**Résumé en une phrase** – L’altermagnétisme est un nouvel ordre magnétique aux symétries uniques qui pourrait transformer l’électronique future en permettant des technologies spintroniques plus efficaces.",
      "personality_title_es": "Científicos descubren un orden magnético único llamado altermagnetismo con nuevo potencial tecnológico",
      "personality_presentation_es": "**Contexto** – El magnetismo es una propiedad de los materiales que les permite atraerse o repelerse, y se usa en muchas tecnologías como motores eléctricos y almacenamiento de datos. Tradicionalmente, los científicos han conocido dos tipos principales de orden magnético: ferromagnetismo, donde los spins se alinean en la misma dirección, y antiferromagnetismo, donde los spins se alinean en direcciones opuestas. Recientemente, se ha descubierto un nuevo tipo llamado altermagnetismo, que presenta diferentes simetrías y arreglos de spins.\n\n**Qué sucedió** – Una revisión científica publicada en la revista Nature el 21 de enero de 2026 explica los descubrimientos y experimentos sobre el altermagnetismo. Este nuevo tipo de magnetismo ha sido estudiado por muchos científicos que han usado métodos avanzados como microscopía y espectroscopía para observar su comportamiento único. El altermagnetismo es diferente porque combina ciertas simetrías en el spin y la estructura cristalina que no aparecen en los imanes tradicionales. Los investigadores también han explorado cómo los altermagnetos pueden interactuar con superconductores y producir efectos eléctricos inusuales.\n\n**Impacto** – El altermagnetismo ofrece nuevas formas de controlar las propiedades magnéticas en materiales sin depender del acoplamiento spin-órbita tradicional. Esto podría llevar a mejores materiales para la espintrónica, una tecnología que usa los spins de electrones para almacenar y procesar información de manera más eficiente que la electrónica actual. Por ejemplo, los altermagnetos pueden crear efectos de separación de spin que podrían usarse para dispositivos de memoria más rápidos y que consuman menos energía o para computadoras cuánticas. El descubrimiento amplía la comprensión del magnetismo y abre nuevas oportunidades de investigación y tecnología.\n\n**Próximo paso** – Los científicos planean explorar más materiales que muestren altermagnetismo y probar su desempeño en dispositivos. También quieren estudiar cómo el altermagnetismo funciona junto con otros efectos como la superconductividad y las propiedades topológicas. Estos estudios podrían ayudar a diseñar nuevos componentes electrónicos que sean más pequeños, rápidos y consuman menos energía. El trabajo experimental continúa para confirmar predicciones teóricas y encontrar aplicaciones prácticas.\n\n**Frase clave** – El altermagnetismo es un nuevo orden magnético con simetrías únicas que podría transformar la electrónica futura al permitir tecnologías basadas en spin más eficientes.",
      "image_url": "public/images/fallback4.png",
      "image_prompt": "A detailed, warmly colored abstract painting depicting intertwined, symmetrical crystalline lattice structures with flowing, wave-like spin patterns radiating through them, symbolizing the unique nonrelativistic spin symmetries and altermagnetic phases in magnetic materials."
    },
    {
      "title": "NASA Tests Technology Offering Potential Fuel Savings for Commercial Aviation",
      "summary": "NASA researchers successfully completed a high-speed taxi test of a scale model of a design that could make future aircraft more efficient by improving how air flows across a wing’s surface, saving fuel and money. On Jan. 12, the Crossflow Attenuated Natural Laminar Flow (CATNLF) test article reached speeds of approximately 144 mph, marking its […]",
      "content": "NASA’s Cross Flow Attenuated Natural Laminar Flow test article is mounted beneath the agency’s F-15 research aircraft ahead of the design’s high-speed taxi test on Tuesday, Jan. 12, 2026, at NASA’s Armstrong Flight Research Center in Edwards, California. The 3-foot-tall scale model is designed to increase a phenomenon known as laminar flow and reduce drag, improving efficiency in large, swept wings like those found on most commercial aircraft. NASA/Christopher LC Clark\n\nNASA researchers successfully completed a high-speed taxi test of a scale model of a design that could make future aircraft more efficient by improving how air flows across a wing’s surface, saving fuel and money.\n\nOn Jan. 12, the Crossflow Attenuated Natural Laminar Flow (CATNLF) test article reached speeds of approximately 144 mph, marking its first major milestone. The 3-foot-tall scale model looks like a fin mounted under the belly of one of the agency’s research F-15B testbed jets. However, it’s a scale model of a wing, mounted vertically instead of horizontally. The setup allows NASA to flight-test the wing design using an existing aircraft.\n\nThe CATNLF concept aims to increase a phenomenon known as laminar flow and reduce wind resistance, also known as drag.\n\nA NASA computational study conducted between 2014 and 2017 estimated that applying a CATNLF wing design to a large, long-range aircraft like the Boeing 777 could achieve annual fuel savings of up to 10%. Although quantifying the exact savings this technology could achieve is difficult, the study indicates it could approach millions of dollars per aircraft each year.\n\nNASA’s Cross Flow Attenuated Natural Laminar Flow test article is mounted beneath the agency’s F-15 research aircraft ahead of the design’s high-speed taxi test on Tuesday, Jan. 12, 2026, at NASA’s Armstrong Flight Research Center in Edwards, California. The 3-foot-tall scale model is designed to increase a phenomenon known as laminar flow and reduce drag, improving efficiency in large, swept wings like those found on most commercial aircraft. NASA/Christopher LC Clark\n\n“Even small improvements in efficiency can add up to significant reductions in fuel burn and emissions for commercial airlines,” said Mike Frederick, principal investigator for CATNLF at NASA’s Armstrong Flight Research Center in Edwards, California.\n\nReducing drag is key to improving efficiency. During flight, a thin cover of air known as the boundary layer forms very near an aircraft’s surface. In this area, most aircraft experience increasing friction, also known as turbulent flow, where air abruptly changes direction. These abrupt changes increase drag and fuel consumption. CATNLF increases laminar flow, or the smooth motion of air, within the boundary layer. The result is more efficient aerodynamics, reduced friction, and less fuel burn.\n\nThe CATNLF testing falls under NASA’s Flight Demonstrations and Capabilities project, a part of the agency’s Integrated Aviation Systems Program under the Aeronautics Research Mission Directorate. The concept of was first developed by NASA’s Advanced Air Transport Technology project, and in 2019, NASA Armstrong researchers developed the initial shape and parameters of the model. The design was later refined for efficiency at NASA’s Langley Research Center in Hampton, Virginia.\n\n“Laminar flow technology has been studied and used on airplanes to reduce drag for many decades now, but laminar flow has historically been limited in application,” said Michelle Banchy, Langley principal investigator for CATNLF.\n\nNASA ground crew prepares the agency’s F-15 research aircraft and Cross Flow Attenuated Natural Laminar Flow (CATNLF) test article ahead of its first high-speed taxi test on Tuesday, Jan. 12, 2026, at NASA’s Armstrong Flight Research Center in Edwards, California. The CATNLF design aims to reduce drag on wing surfaces to improve efficiency and, in turn, reduce fuel burn. NASA/Christopher LC Clark\n\nThis limitation is due to crossflow, an aerodynamic phenomenon on angled surfaces that can prematurely end laminar flow. While large, swept wings like those found on most commercial aircraft provide aerodynamic efficiencies, crossflow tendencies remain.\n\nIn a 2018 wind tunnel test at Langley, researchers confirmed that the CATNLF design successfully achieved prolonged laminar flow.\n\n“After the positive results in the wind tunnel test, NASA saw enough promise in the technology to progress to flight testing,” Banchy said. “Flight testing allows us to increase the size of the model and fly in air that has less turbulence than a wind tunnel environment, which are great things for studying laminar flow.”\n\nNASA Armstrong’s F-15B testbed aircraft provides the necessary flight environment for laminar flow testing, Banchy said. The aircraft enables researchers to address fundamental questions about the technology while keeping costs lower than alternatives, such as replacing a test aircraft’s wing with a full-scale CATNLF model or building a dedicated demonstrator aircraft.\n\nNASA’s Cross Flow Attenuated Natural Laminar Flow (CATNLF) scale model completes its first major milestone – high-speed taxi test – Tuesday, Jan. 12, 2026, at Edwards Air Force Base in California. NASA’s F-15 research aircraft, with the 3-foot-tall test article mounted on its underside, reached speeds of approximately 144 mph during testing. If successful, the technology could be applied to future commercial aircraft to improve efficiency and potentially reduce fuel consumption. NASA/Christopher LC Clark\n\nCATNLF currently focuses on commercial aviation, which has steadily increased over the past 20 years, with passenger numbers expected to double in the next 20, according to the International Civil Aviation Organization. Commercial passenger aircraft fly at subsonic speeds, or slower than the speed of sound.\n\n“Most of us fly subsonic, so that’s where this technology would have the greatest impact right now,” Frederick said. NASA’s previous computational studies also confirmed that technology like CATNLF could be adapted for supersonic application.\n\nIn the coming weeks, CATNLF is expected to begin its first flight, kicking off a series of test flights designed to evaluate the design’s performance and capabilities in flight.\n\nLooking ahead, NASA’s work on CATNLF could lay the groundwork for more efficient commercial air travel and might one day extend similar capabilities to supersonic flight, improving fuel efficiency at even higher speeds.\n\n“The CATNLF flight test at NASA Armstrong will bring laminar technology one step closer to being implemented on next-generation aircraft,” Banchy said.",
      "url": "https://www.nasa.gov/centers-and-facilities/armstrong/nasa-tests-technology-offering-potential-fuel-savings-for-commercial-aviation/",
      "source": "NASA",
      "published": "2026-01-21",
      "sentiment_score": 0.85,
      "reasoning": "The article reports on NASA's successful testing of a new wing design technology (CATNLF) that can significantly improve fuel efficiency in commercial aviation by reducing drag. This has broad implications for reducing fuel consumption and emissions in the aviation industry, benefiting society and the environment. The story is focused on a single, well-explained technological breakthrough with clear potential for large-scale positive impact.",
      "category": "Technology",
      "personality_title": "NASA tests new wing design to save fuel on future airplanes",
      "personality_presentation": "**Context** – NASA is working on ways to make airplanes use less fuel by improving how air moves over their wings. This can help airlines save money and reduce pollution.\n\n**What happened** – On January 12, 2026, NASA tested a small 3-foot model of a new wing design called Crossflow Attenuated Natural Laminar Flow (CATNLF). The model was attached under a research jet and reached speeds of about 144 mph during a high-speed taxi test on the runway.\n\n**Impact** – This new wing design helps air flow smoothly over the wing, reducing drag, which is like wind resistance. With less drag, airplanes need less fuel to fly. NASA studies suggest this could save up to 10% of fuel for big planes like the Boeing 777, which could mean millions of dollars saved each year for airlines.\n\n**What's next step** – In the coming weeks, NASA plans to fly the model to see how it performs in real flight conditions. If successful, this technology could be used on future commercial airplanes and maybe even faster supersonic jets.\n\n**One-sentence takeaway** – NASA’s new wing design shows promise to reduce fuel use and costs by improving how air flows over airplane wings.\n\n",
      "personality_title_fr": "La NASA teste une nouvelle conception d’aile pour économiser du carburant sur les avions futurs",
      "personality_presentation_fr": "**Contexte** – La NASA cherche des moyens de réduire la consommation de carburant des avions en améliorant la manière dont l’air circule sur leurs ailes. Cela peut aider les compagnies aériennes à économiser de l’argent et à réduire la pollution.\n\n**Ce qui s’est passé** – Le 12 janvier 2026, la NASA a testé un petit modèle de 3 pieds d’une nouvelle conception d’aile appelée Crossflow Attenuated Natural Laminar Flow (CATNLF). Le modèle était fixé sous un avion de recherche et a atteint environ 144 mph lors d’un test de roulage à grande vitesse.\n\n**Impact** – Cette nouvelle conception d’aile permet à l’air de circuler plus doucement, réduisant la traînée, ou résistance au vent. Avec moins de traînée, les avions consomment moins de carburant. Selon des études de la NASA, cela pourrait permettre d’économiser jusqu’à 10 % de carburant pour les gros avions comme le Boeing 777, ce qui représenterait des millions de dollars économisés chaque année pour les compagnies aériennes.\n\n**Prochaine étape** – Dans les semaines à venir, la NASA prévoit de faire voler le modèle pour observer ses performances en conditions réelles. Si cela fonctionne, cette technologie pourrait être utilisée sur les avions commerciaux futurs et peut-être même sur des jets supersoniques.\n\n**Résumé en une phrase** – La nouvelle conception d’aile de la NASA promet de réduire la consommation de carburant et les coûts en améliorant la circulation de l’air sur les ailes des avions.\n\n",
      "personality_title_es": "La NASA prueba un nuevo diseño de ala para ahorrar combustible en futuros aviones",
      "personality_presentation_es": "**Contexto** – La NASA está buscando formas de hacer que los aviones usen menos combustible mejorando cómo el aire fluye sobre sus alas. Esto puede ayudar a las aerolíneas a ahorrar dinero y reducir la contaminación.\n\n**Qué pasó** – El 12 de enero de 2026, la NASA probó un pequeño modelo de 3 pies de un nuevo diseño de ala llamado Crossflow Attenuated Natural Laminar Flow (CATNLF). El modelo estaba montado bajo un avión de investigación y alcanzó velocidades de aproximadamente 144 mph durante una prueba de rodaje a alta velocidad.\n\n**Impacto** – Este nuevo diseño de ala ayuda a que el aire fluya suavemente sobre el ala, reduciendo la resistencia al viento llamada arrastre. Con menos arrastre, los aviones necesitan menos combustible para volar. Los estudios de la NASA sugieren que esto podría ahorrar hasta un 10 % de combustible en aviones grandes como el Boeing 777, lo que podría significar millones de dólares ahorrados cada año para las aerolíneas.\n\n**Próximo paso** – En las próximas semanas, la NASA planea volar el modelo para ver cómo funciona en condiciones reales de vuelo. Si tiene éxito, esta tecnología podría usarse en futuros aviones comerciales y quizás en jets supersónicos más rápidos.\n\n**Resumen en una frase** – El nuevo diseño de ala de la NASA muestra potencial para reducir el uso de combustible y costos al mejorar cómo fluye el aire sobre las alas de los aviones.\n\n",
      "image_url": "public/images/news_image_NASA-Tests-Technology-Offering-Potential-Fuel-Savi.png",
      "image_prompt": "A detailed, warm painting of a sleek, stylized aircraft wing with smooth, flowing air currents gently gliding over its surface, mounted beneath a symbolic streamlined jet silhouette on a runway at a research center, using soft natural tones of blue, gray, and beige to evoke innovation and efficiency in aviation."
    },
    {
      "title": "The EU launches telecom reform: ‘fiber, 5G and cooperation for Big Tech’",
      "summary": "Europe presents the new Digital Networks Act (Dna) “to modernize and harmonize the rules on digital networks.” As already anticipated, the most significant change is the farewell to copper: by 2029 each member country will have to present a national plan to complete the transition to fiber by 2035",
      "content": "Europe presents the new Digital Networks Act (Dna) “to modernize and harmonize the rules on digital networks.” As already anticipated, the most significant change is the farewell to copper: by 2029 each member country will have to present a national plan to complete the transition to fiber by 2035\n\nBrussels (ANSA) – Europe presents the new Digital Networks Act (DNA) “to modernize and harmonize the rules on digital networks.” As already anticipated, the most significant innovation is the farewell to copper: by 2029 each member country will have to present a national plan to complete the transition to fiber by 2035.\n\nAnother critical front is 5G, still lagging behind the United States and Asia, especially in terms of network quality, penalized by costly auctions and fragmented markets: the DNA focuses on greater spectrum coordination and rules that favor stand-alone 5G, considered strategic for industry, logistics, healthcare and defense.\n\nThe major reform, presented in Strasbourg by the vice president of the EU Commission Henna Virkkunen, aims to create a true single telecoms market. A “single passport” is thus introduced that will allow operators to offer services throughout the EU by registering in just one country. In the same logic fall the harmonization of spectrum allocation – with licenses of unlimited duration – and EU-level authorization for satellite operators, which will be issued directly by the European Commission.\n\nOn the front of relations with Big Tech, the fair share (the tax for the use of continental infrastructure) does not arrive, but there is a call for greater cooperation with a conciliation mechanism to resolve disputes over commercial agreements and the use of network infrastructure. On the security front, a “preparedness plan” is envisaged to strengthen the resilience of networks against natural disasters and cyberattacks.\n\nFinally, the DNA confirms the principles of net neutrality, but allows Brussels to adapt its rules to future technological developments. On the governance side, the text provides for the creation of two new bodies – the Radio Spectrum Policy Body (RSPB) and the Office for Digital Networks (ODN) – intended to replace the current Radio Spectrum Policy Group (RSPG) and the Berec office (January 21).",
      "url": "https://europeannewsroom.com/the-eu-launches-telecom-reform-fiber-5g-and-cooperation-for-big-tech/",
      "source": "European Newsroom",
      "published": "2026-01-21",
      "sentiment_score": 0.8,
      "reasoning": "The EU Digital Networks Act represents a significant policy reform with broad positive impact by modernizing telecom infrastructure, mandating fiber transition, improving 5G deployment, harmonizing regulations across member states, and enhancing network security and cooperation. This will benefit millions of Europeans by improving connectivity, fostering innovation, and creating a unified telecom market.",
      "category": "Technology",
      "personality_title": "EU sets plan to replace copper with fiber and boost 5G by 2035",
      "personality_presentation": "**Context** – Europe’s digital networks use old copper cables and slower 5G services compared to other parts of the world. Different countries have their own rules, making it hard for companies to work across borders.\n\n**What happened** – The European Union introduced the Digital Networks Act (DNA) to update and unify telecom rules. By 2029, every EU country must share a plan to replace copper cables with faster fiber optics by 2035. The law also supports better 5G networks by coordinating radio waves and simplifying licenses. It creates a “single passport” for telecom companies to operate easily across the EU. New bodies will manage radio waves and digital networks at the EU level.\n\n**Impact** – This is important because fiber internet is much faster and more reliable than copper. Better 5G will improve services in hospitals, factories, and transportation. A unified market means companies can offer services more easily across Europe, helping people get better internet faster. Security plans will help protect networks from attacks and disasters.\n\n**What’s next step** – Countries must create their fiber transition plans by 2029. The EU will start issuing common licenses and set up new groups to manage networks and radio spectrum. Telecom companies and governments will need to cooperate more closely to meet these goals.\n\n**One-sentence takeaway** – The EU’s new Digital Networks Act aims to modernize internet connections and 5G across Europe by replacing copper cables with fiber and simplifying rules for telecom companies by 2035.",
      "personality_title_fr": "L’UE planifie la fin du cuivre pour la fibre et améliore la 5G d’ici 2035",
      "personality_presentation_fr": "**Contexte** – Les réseaux numériques européens utilisent encore des câbles en cuivre anciens et des services 5G moins performants que dans d’autres régions. Chaque pays a ses propres règles, compliquant le travail des entreprises à travers l’Union.\n\n**Ce qui s’est passé** – L’Union européenne a présenté la loi sur les réseaux numériques (DNA) pour mettre à jour et unifier les règles des télécoms. D’ici 2029, chaque pays doit présenter un plan pour remplacer le cuivre par la fibre optique d’ici 2035. La loi soutient aussi une meilleure 5G en coordonnant les fréquences et en simplifiant les licences. Un « passeport unique » permettra aux opérateurs de fonctionner facilement dans toute l’UE. De nouveaux organismes géreront les réseaux et les fréquences au niveau européen.\n\n**Impact** – C’est important car la fibre offre un internet beaucoup plus rapide et fiable que le cuivre. Une meilleure 5G améliorera les services dans les hôpitaux, les usines et les transports. Un marché unifié facilitera l’offre de services dans toute l’Europe, pour un meilleur internet plus rapide. Des plans de sécurité protégeront les réseaux des attaques et catastrophes.\n\n**Prochaine étape** – Les pays doivent créer leurs plans de transition vers la fibre d’ici 2029. L’UE commencera à délivrer des licences communes et mettra en place de nouveaux groupes pour gérer les réseaux et le spectre radio. Les entreprises et gouvernements devront coopérer pour atteindre ces objectifs.\n\n**Phrase clé** – La nouvelle loi européenne sur les réseaux numériques vise à moderniser la connexion internet et la 5G en Europe en remplaçant le cuivre par la fibre et en simplifiant les règles pour les opérateurs d’ici 2035.",
      "personality_title_es": "La UE planea eliminar el cobre para fibra y mejorar el 5G para 2035",
      "personality_presentation_es": "**Contexto** – Las redes digitales europeas todavía usan cables de cobre antiguos y servicios 5G menos avanzados que en otras regiones. Cada país tiene sus propias reglas, lo que dificulta que las empresas trabajen en toda la Unión Europea.\n\n**Qué pasó** – La Unión Europea presentó la Ley de Redes Digitales (DNA) para actualizar y unificar las normas de telecomunicaciones. Para 2029, cada país debe presentar un plan para cambiar el cobre por fibra óptica antes de 2035. La ley también apoya una mejor 5G coordinando las frecuencias y simplificando las licencias. Se crea un “pasaporte único” para que las empresas puedan operar fácilmente en toda la UE. Nuevos organismos gestionarán las redes y el espectro radioeléctrico a nivel europeo.\n\n**Impacto** – Esto es importante porque la fibra ofrece internet mucho más rápido y confiable que el cobre. Mejorar el 5G beneficiará hospitales, fábricas y transporte. Un mercado unificado facilitará que las empresas ofrezcan servicios en toda Europa, mejorando el internet para todos más rápido. Los planes de seguridad protegerán las redes contra ataques y desastres.\n\n**Próximo paso** – Los países deben crear sus planes de transición a fibra para 2029. La UE empezará a emitir licencias comunes y creará nuevos grupos para gestionar las redes y el espectro. Empresas y gobiernos deberán colaborar para cumplir estos objetivos.\n\n**Frase clave** – La nueva Ley de Redes Digitales de la UE busca modernizar internet y 5G en Europa, reemplazando el cobre por fibra y simplificando las normas para las empresas para 2035.",
      "image_url": "public/images/news_image_The-EU-launches-telecom-reform-fiber-5G-and-cooper.png",
      "image_prompt": "An intricate, warm-toned painting of a vast European landscape transformed by glowing fiber-optic cables intertwining like rivers connecting diverse cities under a soft sky, with stylized 5G signal waves radiating upward from sleek towers and abstract satellite dishes orbiting gently above, symbolizing unified digital networks and cooperative innovation across the continent."
    }
  ]
}