{
  "personality": null,
  "timestamp": "2026-02-17T05:32:38.298505",
  "category": "Environment",
  "news_summary": "Innovative approaches in waste management, plant resilience, tree care for carbon capture, and glacier research are advancing sustainability and climate solutions.",
  "news_summary_fr": "Des approches innovantes en matière de gestion des déchets, de résilience des plantes, d'entretien des arbres pour la capture du carbone et de recherche sur les glaciers font progresser la durabilité et les solutions climatiques.",
  "news_summary_es": "Los enfoques innovadores en la gestión de residuos, la resiliencia de las plantas, el cuidado de los árboles para la captura de carbono y la investigación de los glaciares están impulsando la sostenibilidad y las soluciones climáticas.",
  "articles": [
    {
      "title": "Sustainability In Your Ear: CurbWaste’s Mike Marmo Is Building the Waste Logistics Layer of the Circular Economy",
      "summary": "The U.S. waste management industry moves more than 290 million tons of municipal solid waste...\nThe post Sustainability In Your Ear: CurbWaste’s Mike Marmo Is Building the Waste Logistics Layer of the Circular Economy appeared first on Earth911.",
      "content": "The U.S. waste management industry moves more than 290 million tons of municipal solid waste each year. This is a potential trillion-dollar market, but much of the work still relies on paper tickets, clipboards, and spreadsheets. About 10,000 independent haulers handle a large share of collection and materials transfer in the U.S. In this business, a single truck costs $300,000, and profits depend on efficient routes. Most haulers do not have access to the digital tools that other logistics industries have used for years. Mike Marmo, CEO and founder of CurbWaste , is building a new operating system to change this. His goal is to create the data foundation needed for the circular economy to work. He is a fourth-generation waste industry professional who started his career as a scale operator at a family transfer station in New York and sold a hauling business in 2021. Since then, he’s built CurbWaste into a platform serving more than 150 haulers in 40 states. Its CurbPOS system for transfer stations tracks inbound and outbound materials with scale integration. It generates automated LEED diversion reports and Recycling Certification Institute -certified documentation; the per-load, per-material chain-of-custody data that extended producer responsibility programs need, as seven states now require producers to fund and document the recycling of their packaging.\n\nMike made a simple but important point: “Waste is being created when it’s being manufactured.” The waste management industry reflects the economy and could become the base for a circular supply chain that keeps materials in use. Mike compares this to Amazon, which learned about buyer behavior and then built warehousing, freight, and delivery systems around that knowledge. The waste industry can do something similar. By tracking what is produced, where it goes, and where it ends up, haulers and new operators can work together on a shared digital system that gives full visibility of materials. Mike calls this the “waste meter,” and he thinks an AI-powered circular economy could be in place within 10 years. Accenture research estimates that the circular economy could add $4.5 trillion in economic output by 2030, a number supported by the United Nations Development Program . Right now, investment is far below what is needed to reach that potential. CurbWaste is working to build the transparency needed to connect collection and vision, helping turn a fragmented industry into a circular supply chain. To learn more, visit curbwaste.com\n\nSubscribe to Sustainability In Your Ear on iTunes\n\nFollow Sustainability In Your Ear on Spreaker, iHeartRadio, or YouTube\n\nInterview Transcript\n\nMitch Ratcliffe 0:00\n\nHello, good morning, good afternoon or good evening, wherever you are on this beautiful planet of ours. Welcome to Sustainability In Your Ear. This is the podcast conversation about accelerating the transition to a sustainable, carbon-neutral society, and I’m your host, Mitch Ratcliffe. Thank you for joining the conversation.\n\nToday, we’re going to take another dive into the circular economy, this time about how we manage our waste collection and processing systems. The U.S. waste management industry moves more than 290 million tons of municipal solid waste a year. It’s a potential trillion-dollar market, yet much of it still runs on paper, tickets, clipboards, and spreadsheets. Roughly 10,000 independent haulers handle a significant share of American collection and materials transfer, and they work in a business where a single truck costs $300,000 and profitability depends on route efficiency. Yet most of these haulers lack access to the digital infrastructure that other logistics-centric industries adopted a decade ago.\n\nNow that society recognizes the immense value in waste—that it’s not just something to dispose of as quickly and quietly as possible, to manage for profitable reuse in a growing circular economy—the waste management industry is in the midst of a vast upgrade.\n\nAnd our guest today is Mike Marmo, the CEO and founder of CurbWaste, an end-to-end operating system built for independent waste haulers. Mike is a fourth-generation waste industry professional. His great-grandfather started in the business, and Mike started his career working at a family transfer station in New York. Then he built his own collection and disposal hauling company called Curbside, and when COVID shutdowns wiped out three months of construction-dependent revenue, he pivoted to focus on the software platform his hauling company had built. He sold that hauling business in 2021 and has spent the years since building CurbWaste into a platform that now serves more than 150 haulers across 40 states, from five-truck family operations to 200-vehicle regional fleets.\n\nCurbWaste brings order management, real-time dispatch, route optimization, automated invoicing, driver apps, and e-commerce into a single cloud-based platform. Its CurbPOS point-of-sale system for transfer stations tracks inbound and outbound materials with scale integration, and uses weighted averages by material type to generate automated LEED diversion reports and Recycling Certification Institute certified documentation. In other words, it helps a hauler qualify for environmental incentives that gives contractors and developers defensible, third-party verifiable proof that their construction waste was actually diverted from a landfill. And that, too, creates another economic opportunity.\n\nThe per-load, per-material chain-of-custody data is what the emerging extended producer responsibility programs that we’ve discussed many times need, as seven states now require producers to fund and document the collection, sorting, and recycling of their packaging. So if you put this operating system under the circular economy, you start to track the value flow, and that means more value can be recognized and rewarded.\n\nIn October, CurbWaste closed a $28 million Series B round led by Socium Ventures—that’s the venture capital arm of Cox Enterprises—bringing its total funding to $50 million. The investment is fueling AI-powered business intelligence tools designed to give independent haulers the kind of data-driven decision making that larger competitors like Waste Management and Republic Services have built in their own proprietary systems.\n\nWe’ll talk with Mike about what it takes to digitize an industry that’s resisted technology adoption for decades, how CurbPOS’s materials tracking could extend from LEED compliance into EPR reporting and regional materials flow planning, and whether a network of independent haulers on a shared platform can become a connective tissue for an emerging circular economy supply chain. And finally, what is AI actually delivering for waste operations today compared to the hype we’re hearing?\n\nYou can learn more about CurbWaste at curbwaste.com—CurbWaste is all one word, no space, no dash.\n\nSo, can a software platform that modernizes independent hauling also help build the data infrastructure for the circular economy? Let’s find out right after this quick commercial break.\n\n[COMMERCIAL BREAK]\n\nWelcome to the show, Mike. How you doing today?\n\nMike Marmo 4:42\n\nI’m doing well. How are you doing?\n\nMitch Ratcliffe 4:44\n\nDoing well. It’s a beautiful day here in Southern Oregon, and I know in New York City you’re getting through the snow.\n\nMike Marmo 4:51\n\nYes, it’s really cold.\n\nMitch Ratcliffe 4:53\n\nI want to start off with this question, and it goes back to the fact that your great-grandfather started this business, or started in this business. Walk us through the paper and digital processes that recycling operations have been using, and how CurbPOS changes their day-to-day work.\n\nMike Marmo 5:07\n\nYeah. So my family had grown up in this, you know, been in this business. I had grown up in this business. Actually, my first job, I was a scale operator starting at a transfer station. And when I was working there, everything was pen to paper. You know, we used a traditional scale ticket. We would put it through this, you know, the EXP printer.\n\nAnd, you know, within that first year of really working there, I started to realize how difficult it was and how much manual work was happening. You know, a lot of the requests that we were getting at that facility—it was a C&D facility—a lot of the requests we were getting were for LEED, or for something that was related to a regulatory compliance effort, and to get all that information was fairly difficult. So we, you know, at that point, I really understood kind of where the waste industry was relative to the technology around me and my regular day-to-day life, and when I started a waste company, and then ultimately ended up starting a software company, I really saw it at scale, working with a lot of companies around the country that are starting pen to paper or operating off kind of archaic systems.\n\nAnd so when we originally built CurbWaste and then the CurbPOS product, which is for the transfer stations and recycling centers, we really hyper-focused on automating tasks and making sure that everything was as digital as possible for aggregation of data. So I think we’re starting to see adoption along the way, and I think the waste industry is progressing, but ultimately, I think a digital experience is necessary. And I think it’s for the future of the industry and for the future of the way that we operate in our waste streams. I think it’s critical.\n\nMitch Ratcliffe 6:45\n\nWhen you pivoted from moving trash to selling software, how did that change your view of the system that you’d been working in?\n\nMike Marmo 6:52\n\nYeah, so New York, obviously, is fairly unique. We were operating the five boroughs, and there are many limitations, regulatory compliance. It’s very difficult to navigate logistically—you know, so many people, and limited parking, limited space, very tight. So you know, when you’re operating in that bubble, you don’t have a lot of options on how you have to operate. You have to be really, really good and really, really pointed.\n\nBut then once we moved into the software space, and we started to see, you know, around the country, how people operate, the term I like to use always is “local,” because it really is. You know, we’re all fundamentally doing the same thing. We’re all picking up garbage. We’re all bringing it to facilities. They’re processing materials. But the way they do it, or the nuances around that workflow, are very different, depending on where you are.\n\nAnd the example I’ll use is like, you know, you have New York City—again, that’s like a very tight space, limited space, lot of people. And then you’ll operate with a company down in Alabama or Mississippi that has a big urban sprawl, and they have different types of issues, different types of problems. And so everybody’s trying to do the best they can from a service perspective. But ultimately, it really is dependent on where you are regionally. And I think that’s where dynamic software and the ability to be dynamic really provides a lot of value overall.\n\nMitch Ratcliffe 8:04\n\nThe old approach to this business was you had a landfill and you had a certain number of years to fill it, and so you were managing filling a hole rather than extracting value from the waste stream. How have you seen that transition change the focus of the business that you’re trying to support with software?\n\nMike Marmo 8:21\n\nSo I think, I mean, maybe I can take a step back into the history a little bit. To your point, I think waste used to be volume-based. It was very much like, I charge a price per yard, I dump for price per yard. And there was a simplicity in that. But I think it also led to—kind of, the way that pricing was done was, again, very volume, and it was very simple.\n\nWhen the industry moved into weight and it started to weigh materials—and obviously within that, the kind of correlation of commodities being pulled out and the value in the global supply chain—there was a shift in the industry where some of the waste haulers still were pricing or stuck in a volume-based framework, but the facilities were pricing off of tonnage.\n\nAnd there was an evolution that happened over time. So what you end up seeing is like, if you order a dumpster, for example, and a dumpster has a certain amount of price and allowable tonnage, and then you’re pricing off a matrix format for additional tonnage—the industry shifted. There was a shift in the way that the industry actually started to work.\n\nSo now what ends up happening in that framework is, some landfills, you know, big facilities, certain markets have a lot of land and a lot of sprawl, and they have big holes with long lifespans. Whereas other markets don’t have any landfills, or have many landfills closing because they’re running out of space, and they’re moving to intermodal, or they’re moving to, again, like MRFs. There’s been more focus on bringing materials back into the supply chain. So I think we’re still seeing that shift happen. It’s still moving in that direction.\n\nAnd I think, again, like I always say, waste is a utility that’s not measurable, and I think that’s the main problem. And in order to do this well, you need to have a unit of measurement, a single point of truth. And so that’s why I think software comes into play. It’s able to aggregate a bunch of data—operational data, but also data that’s related to the material and waste streams—and be able to measure what’s going on, and then be able to make better business decisions and better regulatory decisions on the long term.\n\nMitch Ratcliffe 10:23\n\nCurbPOS tracks inbound and outbound materials at these transfer stations. When a truck dumps a load, what’s the data capture process, and how granular does it get in terms of the materials that you can classify and identify? And then what does that enable in terms of value extraction?\n\nMike Marmo 10:38\n\nIt all depends. It really depends on the market. Some, it hits the floor and then it just gets, you know, taken out to the next place. Other markets will obviously run it across a belt, pull out commodities. So there’s something measurable that’s happening.\n\nI think, you know, the age of technology now, you can do things like material recognition—AI being able to do material recognition and get components of that. Obviously, the certification bodies like RCI and LEED that are helping to kind of audit and make sure that there’s an evaluation period of whatever they’re saying they did, or whatever they’re pulling out of the stream.\n\nBut the inbound-outbound correlation is really what matters. Because when you’re coming onto the scale and you’re getting weighed and you’re putting it on the floor, once it hits the belt, we can then take the outbounds and create that mapping of, okay, this material, amount of material came in that day, this load hit the floor, and then this is what was distributed out. And then we can show you what a recycling rate was. I still think there’s more to be done there. I do think that cameras and AI can measure that when it hits the ground, but I think the industry is moving in the right direction overall.\n\nMitch Ratcliffe 11:52\n\nLet’s step back a little bit from the industry to, let’s say, a five-truck family operation that’s never used anything except maybe QuickBooks to do some invoicing. What is the actual on-ramp to CurbPOS look like for them? How does it change their business?\n\nMike Marmo 12:09\n\nYeah, so I think if you’re a hauler, you’re going to be on the CurbWaste product. If you’re transitioning to be on the CurbPOS product—but really, around implementation, I think that’s actually a natural point where people start thinking about software as a hauler. You know, you really want to be cost-efficient in the early days, and so sometimes software might be out of the price range. But I think as you start to grow, and you’re seeing that incremental growth, what most haulers are looking for at that point is efficiency and visibility.\n\nSo what software is able to do—operationally, it’s allowing you the ability to be efficient and to be able to see what’s working and what isn’t, and then it’s also giving you insights into what’s measurable, so that you can keep investing in the things that are working. That’s hard in the waste business overall, but it’s a good way to start.\n\nWhen you go through change management, change is hard all the time. Like, if you have a process that’s working, and it’s, you know, the kind of old adage, “If it ain’t broke, don’t fix it.” You hit a certain point where you have to make a decision about what you want—what is the motivating factor of the business? So are you trying to grow, or are you just trying to maintain where you are? Most people that are entering business and entrepreneurship are trying to grow. So then it becomes about scale. It becomes about, I need to maximize and focus on the most important thing, and I can’t do everything. And eliminating manual tasks allows you to scale more efficiently.\n\nSo you go through the buying process and you find the right fit for the software that you need in the moment of which you need it. But you also need to consider what you can scale into as you grow. And then you go through a process of entering orders, getting training, training the drivers, training the staff, making sure everybody understands how the system works. But then there’s a transition period. We stick with them, we make sure that everything is going the way that we hoped it would go, what the project plan said, and you’re supporting them along the way. But at a certain point, the system is running for you, and then they’re off to the races and they continue to scale.\n\nMitch Ratcliffe 13:53\n\nOne of the major changes in the industry that’s driving this transition is the introduction of extended producer responsibility laws, which require, for instance, you’re measuring material type, the weight, its recyclability, and whether it’s recycled, and getting verification of that diversion from landfill. Was that in your head when you started thinking about developing CurbWaste, or is this an opportunity that’s just sort of emerged conveniently at the same time?\n\nMike Marmo 14:20\n\n100%. When we got into this, the grander vision was the interconnectivity of the supply chain from a data perspective. So the way I kind of like to normalize it is, you have a generator, you have a collector—a hauler—you have a disposal site, and then ultimately end use, right? But it’s end of life. So does it go back into the supply chain through the circular economy? Does it end up in the hole? Whatever that is. There’s usually that period of time where the life cycle has ended.\n\nSo the way we thought about it was, well, where can we focus energy from a software perspective? I view the haulers and the transfer stations and the disposal centers as the core of the data set. So we really want to be hyper-focused on aggregating data and providing value in those areas. But ultimately, the idea was to interconnect the generation piece to the rest of it. So when we started, we really stayed focused on that part—the collector and the disposal. But now we’re starting to migrate into the generator piece, to really connect the data sets. And to your point, show where material is being generated, how it’s being generated, where it’s going, and ultimately where it ends up. That’s the measurement of the utility. That’s the waste meter. And that’s what we’re trying to achieve.\n\nMitch Ratcliffe 15:31\n\nWe’ve had a number of sorting and hauling folks on the show, as well as a lot of other thinkers on this topic of the circular economy. So building on this reality in which you’ve got verification that materials have been moved to a particular place and at a particular pace, do you imagine it’s possible to actually plan regional material flows, to really turn the circular economy on in its full flower?\n\nMike Marmo 15:55\n\nYes, I do. It’s a lofty goal. A lot has to happen. But I do believe that that’s possible. And the analogy I like to use is something like Amazon. Amazon was able to understand from a retail component, like, what buyer behavior was. They were able to leverage data around buyer behavior, and then they were able to integrate themselves into the supply chain—the freight forwarding, the warehousing, the ultimately last-mile delivery.\n\nAnd they do it so well. The reason why you’re able to get something in the same day is because they were able to connect all those pieces and understand the output. I believe that the waste industry can achieve that. And so that was a core part of what we are trying to do. You have to walk before you run. You can’t do everything all at once. And again, this is a business, right? Like, if I sign up a hauler and I can’t run their business, then the workflows—you have to build a foundation before you build the house. But I think the long-term vision is the ability to do exactly what you just said.\n\nMitch Ratcliffe 17:03\n\nMillions of people come to Earth911’s database to find out what to do with specific materials, and one of the things they’re interested in is getting the right material to the right place, so that it is actually recycled. And what you just described in the context of Amazon, for instance—should we not be thinking about putting everything in a single bin? But could we, in an economically viable way, actually have specialized collection that would produce a cleaner load?\n\nMike Marmo 17:33\n\nYeah. I mean, one of the things that I saw as a waste hauler that I struggled with was, we’re making decisions—whether regulatory or whether it’s, you know, just in general—like, if you’re trying to be a good actor and try to do the right things, but it’s not rooted in much data. And so what I tried to say was, well, if we can’t measure it, then how do you action it?\n\nAnd I think the first step, the first thing that everybody should be paying attention to is, how do we measure this? Like, what are we actually looking at? What is the scope of the effort? I don’t think anybody could tell you that, but I think there are ways to do it. And I think, as you have—we like to refer to ourselves as a system of action. You have to have a single point of truth. And when you have a single point of truth, you can then make action against it. So data is the most important thing right now. Data aggregation is the most important thing.\n\nTo your point, you did say something that’s really important that I think gets missed as well, which is, it has to be economically viable. There has to be ROI associated. And so a lot of times, what ends up happening is you get a compliance or regulatory effort that doesn’t really take into account the business criteria, and then people are resistant to it, because the business still has to run—it’s a for-profit entity. We want to take the opposite approach. We want to provide value and find ROI in the haulers’ work. Work alongside them, work alongside the transfer stations, work alongside the landfills. Understand how they’re thinking about their business, and really get down into the KPIs of their ROI, and then funnel that back up to the generators and say, here’s how they make money, here’s what’s valuable to them. How can we work together to make that make sense?\n\nI think there’s a way to do that, and it’s just about visibility. It’s transparency, it’s visibility, it’s getting people on the same page. And working together is really what we need to do.\n\nMitch Ratcliffe 19:05\n\nSo here’s a hypothetical. Let’s say you look to the one organization in the world right now that has the greatest visibility into what’s flowing into homes, and that’s Amazon, like we were just talking about. Could you partner with Amazon to say, we know you’re delivering this much cardboard, this much plastic waste, and so forth into this region, and then plan a hauling solution in response to that?\n\nMike Marmo 19:29\n\nThat’s right. That’s the end goal. That’s probably the last step, the last piece of the puzzle. But that’s exactly what you want to do. You know, waste is being created when it’s being manufactured, right? Like, ultimately, when it starts, at that point is when we know what the waste stream is going to look like. But again, if you have nowhere for it to funnel in, and you have nowhere to measure it, it’s disjointed. You have to have an integratable solution to be able to even do that. So yes, that is the goal. But ultimately, we have to start at the foundational level.\n\nMitch Ratcliffe 19:58\n\nYeah. We’re moving to a more planful economy, and there’s a lot to unpack in that idea. Let’s take a quick commercial break. We’re gonna come back to this fascinating conversation. Folks, stay tuned.\n\n[COMMERCIAL BREAK]\n\nWelcome back to Sustainability In Your Ear. Let’s return to my discussion with CurbWaste CEO Mike Marmo. He’s a fourth-generation waste industry veteran whose AI-augmented CurbPOS system automates recycling operations. So, Mike, until recently, the waste management industry has been resistant to digitization. Let’s just put it that way. And there’s a massive change ahead. What do you see in terms of a new generation of leadership and the way they think emerging as this industry grows?\n\nMike Marmo 20:43\n\nYeah, I think tech adoption in general runs through cycles, right? You have your early adopters, people that see the value. Usually, that’s someone that understands that they have to differentiate. That’s helping at the market. I was at that at one point—when you’re competing with 200 haulers in New York, you have to figure out a way, right? So tech, for me, was the way that I differentiated myself.\n\nSo you start with those, and what you’re really doing is you’re proving the ROI, you’re proving the case. You’re building case studies around, okay, this is providing value in this particular area, but you’re also identifying the meaningful pain points of what they’re experiencing. I think a lot of times, if you talk to a waste hauler, maybe generally they’ll say, like, things are working. But if you really get down into it, pull back the layers, there’s always a pain point. There’s always something they’re trying to solve for.\n\nBut when you see margin shrinking, you have to either try to drive net new revenue, or you have to be able to save in a certain area. So then what ends up happening naturally is that people start paying attention and they say, okay, this person is growing. They’re growing 30% year over year. What’s driving that growth? And eventually you get adoption. In that way, you get that mass adoption. But some people don’t want to take the risk. They want the other people to take it first and have that proof point. But then it kind of accelerates, and that’s when you start to get into that hyper-growth, hyper-adoption phase.\n\nI think we are very, very close to that. I think what’s happening is people are paying attention to what’s going on. From a tech perspective, it is moving at hyper speed at this point, and so the world is evolving at such an incredibly fast rate that anybody that doesn’t adopt will ultimately fall behind at some point. So I think the waste industry historically has been a little behind, but I don’t anticipate that being the case for the long term.\n\nMitch Ratcliffe 22:23\n\nWhen you raised your Series B, you said that you wanted patient capital that understands that this industry won’t transform overnight. And in the context of what you just said about everything changing at hyper speed, why patient? And how does that transformation happen in practice? And what do you see as the timeline?\n\nMike Marmo 22:41\n\nIt’s pretty simple. I think I alluded to this earlier. You have to build the foundation before you build the house. You can’t build the roof first, right? You have to build the foundation. And a lot of waste haulers—you have a varying degree of waste haulers around the country that are like two-to-three-truck operations all the way up to 30,000-truck fleets, right? So you have to meet them where they are. If you cannot run the business for them in a meaningful and impactful way, then you’ve already failed. There’s nothing that you can do that will really help them unless you pick a niche part of their business. And we have a lofty goal of being an operational management system. We want to be able to run the entire business on the platform.\n\nSo you have to start there. And when I say patient capital, there’s a lot of effort that goes into building those workflows, not just surface level, but adding depth, adding nuance and depth, to make sure the system is dynamic but rigid. You don’t want data to be wrong, and you don’t want it to get convoluted, but you want it to be dynamic enough to meet the need in the market. So that takes time. You have to learn. You have to listen. You have to pay attention to what’s going on. You have to be a really, really good partner to the waste hauler. They have to trust you and believe in you.\n\nSo that part of it is like the first step into the rest. But in conjunction with that, you have to be forward looking. You have to be looking at the things that they’re not paying attention to, the things that they don’t know, because they’re in the weeds dealing with the day-to-day. They’re dealing with servicing their customers, they’re dealing with the community, they’re dealing with building the business that they’re focused on. So it’s our job as a tech partner to be able to say, this is where the industry is moving, here’s what this is going to lead to, here’s the vision, and hopefully get people to sign up to that and believe in that.\n\nSo when we brought in a partner, we articulated that. I think a lot of times, when you bring on venture capital or any funding, they’re expecting this major hyper growth. But if you want to achieve what we’ve been speaking about thus far, you need to get things right, and you need to make sure that you’re building the foundation correctly.\n\nMitch Ratcliffe 24:40\n\nYou’re leaning into AI. Does that mean that you’re training models to become an expert in managing waste or hauler processes? Where’s the focus of your training?\n\nMike Marmo 24:51\n\nIt’s really in a couple different areas. I think what we really preach out there in the market is, AI for the sake of AI means nothing. Like, AI is cool. It’s great. It can provide you really meaningful value in certain areas of your life. And I think it’s going to be transformative, without a doubt. But in our industry, waste haulers don’t really care about necessarily putting something in because it’s flashy and nice and cool. They want it to provide value.\n\nAnd so when we think about AI, we think about manual tasks. We think about repeatable tasks. We think about infinite-scale areas of their business that we’re solving an immediate pain point, or that they can scale with for the remainder of time, because that thing is going to happen all the time. So an example of that would be, how are we ingesting orders from multiple channels to create efficiencies? How are we setting up call centers? How are we transcribing phone calls for customer support and customer success?\n\nAnd then I think what you’re referring to on the learning side is the gluing of traditional machine learning and algorithmic types of optimizations—for example, like route optimization—gluing it to historical behavior and being able to say, here’s the nuances, here’s when the person never puts their garbage out on time, here’s where this street is closed, but it doesn’t show you that in the map. Just certain things that dispatchers know, that tribal knowledge, that they understand their market, that an algorithm is not going to understand. And that’s where AI can layer in and learn behavior and then make better recommendations.\n\nSo it’s not an overnight thing. You have to have the data. It’s only as good as the data. So we’re really focused on the infrastructure architecture, making sure that we’re aggregating that data appropriately, and then learning on that data in order to make sure that we’re giving them the best option for success, or the best decision-making process, or the most optimal insight that we can provide.\n\nMitch Ratcliffe 26:42\n\nSo what’s an example of an AI-driven recommendation that one of your haulers has used to make a decision that they wouldn’t have otherwise?\n\nMike Marmo 26:50\n\nYeah, I think, like, operationally, or just anything that we can do that’s kind of AI-powered—\n\nMitch Ratcliffe 26:56\n\nOne that was a material difference for the hauler. What do you point to as an example when you’re talking to other haulers?\n\nMike Marmo 27:04\n\nYeah, let’s—I’ll probably say two. I think first, let’s just talk about—we’ve talked about change management. I think right now, internally, we’re really hyper-focused on making sure that we can create a really nice change management experience of adopting software. So we do a ton around AI data migrations, so that when we’re taking data out of a system, we’re able to map it in a quick and easy way that they can understand it, but also do structured cleanups of that data to make sure that they’re getting what they want into the new system. It seems like a small thing, but it’s a very challenging thing when you’re going through a long change management process. So that’s an immediate impact to the hauler, that they feel more comfortable in that change.\n\nThe second thing is, anything agentic that we build is going to provide value to the pain point that they’re trying to solve for. So whether that’s migrating data from one place into another—being able to take data out of a CRM or being able to put it into an ERP—meaningful value. You’ve just eliminated a manual task that they would have to do over and over and over again. That’s repetitive, that’s manual, and it applies. So it’s a really good method in providing ROI, because you can just say, that work is never going to be done again. That agent will work in that and do that for you with conviction.\n\nBut I think longer term, things like we talked about—service verification, material recognition, route optimization—those are efforts that we have to make meaningful investments in, that’ll be coming down the pike.\n\nMitch Ratcliffe 28:29\n\nYou know, as I listen to your description of this, and I think about the U.S. recycling system, which is, as you’ve pointed out, filled with small, private recyclers and haulers looking for ways to plug into, for instance, the growing extended producer responsibility infrastructure that’s emerging around us—I’m reminded of eBay. Is CurbWaste aiming to become a marketplace layer where those independent operators can begin to identify and plug into broader materials flows?\n\nMike Marmo 29:00\n\nIt’s on our radar. Like I said, I think a marketplace, to me, again, is really indicative of the behavior and the learning and understanding what’s going on. So right now, core focus is just visibility. I think we have to create the transparency layer first before anything else.\n\nBut yes, I would say, a marketplace, the ability to understand who’s best—like, RCI is a great example. I mean, RCI, when you’re partnering with LEED and you’re trying to find RCI facilities to establish those LEED points, that’s an area where we can help and say, this facility is in this area. Partner. We’re driving revenue for our customer base. We’re saying this RCI facility is on our platform. We can measure it. We can automate that process. We can get that LEED report to the right person in the right moment and give that level of visibility through dashboards or anything that we’re building at a customer-facing level.\n\nAgain, that’s work that doesn’t have to be done manually. That’s something that can happen in automation. That’s probably the first natural step. And we are doing some meaningful work with RCI and LEED. But long term, I think, yes, to your point, we want to get to a visibility layer, a waste meter layer, for anybody that wants it.\n\nMitch Ratcliffe 30:10\n\nThat transparency that you’re describing is going to be particularly important to producer responsibility organizations, the entities that are standing up to fulfill EPR requirements. Are you talking with them about how you can facilitate the management of their specific materials?\n\nMike Marmo 30:28\n\nYes, we are very much in discovery and in conversation with people that are obviously interested and incentivized to want to work with us and try to achieve this vision. So we do talk to people, and we do try to understand, what visibility do they want? What would they love to see? What is a utopian point of view? I mean, product is always something that we’re always forward looking on, right? What’s being built today is actionable. It’s already been validated. Now it’s about, what are we going to build in the future? We’re probably talking a few years down the road. I think we still have a lot to do on the workflow side. But yes, we are always keeping these teams informed and making sure that they’re aligned with where we’re going.\n\nMitch Ratcliffe 31:06\n\nYou’ve raised $50 million to date. Do you see a substantial amount of capital sitting out there waiting for this efflorescence of data visibility to take hold, so that they can begin to mine the material value in the economy?\n\nMike Marmo 31:21\n\nYes. I mean, our Series B was led by the venture arm of Cox Enterprises, and it was a very big part of their thesis. They saw the vision. They aligned with it. We were able to move quickly. But it really was rooted in the fact that they’ve been seeking this type of solution internally. They’ve been trying to figure out how to get more visibility into their own efforts as it relates to sustainability. So yes, I think we will continue to build. We have to fund the business in order to build the products and achieve the dream that we want to. We do believe that this can be a very big business, but ultimately, we are still aligning on that mission statement and that vision of giving the true visibility and measurement of the waste industry.\n\nMitch Ratcliffe 32:00\n\nWe’ve been looking kind of over the horizon without a clear timeframe. But let me ask you this: in 10 years, will we have an AI-enabled circular economy running, or will it still be in the process of being constructed?\n\nMike Marmo 32:12\n\nI think it will be there. Yeah, in 10 years, I think it will be there. I think, you know what I know internally of where we are—we are not that far off. We have spent the last four years on the workflows. We are starting to see the data benefit of that. I think in the next 10 years we will 100% have it.\n\nMitch Ratcliffe 32:33\n\nSo how does that change the economy of the United States?\n\nMike Marmo 32:37\n\nYou know, that’s the part that I’m not 100% sure. I’ve been operating under the mission statement of this dream and this vision. I do think that it’s going to ultimately make us rethink how we think about waste.\n\nYou know, you have electricity, right? You can measure it. You can go onto your portal and see how much you’re consuming. You can measure water. You can measure all the things that you’re using on a day-to-day basis. The waste industry is a part, a core part, of our infrastructure. It’s a core part of our society. You can even look historically and say, when waste stops getting picked up, it can crumble a society. It can crumble a city. I mean, New York City went through that in the strike, and recently in Boston they went through it.\n\nSo there’s meaningful implications to the societal impact that waste has. And sometimes I think that gets taken for granted. And I think what we really want to focus on is showing that—getting all the waste haulers in our community, which I really think we’re building, is a really great community of waste haulers that are forward thinking, that want to be a part of that mission, and try to show people how critical this industry is, and also all the things and all the information and insights that can come out of it.\n\nSo yeah, it’s very mission-driven. It’s a very personal journey. It’s a very mission-driven journey. But ultimately, I think we have to break it down into its parts, phase out what the goals are, and then get to a point where we can show people how important it actually is.\n\nMitch Ratcliffe 34:05\n\nThis is a huge vision. How can our listeners keep track of your part of the story?\n\nMike Marmo 34:10\n\nWell, I mean, obviously we post whatever we have to post on our website, so that’s a good place—at curbwaste.com—but also, anybody can reach out to us. I mean, we are very much trying to be an advocate of the industry, and we’re very much trying to be people that can be thought leaders and really speak about what we’re trying to achieve here. We’re very transparent, we’re very honest, we’re very true to who we are. So we love interacting with people in the space. We have people come to our office often. We have people talk to our team often. So for me, it’s reach out. Reach out on LinkedIn, reach out on the website. You can reach out by any means necessary.\n\nMitch Ratcliffe 34:48\n\nMike, thanks very much. It’s been a really interesting conversation.\n\nMike Marmo 34:52\n\nThank you. I really appreciate you having me.\n\n[COMMERCIAL BREAK]\n\nMitch Ratcliffe 35:08\n\nWelcome back to Sustainability In Your Ear. You’ve been listening to my conversation with Mike Marmo. He’s CEO and founder of CurbWaste, and a fourth-generation waste industry professional who’s building the CurbPOS system, an end-to-end operating system for independent waste haulers. You can learn more about the company and its work at curbwaste.com—CurbWaste is all one word, no space, no dash.\n\nMike said something during the conversation that I encourage you to sit with: waste is being created when it is being manufactured. Now, that’s a deceptively simple observation, and it reframes everything with regard to how we think about the leftovers of the take-make-waste economy. The moment a product rolls off the line, its waste stream is determined—its packaging, what you need to do with it, the end-of-use disposition of the product itself, and the materials that will need to be collected, sorted, and either returned to the supply chain or, unfortunately, sometimes buried in a hole. If you can accept that premise, then the waste management industry isn’t simply a downstream result of the current economy. It’s a mirror that we need to look into to see the potential value to be recovered next week, next month, next year, or decades from now, when materials can no longer serve their current purpose.\n\nMike also pointed to what happens when waste stops moving. In 1968, New York’s sanitation workers walked off the job for nine days—just nine days—and 100,000 tons of garbage piled up chest-high on sidewalks. Rats swarmed into the city’s best neighborhoods, and New York declared its first public health emergency since the 1931 polio epidemic. And just last summer, when Teamsters struck against Republic Services in the greater Boston area, trash went uncollected for more than two months across 14 communities. Dumpsters overflowed behind restaurants. The rodent population exploded, and schools faced the start of their school year buried by rotting waste. As Mike put it, when waste stops getting picked up, a society can crumble.\n\nAnd that fragility reveals something profound about society’s relationship with the materials from which it is constructed. We’ve built a civilization on the assumption that waste must disappear—that it’s someone else’s problem, and that it is best put out of sight and kept out of mind. We’ve treated waste as dirty, shameful, and beneath notice. That cultural contempt has real economic consequences, because it means we’ve systematically underinvested in the infrastructure that manages the material afterlife of everything that we produce and consume.\n\nNow just imagine what happens when waste is no longer something to dispose of, but something that it’s important to recover. When the 290 million tons of municipal solid waste moving through U.S. systems each year is finally understood not as a cost center, but as part of the supply chain—a feedstock stream worth tracking, optimizing, and monetizing with the same sophistication we bring to any other logistics challenge. That’s when the world CurbWaste wants to enable and its staggering economics will come into being.\n\nAccenture research projected that the circular economy could generate $4.5 trillion in additional economic output by 2030 and as much as $25 trillion by 2050. The United Nations Development Program has endorsed that same $4.5 trillion figure, noting that the transition would simultaneously cut emissions, create stable jobs, and open new green markets all over the world. Market analysts are converging on figures that describe an enormous circular economy. King’s Research projects it will reach nearly $2.9 trillion by 2031, while a more conservative estimate from Next Move Strategy Consulting pinpoints $1.3 trillion in projected value by 2030—so that even the lowest projections represent a doubling or tripling of the current waste market’s value in just five years.\n\nThe point is that we’re dramatically underinvesting relative to the opportunity. CurbWaste’s CurbPOS is just getting started on the path to connecting waste generators to local haulers, closing the loop that Mike described, from the point a product is manufactured to the end of its life and, ideally, back into the supply chain.\n\nMike’s Amazon analogy is the right way to frame this. Amazon took the time to understand buyer behavior first, when they were just selling books, and then they connected warehousing, freight forwarding, and last-mile logistics based on the knowledge of the consumer’s needs. The waste industry can follow the same logic: identify what’s being generated, where it flows, and where it ends up, ready for collection. Then the challenge is plugging the myriad gaps in our collection infrastructure by connecting independent operators—new startups—to materials that they can monetize, using a shared digital infrastructure. Right there you can see the necessary transparency layer, the marketplace layer, that turns a fragmented collection system into the connective tissue for a circular supply chain.\n\nAnd that’s the signal that can transform waste into value, and that will drive new revenue for state and local collection and processing companies under extended producer responsibility programs, and ultimately lead to planned regional materials flows that citizens don’t pay for, that companies exploit because it’s profitable.\n\nSo when waste stops being considered the dirty result of our consumption and starts being recognized as valuable—when society looks at what it throws away with the same interest it brings to what it buys—we will have a fundamentally different relationship with the material world. One that recognizes that the people who move and manage our waste are operating a utility as essential as electricity or water. And that’s the story that will help unfold and explore here on Sustainability In Your Ear.\n\nSo stay tuned. And folks, would you take a moment to check out our archive of more than 540 episodes of Sustainability In Your Ear? We’re in our sixth season, and I guarantee you there’s an interview that you’ll want to share with one of your friends. Writing a review on your favorite podcast platform will help your neighbors find us. Folks, you’re the amplifiers that can spread more ideas to create less waste. So please tell your friends, your family, and co-workers. They can find Sustainability In Your Ear on Apple Podcasts, Spotify, iHeartRadio, Audible, or whatever purveyor of podcast goodness they prefer.\n\nThank you for your support. I’m Mitch Ratcliffe. This is Sustainability In Your Ear, and we will be back with another innovator interview soon. In the meantime, folks, take care of yourself, take care of one another, and let’s all take care of this beautiful planet of ours. Have a green day.",
      "url": "https://earth911.com/podcast/sustainability-in-your-ear-curbwastes-mike-marmo-is-building-the-waste-logistics-layer-of-the-circular-economy/",
      "source": "Earth911",
      "published": "2026-02-16",
      "sentiment_score": 0.85,
      "reasoning": "The article describes a tangible, impactful innovation in the U.S. waste management industry through CurbWaste's digital platform that modernizes waste logistics, enabling better tracking, transparency, and efficiency. This innovation supports the circular economy by turning waste into a valuable, trackable resource, with broad societal and environmental benefits. It includes detailed context on the problem, solution, scale, and future potential, fulfilling criteria for inspiring good news in environmental sustainability.",
      "category": "Environment",
      "personality_title": "CurbWaste modernizes U.S. waste hauling with digital tools to boost circular economy",
      "personality_presentation": "**Context** – The U.S. waste management industry handles over 290 million tons of trash yearly, but much of its work still uses old-fashioned paper methods. Around 10,000 independent haulers operate costly trucks where profits depend on efficient routes. Unlike other logistics industries, many haulers lack digital tools to track and manage waste effectively.\n\n**What happened** – Mike Marmo, a fourth-generation waste professional, founded CurbWaste to build a digital operating system for these haulers. Since selling his hauling business in 2021, he has grown CurbWaste to serve over 150 haulers in 40 states. Their CurbPOS system tracks materials entering and leaving transfer stations with scale integration, automates environmental reports, and provides detailed data needed by new recycling laws requiring producers to fund and document packaging recycling.\n\n**Impact** – By digitizing waste collection and materials tracking, CurbWaste helps transform waste from a hidden cost into a visible, valuable part of the supply chain. This data transparency supports a circular economy where materials are reused instead of landfilled. The system improves route efficiency, regulatory compliance, and creates new revenue streams for haulers. Industry research estimates the circular economy could add trillions to the economy by 2030, showing the scale of this opportunity.\n\n**What's next step** – CurbWaste is developing AI-powered tools to provide haulers with smarter decision-making and plans to connect waste producers, haulers, and processors on a shared platform. The goal is a “waste meter” that tracks materials from manufacture to reuse. Mike Marmo expects an AI-enabled circular economy to be operational within 10 years, turning fragmented waste management into a coordinated, digital supply chain.\n\n**One-sentence takeaway** – CurbWaste’s digital platform is modernizing independent waste hauling in the U.S., creating the data foundation needed to build an efficient, transparent circular economy that turns waste into a valuable resource.",
      "personality_title_fr": "CurbWaste modernise la gestion des déchets aux États-Unis grâce aux outils numériques pour renforcer l’économie circulaire",
      "personality_presentation_fr": "**Contexte** – L’industrie américaine de la gestion des déchets traite plus de 290 millions de tonnes de déchets chaque année, mais utilise encore beaucoup de méthodes papier. Environ 10 000 transporteurs indépendants exploitent des camions coûteux dont la rentabilité dépend de l’efficacité des itinéraires. Contrairement à d’autres secteurs logistiques, beaucoup n’ont pas accès aux outils numériques pour gérer efficacement les déchets.\n\n**Ce qui s’est passé** – Mike Marmo, professionnel de la gestion des déchets depuis quatre générations, a fondé CurbWaste pour créer un système d’exploitation numérique destiné à ces transporteurs. Depuis la vente de son entreprise de collecte en 2021, il a développé CurbWaste pour servir plus de 150 transporteurs dans 40 États. Leur système CurbPOS suit les matériaux entrant et sortant des stations de transfert avec intégration de la pesée, automatise les rapports environnementaux et fournit les données détaillées nécessaires aux nouvelles lois sur le recyclage.\n\n**Impact** – En numérisant la collecte des déchets et le suivi des matériaux, CurbWaste aide à transformer les déchets d’un coût caché en une partie visible et précieuse de la chaîne d’approvisionnement. Cette transparence des données soutient une économie circulaire où les matériaux sont réutilisés au lieu d’être enfouis. Le système améliore l’efficacité des itinéraires, la conformité réglementaire et crée de nouvelles sources de revenus pour les transporteurs. Les recherches estiment que l’économie circulaire pourrait ajouter des milliers de milliards à l’économie d’ici 2030.\n\n**Prochaine étape** – CurbWaste développe des outils basés sur l’IA pour offrir aux transporteurs une prise de décision plus intelligente et prévoit de connecter producteurs, transporteurs et centres de traitement sur une plateforme partagée. L’objectif est un « compteur de déchets » qui suit les matériaux de la fabrication à la réutilisation. Mike Marmo prévoit qu’une économie circulaire pilotée par l’IA sera opérationnelle d’ici 10 ans, transformant une gestion fragmentée des déchets en une chaîne d’approvisionnement numérique et coordonnée.\n\n**Résumé en une phrase** – La plateforme numérique de CurbWaste modernise la collecte indépendante des déchets aux États-Unis en créant la base de données nécessaire pour bâtir une économie circulaire efficace et transparente qui valorise les déchets.",
      "personality_title_es": "CurbWaste moderniza la gestión de residuos en EE.UU. con herramientas digitales para impulsar la economía circular",
      "personality_presentation_es": "**Contexto** – La industria estadounidense de gestión de residuos maneja más de 290 millones de toneladas de basura al año, pero todavía usa muchos métodos en papel. Cerca de 10,000 transportistas independientes operan camiones caros donde las ganancias dependen de rutas eficientes. A diferencia de otros sectores logísticos, muchos transportistas no tienen acceso a herramientas digitales para gestionar los residuos de forma efectiva.\n\n**Qué pasó** – Mike Marmo, profesional de residuos de cuarta generación, fundó CurbWaste para crear un sistema operativo digital para estos transportistas. Desde que vendió su empresa de recolección en 2021, ha desarrollado CurbWaste para atender a más de 150 transportistas en 40 estados. Su sistema CurbPOS rastrea materiales que entran y salen de las estaciones de transferencia con integración de básculas, automatiza informes ambientales y proporciona datos detallados necesarios para nuevas leyes de reciclaje.\n\n**Impacto** – Al digitalizar la recolección de residuos y el seguimiento de materiales, CurbWaste ayuda a transformar los residuos de un costo oculto a una parte visible y valiosa de la cadena de suministro. Esta transparencia de datos apoya una economía circular donde los materiales se reutilizan en lugar de enterrarse. El sistema mejora la eficiencia de rutas, el cumplimiento normativo y crea nuevas fuentes de ingresos para los transportistas. Investigaciones estiman que la economía circular podría agregar billones a la economía para 2030.\n\n**Próximo paso** – CurbWaste está desarrollando herramientas impulsadas por IA para ofrecer a los transportistas decisiones más inteligentes y planea conectar a productores, transportistas y procesadores en una plataforma compartida. El objetivo es un “medidor de residuos” que rastree materiales desde la fabricación hasta la reutilización. Mike Marmo espera que en 10 años una economía circular habilitada por IA esté funcionando, convirtiendo la gestión fragmentada de residuos en una cadena de suministro digital coordinada.\n\n**Frase clave** – La plataforma digital de CurbWaste está modernizando la recolección independiente de residuos en EE.UU., creando la base de datos necesaria para construir una economía circular eficiente y transparente que convierte los residuos en un recurso valioso.",
      "image_url": "public/images/news_image_Sustainability-In-Your-Ear-CurbWastes-Mike-Marmo-I.png",
      "image_prompt": "A warm, detailed painting of a network of stylized waste collection trucks and transfer stations interconnected by glowing data streams forming a circular loop, symbolizing the flow of materials in a digitalized circular economy; the scene includes abstract representations of packing materials transforming into new products along the loop, all rendered in soft, natural earth tones and muted blues, without human figures."
    },
    {
      "title": "How plant “touch” boosts resilience: new research reveals surprising stress response",
      "summary": "BY THE OPTIMIST DAILY EDITORIAL TEAM In the natural world, plants are often thought of somewhat as competitors, out there jostling for sunlight, nutrients, and space. But new research suggests they may also be surprisingly cooperative, especially when environmental stress hits. A recent study, published as a preprint on bioRxiv, found that when plants physically […]\nThe post How plant “touch” boosts resilience: new research reveals surprising stress response first appeared on The Optimist Daily: Making Solutions the News.",
      "content": "BY THE OPTIMIST DAILY EDITORIAL TEAM\n\nIn the natural world, plants are often thought of somewhat as competitors, out there jostling for sunlight, nutrients, and space. But new research suggests they may also be surprisingly cooperative, especially when environmental stress hits.\n\nA recent study, published as a preprint on bioRxiv, found that when plants physically touch one another, they activate a kind of early warning system, sharing signals that make them more resilient to stress. The team behind the discovery, led by plant scientist Ron Mittler at the University of Missouri, demonstrated that this physical contact helps plants better tolerate intense light, an increasingly common stressor in a warming climate.\n\n“We demonstrated that if plants touch each other, they are more resilient to light stress,” said Mittler in an interview with New Atlas. “If you stimulate or stress one plant, it will send a signal to all the other plants that it touches, and they all become more tolerant.”\n\nBuilding a plant-to-plant warning system\n\nThe researchers used Arabidopsis thaliana, a small flowering plant commonly used in genetic studies, to test their hypothesis. They created two groups: one in which the plants’ leaves physically touched, and another where each plant grew in isolation.\n\nBoth groups were then exposed to high-intensity light, simulating the kind of stress that might occur during a heatwave or under direct sunlight. The researchers measured ion leakage from the leaves, a biological marker of damage, as well as the accumulation of anthocyanins, plant pigments that increase under stress.\n\nThe findings were clear: plants in physical contact showed significantly less damage and fewer stress markers than those grown alone. In other words, the touch group was more resilient.\n\nTo dig deeper, the researchers turned to genetically modified plants that couldn’t transmit typical chemical signals. They created a three-plant chain: a transmitter, a middle “mediator,” and a receiver. Then, they swapped in signal-deficient mutant plants in the middle. This resulted in the receiver plant losing its resilience, confirming that communication was broken.\n\nFurther analysis revealed that hydrogen peroxide, a common chemical messenger in plants, plays a central role in this signaling process.\n\nCooperation, not just competition\n\nWhile it’s long been known that plants communicate underground through root systems and mycorrhizal fungi, above-ground communication, especially through touch, is less understood. Mittler’s findings suggest a kind of plant cooperation that’s been overlooked.\n\n“Typically, we view plants as competitors,” said Mittler. “But if you grow under harsh conditions, you better grow in a group. If you grow under really ideal conditions—with no predators, with no stressors—then you better grow individually.”\n\nThis speaks to a broader evolutionary trade-off: plants in challenging environments may gain a survival advantage by forming dense clusters and physically connecting.\n\nPiyush Jain, a plant biologist at Cornell University and co-author of the paper, praised the approach. “The authors of this paper propose a thoughtful and clever experimental design to better understand the still underexplored pathways of aboveground plant-to-plant communication,” he said. Jain noted the importance of the study in addressing “a longstanding question: whether chemical signaling and electrical signaling are responsible for increased resilience to excessive light stress.”\n\nWhy this matters\n\nThis study opens new avenues for understanding how plants adapt to climate stress, especially as environmental conditions grow increasingly extreme. With prolonged heatwaves and intense sunlight becoming more common, insights like these could inform agricultural practices, crop density strategies, and even how we design urban green spaces.\n\nThough the study has yet to be peer-reviewed, it adds to a growing body of research challenging the perception of plants as passive organisms. Instead, they may be more interactive and socially responsive than we realize, capable of forming their own networks through simple physical contact.\n\nSource study: bioRxiv—United we stand: Plants that physically touch each other are more resilient to excess light stress\n\nDid this solution stand out? Share it with a friend or support our mission by becoming an Emissary.",
      "url": "https://www.optimistdaily.com/2026/02/how-plant-touch-boosts-resilience-new-research-reveals-surprising-stress-response/",
      "source": "The Optimist Daily: Making Solutions the News",
      "published": "2026-02-16",
      "sentiment_score": 0.85,
      "reasoning": "The article reports on a significant scientific discovery showing that plants physically touching each other can share stress signals to boost resilience against environmental stressors like intense light. This finding has broad implications for understanding plant cooperation and could inform agricultural and environmental practices to better adapt to climate change, benefiting ecosystems and food security on a large scale.",
      "category": "Environment",
      "personality_title": "Plants boost each other's strength by touching under stress",
      "personality_presentation": "**Context** – Plants are usually seen as rivals competing for sunlight and space. However, scientists have found they can also help each other survive tough conditions by sharing signals when they physically touch.\n\n**What happened** – Researchers at the University of Missouri studied a small plant called Arabidopsis thaliana. They grew some plants touching each other and others alone, then exposed them to very bright light to simulate stress. The plants touching each other showed less damage and were stronger. The team discovered that when one plant is stressed, it sends a chemical signal to its neighbors through touch, making them more resilient.\n\n**Impact** – This shows plants can cooperate above ground by physically connecting, not just compete. It changes how we understand plant behavior, especially in harsh environments where growing close together helps them survive better. The study could help farmers and city planners decide how to arrange plants to protect them from climate stress.\n\n**What's next step** – Scientists will continue studying how these signals work and if the same happens with other plants. This knowledge might lead to new ways of growing crops that are stronger against heat and sunlight, helping food production as the climate changes.\n\n**One-sentence takeaway** – Plants that touch each other share signals that help them survive intense light stress better than plants growing alone.",
      "personality_title_fr": "Les plantes renforcent leur résistance en se touchant sous stress",
      "personality_presentation_fr": "**Contexte** – On pense souvent que les plantes sont des rivales qui se battent pour la lumière et l’espace. Mais des scientifiques ont découvert qu’elles peuvent aussi s’entraider en partageant des signaux quand elles se touchent physiquement.\n\n**Ce qui s’est passé** – Des chercheurs de l’Université du Missouri ont étudié une petite plante appelée Arabidopsis thaliana. Ils ont fait pousser des plantes en contact les unes avec les autres et d’autres isolées, puis les ont exposées à une lumière très forte pour simuler un stress. Les plantes en contact ont montré moins de dégâts et étaient plus fortes. L’équipe a découvert qu’une plante stressée envoie un signal chimique à ses voisines par le toucher, ce qui les rend plus résistantes.\n\n**Impact** – Cela montre que les plantes peuvent coopérer au-dessus du sol en se reliant physiquement, et pas seulement se concurrencer. Cela change notre compréhension du comportement des plantes, surtout dans des environnements difficiles où pousser ensemble aide à mieux survivre. Cette étude pourrait aider les agriculteurs et les urbanistes à mieux organiser les plantes pour les protéger du stress climatique.\n\n**Prochaine étape** – Les scientifiques vont continuer à étudier comment ces signaux fonctionnent et si c’est pareil pour d’autres plantes. Ces connaissances pourraient permettre de cultiver des plantes plus résistantes à la chaleur et à la lumière, aidant ainsi la production alimentaire face au changement climatique.\n\n**Conclusion en une phrase** – Les plantes qui se touchent partagent des signaux qui les aident à mieux résister au stress causé par une lumière intense que les plantes isolées.",
      "personality_title_es": "Las plantas fortalecen su resistencia al tocarse bajo estrés",
      "personality_presentation_es": "**Contexto** – Las plantas suelen verse como competidoras que luchan por la luz y el espacio. Sin embargo, científicos han descubierto que también pueden ayudarse compartiendo señales cuando se tocan físicamente.\n\n**Qué pasó** – Investigadores de la Universidad de Missouri estudiaron una planta pequeña llamada Arabidopsis thaliana. Hicieron crecer algunas plantas tocándose y otras solas, luego las expusieron a luz muy intensa para simular estrés. Las plantas que se tocaban mostraron menos daño y estaban más fuertes. El equipo descubrió que cuando una planta está estresada, envía una señal química a sus vecinas a través del contacto, haciéndolas más resistentes.\n\n**Impacto** – Esto muestra que las plantas pueden cooperar sobre el suelo al conectarse físicamente, no solo competir. Cambia nuestra forma de entender el comportamiento de las plantas, especialmente en ambientes difíciles donde crecer juntas les ayuda a sobrevivir mejor. El estudio puede ayudar a agricultores y planificadores urbanos a organizar las plantas para protegerlas del estrés climático.\n\n**Próximo paso** – Los científicos seguirán estudiando cómo funcionan estas señales y si ocurre lo mismo en otras plantas. Este conocimiento podría llevar a nuevas formas de cultivar plantas más fuertes contra el calor y la luz, ayudando a la producción de alimentos ante el cambio climático.\n\n**Conclusión en una frase** – Las plantas que se tocan comparten señales que las ayudan a resistir mejor el estrés por luz intensa que las plantas que crecen solas.",
      "image_url": "public/images/news_image_How-plant-touch-boosts-resilience-new-research-rev.png",
      "image_prompt": "A detailed, warm painting of intertwined Arabidopsis thaliana leaves gently touching and glowing softly at their contact points, with subtle streams of light and delicate pulses symbolizing chemical signals flowing between them, set against a simple natural background in soft greens and earth tones."
    },
    {
      "title": "Guest Idea: Late Winter Pruning Optimizes Tree Health for Backyard Carbon Sequestration",
      "summary": "Green spaces are dormant during late winter, making it the perfect time to prune your...\nThe post Guest Idea: Late Winter Pruning Optimizes Tree Health for Backyard Carbon Sequestration appeared first on Earth911.",
      "content": "Green spaces are dormant during late winter, making it the perfect time to prune your backyard trees. With no leaves, their entire branch structure is visible, so it’s easy to spot problems.\n\nKnowing the whys and hows behind tree pruning and carbon sequestration is key to developing a long-term, healthier, greener yard. Carbon sequestration is a key function of trees, making them an essential component of reducing carbon levels in the atmosphere.\n\nTrees “inhale” carbon dioxide from the air, use the carbon to build up their wood, branches, and roots, and then “exhale” the oxygen. The amount of carbon they sequester per year increases based on their health and size. While leaves store carbon temporarily, the real long-term sequestration happens when carbon is locked away in the woody biomass of the trunk, branches, and root system.\n\nPruning maximizes a tree’s ability to capture and store carbon. Removing non-productive parts that drain a tree’s finite energy, such as dead, rotted, or weak limbs, allows the tree to redirect energy into developing a stronger trunk and a denser, more efficient canopy of leaves. A properly pruned tree becomes a more effective carbon sink, capturing more carbon dioxide annually and storing it for the duration of its life.\n\nEssential Tools and Safety Practices\n\nKeep these considerations in mind for safe and efficient pruning.\n\nMust-Have Pruning Tools\n\nYou’ll need the right tools to do the job effectively. Ensure you have the following on hand before you start pruning:\n\nBypass pruners\n\nLoppers\n\nPruning saw\n\nPole pruner\n\nBefore beginning to cut limbs and between trees, wipe blades with a cloth soaked in rubbing alcohol, especially when you’re cutting off diseased wood, to prevent spreading pathogens.\n\nPruning Safety Protocols\n\nAlways wear safety glasses and gloves when pruning. Prune your trees on a clear, dry day to ensure you have a secure footing and a clear view of what you’re working on. Consider trimming branches that are close to or touching your house to limit the bridges wildlife can use to reach your home. Be hyper-aware of the “fall zone” of any branch you cut.\n\nPruning for Fire Safety\n\nFactor in fire clearance codes when you prune your trees, especially if you live in a fire-prone area. If you have trees that are 18 feet or taller, keep their branches trimmed six feet from the ground. If your trees are shorter than that, keep their lower third clear.\n\nWhen to Call a Certified Arborist\n\nConsider leaving pruning to professionals when you’re dealing with:\n\nBranches that you can’t reach from the ground with a pole pruner or ladder.\n\nAny limb thicker than five inches.\n\nTrees showing signs of significant decay or instability.\n\nPruning Techniques by Tree Type\n\nThe goal of pruning shifts depending on whether you’re managing a large shade tree, a productive fruit tree, or an evergreen conifer.\n\nDeciduous Shade Trees\n\nWhen pruning oaks, maples, elms, and other shade trees, aim to encourage a strong “scaffold” structure. This is the tree’s permanent skeleton: the trunk and main branches. If it’s sturdy, it can support a massive, healthy canopy for decades. Consider these key techniques:\n\nPerform “crown thinning” on mature trees: Selectively remove smaller branches from the dense outer canopy. The goal is to increase sunlight penetration, which helps reduce the risk of disease and makes the tree more resilient to high winds.\n\nConduct “crown raising” for clearance: Remove the lowest branches to create space over sidewalks, driveways, or lawns. Do this gradually over several years, as removing many large lower limbs at once can weaken the tree.\n\nFruit Trees\n\nFor fruit trees, the goal is to balance the tree’s energy between vegetative and reproductive growth. Aim to create a structure that produces high-quality, easy-to-reach fruit:\n\nRemove unproductive growth: Trim off water sprouts, which are whip-like vertical shoots that rarely produce fruit. The shoots that grow at the base of the tree also need to go, as they’re not part of the productive tree.\n\nEncourage sunlight on fruiting wood: Fruit grows on spurs. Thinning out the canopy to ensure sunlight reaches this fruiting wood is essential for flower bud development.\n\nConifers\n\nWhen pruning pines, spruces, firs, and other conifers, the goal is to maintain their natural form and remove problem branches. Over-pruning is one of the most common and damaging mistakes made with these trees:\n\nNever cut the leader, the central, topmost vertical stem dictates the conifer’s height and classic cone shape. Cutting it off can permanently stunt the tree and encourage weak, unattractive replacement shoots.\n\nFocus on the three Ds: Trim off dead, damaged, or diseased branches. You can also remove one or two competing leaders if a “double top” forms.\n\nCommon Tree Species: Specific Guidelines\n\nHere are more species-specific tips for effective tree pruning:\n\nMajor shade trees: Focus on central pruning to establish a strong central leader and scaffold branches.\n\nOrnamental trees: Lightly prune them to maintain their natural shape and aesthetic.\n\nFruit and nut trees: Remove upright, vigorous shoots to encourage growth on horizontal, fruit-bearing limbs.\n\nProblem trees: Regularly prune trees with weak wood or poor structure to keep them from splitting.\n\nPost-Pruning Care to Boost Tree Vigor\n\nPruning in late winter helps trees because they tend to form calluses quickly, and the spring growth flush can enhance the effect. Clean cuts heal better than ragged edges, so trim damaged branches after storms. Prune back to a clean, healthy branch collar to help the tree compartmentalize and recover. Remove parts with open wounds to prevent disease and decay.\n\nInstead of sending pruned branches to the landfill, give them a new purpose. Use a wood chipper to turn branches into valuable, moisture-retaining mulch. You can also add smaller twigs to a compost pile or use straight, sturdy branches as stakes for climbing plants.\n\nDeveloping a Multi-Year Tree Care Plan\n\nEnsure strategic pruning using a seasonal calendar, like this example:\n\nWinter: Perform major structural pruning.\n\nPerform major structural pruning. Spring: Monitor new growth and inspect for signs of pests or disease.\n\nMonitor new growth and inspect for signs of pests or disease. Summer: Lightly prune any suckers or misplaced sprouts.\n\nLightly prune any suckers or misplaced sprouts. Fall: Rake fallen leaves and apply a fresh layer of mulch around the base of your trees.\n\nCustomize your calendar based on the types of trees in your yard. If you have multiple trees, create a rotating pruning schedule. For example, you can give your two largest oaks a detailed pruning this winter, and tackle the maples next year. This ensures every tree receives attention within a 2-3-year cycle.\n\nPruning is more than a chore, it’s an act of stewardship. Trees are powerful allies in building a healthier community and planet, and you can keep the ones in your backyard healthy, one thoughtful cut at a time.\n\nAbout the Author\n\nRose Morrison is the managing editor of Renovated Magazine. She has over six years of experience writing about sustainability, circular economy, and better building. When not contributing to various reputable publications and advocating for environmental awareness, Rose loves being outdoors and spending time with her pets.",
      "url": "https://earth911.com/home-garden/guest-idea-late-winter-pruning-optimizes-tree-health-for-backyard-carbon-sequestration/",
      "source": "Earth911",
      "published": "2026-02-16",
      "sentiment_score": 0.8,
      "reasoning": "The article provides detailed, actionable guidance on late winter pruning to optimize tree health and enhance carbon sequestration, a key environmental benefit. It emphasizes the broad positive impact of healthy trees on carbon reduction and ecosystem health, offering practical advice for the general public to contribute to climate action through backyard stewardship. The content is focused, informative, and promotes a meaningful environmental practice with tangible benefits.",
      "category": "Environment",
      "personality_title": "Late winter pruning helps backyard trees capture more carbon",
      "personality_presentation": "**Context** – Trees in backyards and green spaces are dormant in late winter, making it the best time to prune them. Pruning means cutting off certain branches to help trees grow stronger and healthier.\n\n**What happened** – Experts say pruning trees in late winter improves their health and helps them store more carbon. Trees absorb carbon dioxide from the air and lock it in their wood, branches, and roots. Removing dead or weak branches lets trees focus energy on growing strong trunks and dense leaves, which capture more carbon each year.\n\n**Impact** – Healthy, well-pruned trees can store carbon longer and more effectively. This is important because trees help reduce the amount of carbon dioxide, a greenhouse gas, in the atmosphere. The article also explains how to prune safely using the right tools and when to ask professionals for help.\n\n**What's next step** – Homeowners are encouraged to create a regular pruning plan, pruning major branches in winter and doing lighter pruning in other seasons. Using pruned branches as mulch or compost can further support the garden. Following these steps helps keep trees healthy and better at reducing carbon over many years.\n\n**One-sentence takeaway** – Pruning backyard trees in late winter strengthens them and boosts their ability to capture and store carbon, helping the environment.\n\n",
      "personality_title_fr": "La taille tardive en hiver aide les arbres de jardin à capturer plus de carbone",
      "personality_presentation_fr": "**Contexte** – Les arbres dans les jardins et espaces verts sont en dormance à la fin de l’hiver, ce qui en fait le meilleur moment pour les tailler. Tailler signifie couper certaines branches pour aider les arbres à devenir plus forts et en meilleure santé.\n\n**Ce qui s’est passé** – Des experts expliquent que tailler les arbres en fin d’hiver améliore leur santé et leur capacité à stocker plus de carbone. Les arbres absorbent le dioxyde de carbone de l’air et le stockent dans leur bois, branches et racines. En enlevant les branches mortes ou faibles, les arbres peuvent concentrer leur énergie sur la croissance d’un tronc solide et d’un feuillage dense, qui capturent plus de carbone chaque année.\n\n**Impact** – Des arbres sains et bien taillés peuvent stocker le carbone plus longtemps et plus efficacement. C’est important car les arbres aident à réduire la quantité de dioxyde de carbone, un gaz à effet de serre, dans l’atmosphère. L’article explique aussi comment tailler en toute sécurité avec les bons outils et quand faire appel à des professionnels.\n\n**Prochaine étape** – Les propriétaires sont encouragés à créer un plan de taille régulier, avec une taille majeure en hiver et des tailles légères aux autres saisons. Utiliser les branches taillées comme paillis ou compost peut aussi aider le jardin. Ces actions maintiennent les arbres en bonne santé et améliorent leur rôle dans la réduction du carbone sur plusieurs années.\n\n**Résumé en une phrase** – Tailler les arbres de jardin en fin d’hiver les renforce et augmente leur capacité à capter et stocker le carbone, au bénéfice de l’environnement.\n\n",
      "personality_title_es": "La poda a finales del invierno ayuda a los árboles del jardín a capturar más carbono",
      "personality_presentation_es": "**Contexto** – Los árboles en los jardines y espacios verdes están en reposo a finales del invierno, por lo que es el mejor momento para podarlos. Podar significa cortar ciertas ramas para ayudar a que los árboles crezcan más fuertes y sanos.\n\n**Qué pasó** – Expertos explican que podar los árboles a finales del invierno mejora su salud y aumenta su capacidad para almacenar carbono. Los árboles absorben dióxido de carbono del aire y lo guardan en su madera, ramas y raíces. Al eliminar ramas muertas o débiles, los árboles pueden usar su energía para fortalecer el tronco y tener un follaje más denso, que captura más carbono cada año.\n\n**Impacto** – Los árboles sanos y bien podados pueden almacenar carbono por más tiempo y de forma más efectiva. Esto es importante porque los árboles ayudan a reducir el dióxido de carbono, un gas que contribuye al calentamiento global, en la atmósfera. El artículo también explica cómo podar de forma segura con las herramientas adecuadas y cuándo llamar a profesionales.\n\n**Próximo paso** – Se recomienda a los dueños de casa crear un plan regular de poda, realizando podas grandes en invierno y podas ligeras en otras estaciones. Usar las ramas podadas como mantillo o compost también ayuda al jardín. Estas acciones mantienen los árboles saludables y mejoran su papel en la reducción de carbono durante muchos años.\n\n**Resumen en una frase** – Podar los árboles del jardín a finales del invierno los fortalece y aumenta su capacidad para capturar y almacenar carbono, beneficiando al medio ambiente.\n\n",
      "image_url": "public/images/news_image_Guest-Idea-Late-Winter-Pruning-Optimizes-Tree-Heal.png",
      "image_prompt": "A detailed, warm painting of a serene backyard scene in late winter showing a leafless tree with carefully pruned strong branches forming a sturdy scaffold structure, surrounded by neatly arranged pruning tools like bypass pruners and loppers resting on the ground; nearby, a small pile of wood chips and mulch symbolizes sustainable reuse, all rendered in soft, natural earth tones and gentle light that evokes care and renewal."
    },
    {
      "title": "Unlocking the secrets of glaciers: Scientists, mountaineers on a climate rescue mission",
      "summary": "Glaciers are vital to Earth's water supplies, yet they are being pushed to the brink of collapse. Half of the world's glaciers could disappear by the end of the century. A French mountain climber is putting her experience to use by helping scientists collect ice samples from major glaciers around the world. Living and dormant species found within them could provide vital clues in the fight against global warming. FRANCE 24's Juliette Alfano, Valérie Dekimpe and Alexandra Renard report.",
      "content": "Unlocking the secrets of glaciers: Scientists, mountaineers on a climate rescue mission\n\nEurope\n\nTo display this content from YouTube, you must enable advertisement tracking and audience measurement. Accept Manage my choices One of your browser extensions seems to be blocking the video player from loading. To watch this content, you may need to disable it on this site. Try again FOCUS © FRANCE 24 09:34\n\n09:34 min Share\n\nFrom the show\n\nReading time 1 min\n\nGlaciers are vital to Earth's water supplies, yet they are being pushed to the brink of collapse. Half of the world's glaciers could disappear by the end of the century. A French mountain climber is putting her experience to use by helping scientists collect ice samples from major glaciers around the world. Living and dormant species found within them could provide vital clues in the fight against global warming. FRANCE 24's Juliette Alfano, Valérie Dekimpe and Alexandra Renard report.",
      "url": "https://www.france24.com/en/tv-shows/focus/20260216-unlocking-the-secrets-of-glaciers-scientists-mountaineers-on-a-climate-rescue-mission",
      "source": "Environment news - France 24",
      "published": "2026-02-16",
      "sentiment_score": 0.8,
      "reasoning": "The article highlights a meaningful scientific effort to study glaciers, which are crucial for Earth's water supply and climate regulation. The involvement of mountaineers aiding scientists to collect ice samples globally represents a tangible action with broad environmental significance. Discovering living and dormant species in glaciers could provide important insights to combat global warming, indicating a hopeful and impactful contribution to climate action.",
      "category": "Environment",
      "personality_title": "Mountaineers and scientists team up to study glaciers and fight climate change",
      "personality_presentation": "**Context** – Glaciers are large, slow-moving rivers of ice found in cold places around the world. They store a lot of fresh water and help control the Earth's climate. But because the planet is warming, many glaciers are melting fast and could disappear by the end of this century.\n\n**What happened** – A French mountain climber is using her skills to help scientists reach remote glaciers around the world. Together, they are collecting ice samples from these glaciers. Inside the ice, they are finding tiny living and dormant creatures that might hold important clues about how glaciers work and how they respond to climate change.\n\n**Impact** – This teamwork is important because glaciers affect water supplies for millions of people. By studying the ice and the life inside it, scientists hope to better understand how glaciers are changing and find ways to protect them. The discoveries could help us learn more about the effects of global warming and how to slow it down.\n\n**What's next step** – The scientists will analyze the ice samples to learn about the species living inside and how glaciers have changed over time. This research might lead to new ideas for protecting glaciers and managing water resources as the climate continues to change.\n\n**One-sentence takeaway** – Combining mountaineering and science is helping us unlock glacier secrets that could aid efforts to slow climate change and protect water supplies.",
      "personality_title_fr": "Des alpinistes et des scientifiques unis pour étudier les glaciers et lutter contre le changement climatique",
      "personality_presentation_fr": "**Contexte** – Les glaciers sont d’immenses masses de glace qui se déplacent lentement dans les régions froides du monde. Ils contiennent beaucoup d’eau douce et aident à réguler le climat de la Terre. Mais avec le réchauffement climatique, beaucoup de glaciers fondent rapidement et pourraient disparaître d’ici la fin du siècle.\n\n**Ce qui s’est passé** – Une alpiniste française utilise ses compétences pour aider des scientifiques à atteindre des glaciers isolés dans le monde entier. Ensemble, ils prélèvent des échantillons de glace. Dans cette glace, ils découvrent de petits êtres vivants ou endormis qui pourraient donner des indices importants sur le fonctionnement des glaciers et leur réaction au changement climatique.\n\n**Impact** – Ce travail d’équipe est important car les glaciers influencent l’eau potable de millions de personnes. En étudiant la glace et la vie qu’elle contient, les scientifiques espèrent mieux comprendre les changements des glaciers et trouver des moyens de les protéger. Ces découvertes pourraient nous aider à mieux comprendre le réchauffement climatique et comment le ralentir.\n\n**Prochaine étape** – Les scientifiques analyseront les échantillons pour en savoir plus sur les espèces présentes et sur l’évolution des glaciers. Cette recherche pourrait mener à de nouvelles idées pour protéger les glaciers et gérer les ressources en eau face au changement climatique.\n\n**Résumé en une phrase** – L’alliance entre alpinisme et science permet de découvrir les secrets des glaciers pour aider la lutte contre le changement climatique et la protection de l’eau.",
      "personality_title_es": "Montañistas y científicos se unen para estudiar los glaciares y combatir el cambio climático",
      "personality_presentation_es": "**Contexto** – Los glaciares son grandes masas de hielo que se mueven lentamente en las zonas frías del mundo. Guardan mucha agua dulce y ayudan a controlar el clima de la Tierra. Pero debido al calentamiento global, muchos glaciares se están derritiendo rápido y podrían desaparecer para fines de este siglo.\n\n**Qué pasó** – Una escaladora francesa usa sus habilidades para ayudar a científicos a llegar a glaciares remotos en todo el mundo. Juntos, están recogiendo muestras de hielo. Dentro del hielo, encuentran pequeños seres vivos o dormidos que podrían dar pistas importantes sobre cómo funcionan los glaciares y cómo responden al cambio climático.\n\n**Impacto** – Este trabajo en equipo es importante porque los glaciares afectan el agua que usan millones de personas. Al estudiar el hielo y la vida dentro de él, los científicos esperan entender mejor cómo cambian los glaciares y encontrar formas de protegerlos. Los descubrimientos pueden ayudar a aprender más sobre el calentamiento global y cómo frenarlo.\n\n**Próximo paso** – Los científicos analizarán las muestras de hielo para conocer las especies que viven allí y cómo han cambiado los glaciares con el tiempo. Esta investigación podría llevar a nuevas ideas para proteger los glaciares y manejar el agua mientras el clima sigue cambiando.\n\n**Una frase clave** – La combinación del montañismo y la ciencia está ayudando a descubrir secretos de los glaciares que pueden apoyar la lucha contra el cambio climático y proteger el agua.",
      "image_url": "public/images/news_image_Unlocking-the-secrets-of-glaciers-Scientists-mount.png",
      "image_prompt": "A detailed painting of a vast glacier landscape with translucent ice layers revealing tiny, glowing microscopic life forms inside, alongside the silhouette of a climber carefully collecting an ice sample using specialized tools, all rendered in soft natural blues, whites, and earthy tones that evoke hope and scientific discovery."
    }
  ]
}